{
  "examples": {
    "comment_1": "ปรับลายน้ำข้อความ {{FileFormatUp}}",
    "comment_2": "สร้างอินสแตนซ์ {{TextWatermarker}} ด้วยเอกสารอินพุต {{FileFormatUp}}",
    "comment_3": "เริ่มต้น {{TextTextSearchCriteria}} และค้นหาลายน้ำข้อความ",
    "comment_4": "ปรับคุณสมบัติลายน้ำข้อความ",
    "comment_5": "บันทึกเอกสารที่อัพเดต"
  },
  "steps": {
    "title": "ปรับลายน้ำในเอกสาร {{FileformatCap}} ด้วย {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** ทำให้นักพัฒนา {{EnvName}} ปรับลายน้ำข้อความในแอปพลิเคชันได้อย่างง่ายดายโดยทำตามขั้นตอนง่ายๆ ไม่กี่ขั้นตอน:",
      "step_1": "โหลดไฟล์ {{FileformatCap}} ของคุณไปยังออบเจ็กต์หลักของ API ของเราชื่อ {{TextWatermarkerBold}} คุณสามารถจัดเตรียมไฟล์สำหรับการประมวลผลเพิ่มเติมในรูปแบบสตรีมหรือเส้นทางบนดิสก์ภายในเครื่องได้",
      "step_2": "ขั้นตอนต่อไปคือการค้นหาลายน้ำซึ่งจะต้องปรับเปลี่ยน {{TextSearchCriteriaBold}} ช่วยในการระบุลายน้ำที่มีคุณสมบัติที่ถูกต้องซึ่งถูกเพิ่มลงในเอกสารก่อนหน้านี้",
      "step_3": "รับรายการลายน้ำที่เหมาะสมตามขั้นตอน {{TextSearchBold}} ปรับคุณสมบัติลายน้ำที่พบ เช่น ขนาด การจัดแนวหน้า ข้อความ สี เนื้อหารูปภาพ ฯลฯ มีหลายวิธีในการปรับแต่งข้อมูลของคุณ",
      "step_4": "หลังจากเสร็จสิ้นกระบวนการปรับลายน้ำแล้ว คุณจะต้องบันทึกเอกสารที่อัปเดต ใช้เส้นทางไฟล์ในเครื่อง ไฟล์หรือสตรีมไบต์เพื่อจัดเก็บผลลัพธ์"
    }
  },
  "more_features": {
    "title": "ดำดิ่งลึกเข้าสู่การปรับลายน้ำ {{FileFormatUp}}",
    "description": "API ของเราช่วยให้แอปพลิเคชัน {{EnvName}} สามารถเพิ่ม แก้ไข ลบ และค้นหาลายน้ำในรูปแบบเอกสารยอดนิยม",
    "image_description": "ปรับลายน้ำ",
    "feature_1": {
      "title": "ลายน้ำเอกสารของคุณได้อย่างง่ายดาย",
      "content": "{{ProdShortName}} ช่วยลดความซับซ้อนให้กับนักพัฒนา {{EnvName}} เพิ่มลายน้ำที่หลากหลายลงในเอกสารและไฟล์ธุรกิจต่างๆไม่เพียง แต่คุณสามารถใช้ลายน้ำเท่านั้น แต่คุณยังสามารถอัปเดตหรือลบลายที่มีอยู่ได้อีกด้วย"
    },
    "feature_2": {
      "title": "ปรับแต่งลายน้ำตามความต้องการของคุณ",
      "content": "API ของเรามีตัวเลือกการปรับแต่งที่กว้างขวางปรับขนาด การหมุน สี แบบอักษร สไตล์ และอื่นๆ ได้อย่างง่ายดายเพื่อให้ได้ลายน้ำที่สมบูรณ์แบบ"
    },
    "feature_3": {
      "title": "ใช้คุณสมบัติเอกสารดั้งเดิม {{FileFormatUp}}",
      "content": "คุณสามารถใช้ฟังก์ชันดั้งเดิมได้ขึ้นอยู่กับรูปแบบเอกสารเฉพาะสิ่งเหล่านี้อาจรวมถึงพื้นหลังหน้าเอกสาร คำอธิบายประกอบ ส่วนหัว หรือวัตถุอื่น ๆ เป็นคอนเทนเนอร์ลายน้ำ"
    },
    "code_1": {
      "title": "PDF ปรับลายน้ำข้อความ",
      "content": "ตัวอย่างนี้แสดงวิธีการปรับข้อความของสิ่งประดิษฐ์เฉพาะ",
      "comment_1": "โหลดเอกสาร PDF",
      "comment_2": "รับเนื้อหาเอกสาร",
      "comment_3": "ปรับข้อความลายน้ำเฉพาะ",
      "comment_4": "บันทึกเอกสาร"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "ปรับเครื่องมือลายน้ำ Excel - {{ProdShortName}}",
      "description": "ปรับปรุง อัปเดต และจัดการลายน้ำได้อย่างง่ายดายด้วย {{ProdShortName}} ปรับแต่งเอกสารของคุณได้อย่างง่ายดาย"
    },
    "header": {
      "title": "ปรับเครื่องมือลายน้ำสเปรดชีต: ง่ายอย่างมีประสิทธิภาพ",
      "description": "ปรับปรุงเอกสารของคุณด้วยเครื่องมือแก้ไขลายน้ำที่ใช้งานง่ายของเราง่ายขึ้นเวิร์กโฟลว์ของคุณได้อย่างง่ายดาย",
      "subtitle": "{{ProdFullName}} เอพีอี",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} เอพีอี",
      "content": "**เครื่องมือปรับลายน้ำ**: เครื่องมือลายน้ำของเรานำเสนอโซลูชันที่ใช้งานง่ายเพื่อปรับปรุงและปกป้องเอกสารของคุณด้วยคุณสมบัติการแก้ไขที่ใช้งานง่าย การจัดการลายน้ำจะง่ายขึ้นทำให้มั่นใจได้ถึงความปลอดภัยและความถูกต้องของเอกสาร"
    },
    "formats": {
      "title": "ปรับลายน้ำผ่าน {{ProdFullName}} สำหรับรูปแบบอื่น",
      "description": "ปรับแต่งลายน้ำในรูปแบบเอกสารที่หลากหลายได้อย่างง่ายดายเพิ่มความปลอดภัยของเอกสารและความถูกต้องได้อย่างง่ายดาย"
    }
  },
  "word": {
    "ext": "ด็อกซ์",
    "head": {
      "title": "ปรับลายน้ำ Word ได้อย่างง่ายดาย - {{ProdShortName}}",
      "description": "ปรับลายน้ำได้อย่างราบรื่นในรูปแบบเอกสารหลายรูปแบบโดยใช้ {{ProdShortName}} เพิ่มความปลอดภัยของเอกสารของคุณ"
    },
    "header": {
      "title": "ปรับลายน้ำ Word: ปลอดภัยได้อย่างง่ายดาย",
      "description": "รักษาความปลอดภัยเอกสารของคุณได้อย่างง่ายดายด้วยความสามารถในการปรับเปลี่ยนลายน้ำอันทรงพลังของเราปกป้องเนื้อหาของคุณด้วยความมั่นใจ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**แก้ไขลายน้ำ**: {{ProdShortName}} ช่วยให้ผู้ใช้สามารถแก้ไขลายน้ำในรูปแบบเอกสารต่างๆได้อย่างราบรื่นด้วยการควบคุมที่แม่นยำและตัวเลือกที่หลากหลาย ปรับแต่งเอกสารของคุณด้วยความมั่นใจ"
    },
    "formats": {
      "title": "ปรับลายน้ำโดยใช้ {{ProdFullName}} สำหรับรูปแบบยอดนิยม",
      "description": "GroupDocs.Watermark รองรับการดัดแปลงลายน้ำอย่างราบรื่นในรูปแบบต่างๆปรับแต่งกลยุทธ์การทำลายน้ำของคุณให้ตรงกับความต้องการเฉพาะของคุณ"
    }
  },
  "powerpoint": {
    "ext": "พีพีทีเอ็กซ์",
    "head": {
      "title": "ปรับลายน้ำ PowerPoint ได้อย่างง่ายดาย - {{ProdShortName}}",
      "description": "อัปเดตลายน้ำในเอกสารประเภทต่างๆได้อย่างง่ายดายด้วย {{ProdShortName}} รักษาความสมบูรณ์ของเอกสารได้อย่างง่ายดาย"
    },
    "header": {
      "title": "ปรับลายน้ำ PowerPoint: การควบคุมความแม่นยำ",
      "description": "รักษาการควบคุมความสมบูรณ์ของเอกสารของคุณอย่างแม่นยำด้วยคุณสมบัติการอัปเดตลายน้ำของเราตรวจสอบความถูกต้องได้อย่างง่ายดาย",
      "subtitle": "{{ProdFullName}} ห้องสมุด",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} ห้องสมุด",
      "content": "**อัปเดตลายน้ำ**: ควบคุมความสมบูรณ์ของเอกสารของคุณด้วยคุณสมบัติการอัปเดตลายน้ำของเราแก้ไขลายน้ำในเอกสารประเภทต่างๆ ได้อย่างง่ายดาย รักษาความถูกต้องและความปลอดภัย"
    },
    "formats": {
      "title": "ปรับลายน้ำในรูปแบบธุรกิจโดย {{ProdFullName}}",
      "description": "อัปเดตลายน้ำในเอกสารประเภทต่างๆได้อย่างง่ายดายด้วยการควบคุมที่แม่นยำรักษาความสมบูรณ์และความปลอดภัยของเอกสารได้อย่างราบรื่น"
    }
  }
}