{
  "examples": {
    "comment_1": "به روز رسانی علامت متن {{FileFormatUp}}",
    "comment_2": "ارائه نمونه Watermarker برای فایل {{FileFormatUp}}",
    "comment_3": "برای یافتن واترمارک های متن از TextSearchCriteria استفاده کنید",
    "comment_4": "به روز رسانی واترمارک متن",
    "comment_5": "از نتیجه لذت ببرید"
  },
  "steps": {
    "title": "به روز رسانی واترمارک ها در {{FileFormatUp}} از طریق {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** {{EnvName}} توسعه دهندگان را به یک API قوی برای به روزرسانی برنامه ای واترمارک ها در {{FileFormatUp}} اسناد مختلف مجهز می کند. این راهنما روند را شرح می دهد:",
      "step_1": "**Watermarker** شروع کنید. بسته به خواسته های شما، فایل می تواند به عنوان یک جریان یا مرجع به یک مکان دیسک محلی ارائه شود.",
      "step_2": "**SearchCriteria** برای شناسایی واترمارک های خاصی که نیاز به اصلاح دارند استفاده کنید. این شیء تعیین دقیق واترمارک ها را بر اساس خواص مورد نظر امکان پذیر می کند.",
      "step_3": "پس از اجرای موفقیت آمیز جستجو، مجموعه ای از واترمارک های مربوطه دریافت خواهید کرد. این واترمارک ها کنترل دانه ای را ارائه می دهند و به شما امکان می دهند خواص مانند ابعاد، موقعیت صفحه، محتوای متن، طرح رنگ، داده های تصویر و موارد دیگر را به روز کنید.",
      "step_4": "پس از اتمام به روز رسانی واترمارک، سند اصلاح شده را حفظ کنید. API ذخیره سازی را با استفاده از یک مسیر فایل محلی یا یک شی جریان تسهیل می کند."
    }
  },
  "more_features": {
    "title": "تسلط بر ویرایش واترمارک در PDF ثانیه با {{ProdShortName}}",
    "description": "ویژگی های جامع API را برای تنظیم و مدیریت واترمارک ها در PDF s در {{EnvName}} برنامه بررسی کنید.",
    "image_description": "ویرایش واترمارک",
    "feature_1": {
      "title": "بدون زحمت واترمارک ها را در PDF s ویرایش کنید",
      "content": "{{ProdShortName}} ابزارهای قدرتمندی را در {{EnvName}} برای ویرایش یکپارچه واترمارک های موجود در PDF اسناد ارائه می دهد. موقعیت، شفافیت و موارد دیگر را با سهولت تنظیم کنید."
    },
    "feature_2": {
      "title": "جزئیات واترمارک را برای دقیق اصلاح کنید",
      "content": "کنترل جزئیات را در دست بگیرید. API ما به شما امکان می دهد ظاهر واترمارک ها را با جزئیات تنظیم کنید و تغییرات دقیق اندازه، کدورت و رنگ را در PDF s خود فعال کنید."
    },
    "feature_3": {
      "title": "مدیریت واترمارک ساده",
      "content": "API ما مدیریت واترمارک را ساده می کند. چه به روزرسانی و چه حذف کنید، می توانید واترمارک ها را به طور موثر مدیریت کنید و یکپارچگی اسناد را حفظ کنید و در عین حال نیازهای برندسازی خود"
    },
    "code_1": {
      "title": "Java مثال: ویرایش PDF واترمارک",
      "content": "این مثال Java نحوه ویرایش یک واترمارک موجود در یک سند PDF را نشان می دهد و نحوه تنظیم خواص آن به صورت برنامه نویسی را نشان می دهد.",
      "comment_1": "سند PDF را برای پردازش بارگیری کنید",
      "comment_2": "علامت های خاصی را جستجو کنید که معیارهای شما را برآورده می کنند",
      "comment_3": "تنظیمات علامت، مانند اندازه، رنگ و موقعیت را ویرایش کنید",
      "comment_4": "سند به روز شده را در یک سیستم محلی ذخیره کنید یا آن را مستقیماً پخش کنید"
    }
  },
  "excel": {
    "ext": "اکس‌اس‌لکس",
    "head": {
      "title": "به روز رسانی واترمارک ها برای صفحات گسترده Excel",
      "description": "واترمارک ها را در صفحات گسترده با فرمت های مختلف با استفاده از {{ProdFullName}} به روز کنید. {{EnvName}} برنامه های کاربردی خود را غنی کنید."
    },
    "header": {
      "title": "انقلابی در علامت گذاری صفحات گسترده با استفاده از {{EnvName}}",
      "description": "قدرت {{ProdFullName}} را تجربه کنید. اسناد کسب و کار خود را با واترمارک های مختلف ایمن کنید. اندازه واترمارک، تراز، زاویه چرخش، موقعیت و غیره را به روز کنید",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "{{ProdFullName}} یک راه حل جامع برای مدیریت واترمارک ها با استفاده از محیط {{EnvName}} است. با استفاده از این ابزار، توسعه دهندگان می توانند به راحتی عملیاتی مانند افزودن، ویرایش، جستجو و حذف واترمارک از اسناد در قالب های مختلف فایل، از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل، و فرمت های تصویر را انجام دهند. {{ProdShortName}} از تمام سیستم عامل های اصلی و نسخه های Node.js پشتیبانی می کند."
    },
    "formats": {
      "title": "به روز رسانی واترمارک ها در فرمت های فایل پشتیبانی شده",
      "description": "به طور موثر واترمارک ها را در PDF، Word، Excel و موارد دیگر با {{ProdFullName}} به روز کنید. اسناد واتردار ممکن است فرآیندهای کسب و کار شما را غنی کند."
    }
  },
  "word": {
    "ext": "داکس",
    "head": {
      "title": "به راحتی واترمارک ها را در {{FileFormatUp}} به روز کنید",
      "description": "به روزرسانی واترمارک در {{FileFormatUp}} فرمت های سند با {{ProdShortName}} با استفاده از {{EnvName}} ساده کنید. راه حل های کسب و کار خود را تقویت کنید."
    },
    "header": {
      "title": "به روز رسانی علامت اسناد {{FileFormatUp}} Streamline",
      "description": "قابلیت های بهروزرسانی واترمارک کارآمد را با {{ProdFullName}} باز کنید. از اسناد کسب و کار خود با استفاده از انواع واترمارک ها محافظت کنید. ویژگی های واترمارک مانند اندازه، تراز، زاویه چرخش و موقعیت را متناسب با نیازهای خود به روز کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}} توانایی",
      "content": "{{ProdFullName}} یک راه حل یکپارچه برای مدیریت واترمارک ها با استفاده از {{EnvName}} برنامه ارائه می دهد. این ابزار همه کاره توسعه دهندگان را قادر می سازد تا بدون زحمت واترمارک ها را در اسناد فرمت های مختلف فایل، از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل و فرمت های تصویر ویرایش کنند. {{ProdShortName}} از تمام سیستم عامل های اصلی و {{EnvName}} نسخه پشتیبانی می کند."
    },
    "formats": {
      "title": "به روز رسانی واترمارک ها در فرمت های دیگر فایل",
      "description": "ویرایش واترمارک در PDF، Word، Excel و موارد دیگر را با {{ProdFullName}} ساده کنید. تمام فرمت های تجاری محبوب پشتیبانی می شوند."
    }
  },
  "powerpoint": {
    "ext": "پی‌تی‌اکس",
    "head": {
      "title": "به روز رسانی واترمارک ها در {{FileFormatUp}} بدون زحمت",
      "description": "به طور موثر واترمارک ها را در قالب های {{FileFormatUp}} سند با استفاده از {{ProdFullName}} به روز کنید. فرآیندهای کسب و کار خود را پالش کنید."
    },
    "header": {
      "title": "بدون زحمت به روز رسانی {{FileFormatUp}} واترمارک های سند",
      "description": "حذف علامت بدون دردسر با {{ProdFullName}} تجربه کنید. از اسناد کسب و کار خود با علامت های مختلف محافظت کنید. ابعاد واترمارک، تراز، زاویه چرخش و قرار دادن و موارد دیگر را سفارشی کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دریافت رایگان از {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} آپی",
      "content": "{{ProdFullName}} یک راه حل کاربر پسند برای مدیریت {{FileFormatUp}} واترمارک با استفاده از {{EnvName}} ارائه می دهد. با استفاده از این ابزار، توسعه دهندگان می توانند به طور کارآمد واترمارک ها را در اسناد و فرمت های فایل مختلف از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، و فرمت های ایمیل به روز کنند. {{ProdShortName}} از تمام سیستم عامل های اصلی و {{EnvName}} نسخه پشتیبانی می کند."
    },
    "formats": {
      "title": "به روز رسانی واترمارک ها در فرمت های دیگر فایل",
      "description": "به طور موثر واترمارک ها را در PDF، Word، Excel و غیره با استفاده از {{ProdFullName}} به روز کنید. ما از تمام فرمت های تجاری محبوب پشتیبانی می کنیم."
    }
  }
}