{
  "examples": {
    "comment_1": "อัปเดตลายน้ำข้อความ {{FileFormatUp}}",
    "comment_2": "ระบุอินสแตนซ์ {{TextWatermarker}} สำหรับไฟล์ {{FileFormatUp}}",
    "comment_3": "ใช้ {{TextTextSearchCriteria}} เพื่อค้นหาลายน้ำข้อความ",
    "comment_4": "อัปเดตลายน้ำข้อความ",
    "comment_5": "เพลิดเพลินไปกับผลลัพธ์"
  },
  "steps": {
    "title": "อัปเดตลายน้ำใน {{FileFormatUp}} ผ่าน {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** ช่วยให้นักพัฒนา {{EnvName}} มี API ที่มีประสิทธิภาพสำหรับการอัปเดตลายน้ำทางโปรแกรมภายในเอกสาร {{FileFormatUp}} ต่างๆ คู่มือนี้จะสรุปกระบวนการ:",
      "step_1": "เริ่มต้นกระบวนการโดยระบุไฟล์ {{FileFormatUp}} ของคุณเป็นอาร์กิวเมนต์ให้กับตัวสร้างคลาส {{TextWatermarkerBold}} ทั้งนี้ขึ้นอยู่กับความต้องการของคุณ ไฟล์สามารถจัดเตรียมเป็นสตรีมหรือการอ้างอิงไปยังตำแหน่งของดิสก์ในเครื่องได้",
      "step_2": "จากนั้น ใช้ประโยชน์จากออบเจ็กต์ {{TextSearchCriteriaBold}} เพื่อระบุลายน้ำเฉพาะที่ต้องมีการแก้ไข วัตถุนี้ช่วยให้สามารถระบุลายน้ำตามคุณสมบัติที่ต้องการได้",
      "step_3": "เมื่อดำเนินการค้นหาสำเร็จ คุณจะได้รับชุดลายน้ำที่เกี่ยวข้อง ลายน้ำเหล่านี้ให้การควบคุมแบบละเอียด ช่วยให้คุณสามารถอัปเดตคุณสมบัติต่างๆ เช่น ขนาด การวางตำแหน่งหน้า เนื้อหาข้อความ รูปแบบสี ข้อมูลรูปภาพ และอื่นๆ",
      "step_4": "หลังจากการอัปเดตลายน้ำเสร็จสิ้น ให้คงเอกสารที่แก้ไขไว้ API อำนวยความสะดวกในการจัดเก็บข้อมูลโดยใช้เส้นทางไฟล์ในเครื่องหรือออบเจ็กต์สตรีม"
    }
  },
  "more_features": {
    "title": "เรียนรู้การแก้ไขลายน้ำใน PDF วินาทีด้วย {{ProdShortName}}",
    "description": "สำรวจคุณสมบัติ API ที่ครอบคลุมสำหรับการปรับและจัดการลายน้ำใน PDF s ภายในแอปพลิเคชัน {{EnvName}}",
    "image_description": "แก้ไขลายน้ำ",
    "feature_1": {
      "title": "แก้ไขลายน้ำได้อย่างง่ายดายใน PDF s",
      "content": "{{ProdShortName}} นำเสนอเครื่องมือที่แข็งแกร่งใน {{EnvName}} เพื่อแก้ไขลายน้ำที่มีอยู่ในเอกสาร PDF ได้อย่างราบรื่นปรับตำแหน่ง ความโปร่งใส และอื่น ๆ ได้อย่างง่ายดาย"
    },
    "feature_2": {
      "title": "ปรับแต่งรายละเอียดลายน้ำเพื่อความแม่นยำ",
      "content": "ควบคุมรายละเอียดAPI ของเราช่วยให้คุณสามารถปรับลักษณะของลายน้ำได้อย่างละเอียด ทำให้สามารถปรับเปลี่ยนขนาด ความทึบแสง และสีได้อย่างแม่นยำใน PDF s ของคุณ"
    },
    "feature_3": {
      "title": "การจัดการลายน้ำที่คล่องตัว",
      "content": "API ของเราช่วยลดความยุ่งยากในการจัดการลายน้ำไม่ว่าจะอัปเดตหรือลบ คุณสามารถจัดการลายน้ำได้อย่างมีประสิทธิภาพ รักษาความสมบูรณ์ของเอกสารในขณะที่ตอบสนองความต้องการด้านการสร้างแบรนด์ของคุณ"
    },
    "code_1": {
      "title": "Java ตัวอย่าง: แก้ไข PDF ลายน้ำ",
      "content": "ตัวอย่าง Java นี้แสดงให้เห็นถึงวิธีการแก้ไขลายน้ำที่มีอยู่ในเอกสาร PDF โดยแสดงวิธีการปรับคุณสมบัติเป็นโปรแกรม",
      "comment_1": "โหลดเอกสาร PDF เพื่อประมวลผล",
      "comment_2": "ค้นหาลายน้ำเฉพาะที่ตรงตามเกณฑ์ของคุณ",
      "comment_3": "แก้ไขการตั้งค่าลายน้ำ เช่น ขนาด สี และตำแหน่ง",
      "comment_4": "บันทึกเอกสารที่อัปเดตลงในระบบท้องถิ่นหรือสตรีมโดยตรง"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "อัปเดตลายน้ำสำหรับ Excel สเปรดชีต",
      "description": "อัปเดตลายน้ำในสเปรดชีตในรูปแบบต่างๆโดยใช้ {{ProdFullName}}เสริมสร้างแอปพลิเคชัน {{EnvName}} ของคุณ"
    },
    "header": {
      "title": "ปฏิวัติสเปรดชีตลายน้ำโดยใช้ {{EnvName}}",
      "description": "สัมผัสพลังของ {{ProdFullName}}รักษาความปลอดภัยเอกสารทางธุรกิจของคุณด้วยลายน้ำต่างๆอัปเดตขนาดลายน้ำ การจัดตำแหน่งมุมหมุน ตำแหน่ง ฯลฯ",
      "subtitle": "{{ProdFullName}} เอพีอี",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} ห้องสมุด",
      "content": "{{ProdFullName}} เป็นโซลูชันที่ครอบคลุมสำหรับการจัดการลายน้ำโดยใช้สภาพแวดล้อม {{EnvName}}ด้วยเครื่องมือนี้ นักพัฒนาสามารถดำเนินการได้อย่างง่ายดาย เช่น การเพิ่ม แก้ไข ค้นหา และลบลายน้ำออกจากเอกสารในรูปแบบไฟล์ต่างๆ รวมถึง PDF, Microsoft Word, Excel, PowerPoint, Visio อีเมลและรูปแบบภาพ {{ProdShortName}} รองรับระบบปฏิบัติการหลักทั้งหมดและเวอร์ชัน Node.js"
    },
    "formats": {
      "title": "อัปเดตลายน้ำในรูปแบบไฟล์ที่รองรับ",
      "description": "อัปเดตลายน้ำอย่างมีประสิทธิภาพใน PDF, Word, Excel และอื่น ๆ ด้วย {{ProdFullName}}เอกสารลายน้ำอาจเสริมกระบวนการทางธุรกิจของคุณ"
    }
  },
  "word": {
    "ext": "ด็อกซ์",
    "head": {
      "title": "อัปเดตลายน้ำใน {{FileFormatUp}} ได้อย่างง่ายดาย",
      "description": "ลดความซับซ้อนในการอัปเดตลายน้ำในรูปแบบเอกสาร {{FileFormatUp}} ด้วย {{ProdShortName}} โดยใช้ {{EnvName}}เพิ่มพลังให้กับโซลูชันทางธุรกิจของคุณ"
    },
    "header": {
      "title": "การปรับปรุงลายน้ำ {{FileFormatUp}} ของเอกสาร Streamline",
      "description": "ปลดล็อกความสามารถในการอัปเดตลายน้ำที่มีประสิทธิภาพด้วย {{ProdFullName}}ปกป้องเอกสารทางธุรกิจของคุณโดยใช้ลายน้ำที่หลากหลายอัปเดตแอตทริบิวต์ลายน้ำ เช่น ขนาด การจัดตำแหน่ง มุมการหมุน และตำแหน่งเพื่อให้เหมาะกับความต้องการของคุณ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "ความสามารถ {{ProdFullName}}",
      "content": "{{ProdFullName}} นำเสนอโซลูชันที่ราบรื่นสำหรับการจัดการลายน้ำโดยใช้แอปพลิเคชัน {{EnvName}}เครื่องมืออเนกประสงค์นี้ช่วยให้นักพัฒนาสามารถแก้ไขลายน้ำในเอกสารในรูปแบบไฟล์ต่างๆ ได้อย่างง่ายดาย รวมถึง PDF, Microsoft Word, Excel, PowerPoint, Visio, อีเมลและรูปแบบรูปภาพ {{ProdShortName}} รองรับระบบปฏิบัติการที่สำคัญทั้งหมดและ {{EnvName}} เวอร์ชัน"
    },
    "formats": {
      "title": "อัปเดตลายน้ำในรูปแบบไฟล์อื่น ๆ",
      "description": "ลดความซับซ้อนในการแก้ไขลายน้ำใน PDF, Word, Excel และอื่นๆ ด้วย {{ProdFullName}}รองรับรูปแบบธุรกิจยอดนิยมทั้งหมด"
    }
  },
  "powerpoint": {
    "ext": "พีพีทีเอ็กซ์",
    "head": {
      "title": "อัปเดตลายน้ำใน {{FileFormatUp}} ได้อย่างง่ายดาย",
      "description": "อัปเดตลายน้ำอย่างมีประสิทธิภาพในรูปแบบเอกสาร {{FileFormatUp}} โดยใช้ {{ProdFullName}}ขัดกระบวนการทางธุรกิจของคุณ"
    },
    "header": {
      "title": "อัปเดตลายน้ำเอกสาร {{FileFormatUp}} ได้อย่างง่ายดาย",
      "description": "สัมผัสประสบการณ์การลบลายน้ำได้อย่างง่ายดายด้วย {{ProdFullName}}ปกป้องเอกสารทางธุรกิจของคุณด้วยลายน้ำที่หลากหลายปรับแต่งขนาดลายน้ำ การจัดตำแหน่ง มุมการหมุน และตำแหน่ง และอื่นๆ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "รับจาก {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}} เอพีอี",
      "content": "{{ProdFullName}} เป็นโซลูชันที่ใช้งานง่ายสำหรับการจัดการลายน้ำ {{FileFormatUp}} โดยใช้ {{EnvName}}ด้วยเครื่องมือนี้ นักพัฒนาสามารถอัปเดตลายน้ำในเอกสารและรูปแบบไฟล์ต่างๆ ได้อย่างมีประสิทธิภาพ รวมถึง PDF, Microsoft Word, Excel, PowerPoint, Visio และรูปแบบอีเมล {{ProdShortName}} รองรับระบบปฏิบัติการที่สำคัญทั้งหมดและ {{EnvName}} เวอร์ชัน"
    },
    "formats": {
      "title": "อัปเดตลายน้ำในรูปแบบไฟล์อื่น ๆ",
      "description": "อัปเดตลายน้ำอย่างมีประสิทธิภาพใน PDF, Word, Excel และอื่น ๆ โดยใช้ {{ProdFullName}}เราสนับสนุนรูปแบบธุรกิจยอดนิยมทั้งหมด"
    }
  }
}