{
  "examples": {
    "comment_1": "แก้ไขลายน้ำข้อความ {{FileFormatUp}}",
    "comment_2": "ทำให้ {{TextWatermarker}} มีไฟล์ {{FileFormatUp}}",
    "comment_3": "สร้าง {{TextTextSearchCriteria}} และรับลายน้ำข้อความ",
    "comment_4": "แก้ไขลายน้ำข้อความ",
    "comment_5": "บันทึกเอกสาร"
  },
  "steps": {
    "title": "แก้ไขลายน้ำในเอกสาร {{FileformatCap}} โดยใช้ {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** ช่วยให้นักพัฒนา {{EnvName}} แก้ไขลายน้ำภายในเอกสาร {{FileformatCap}} ต่างๆ ได้อย่างง่ายดาย คำแนะนำง่ายๆ ในการใช้ API ของเราในแอปพลิเคชันของคุณมีดังนี้:",
      "step_1": "เริ่มต้นด้วยการส่งไฟล์ {{FileformatCap}} ของคุณเป็นพารามิเตอร์ไปยังตัวสร้างคลาส {{TextWatermarkerBold}} คุณสามารถระบุไฟล์เป็นสตรีมไบต์ สตรีมไฟล์ หรือเส้นทางดิสก์ในเครื่องได้",
      "step_2": "ถัดไป ค้นหาลายน้ำเฉพาะที่ต้องมีการแก้ไข ใช้ {{TextSearchCriteriaBold}} เพื่อระบุลายน้ำที่มีคุณสมบัติที่เกี่ยวข้องซึ่งเพิ่มลงในเอกสารก่อนหน้านี้",
      "step_3": "หลังจากการค้นหา คุณจะได้รับรายการลายน้ำที่เกี่ยวข้อง จากนั้นคุณสามารถปรับแต่งคุณสมบัติต่างๆ ได้ เช่น ขนาด การจัดแนวหน้า ข้อความ สี เนื้อหารูปภาพ และอื่นๆ สิ่งนี้ทำให้คุณสามารถควบคุมข้อมูลของคุณได้อย่างกว้างขวาง",
      "step_4": "เมื่อคุณแก้ไขลายน้ำเสร็จแล้ว ให้บันทึกเอกสารที่อัปเดต คุณสามารถใช้เส้นทางไฟล์ในเครื่องหรือสตรีมเพื่อจัดเก็บผลลัพธ์สุดท้ายได้"
    }
  },
  "more_features": {
    "title": "เรียนรู้เพิ่มเติมเกี่ยวกับการปรับเปลี่ยนลายน้ำ",
    "description": "เพิ่มพลังให้กับแอปพลิเคชัน {{EnvName}} ของคุณด้วยไลบรารีของเรา และเพิ่ม แก้ไข ลบ หรือค้นหาลายน้ำในรูปแบบไฟล์ต่างๆ",
    "image_description": "แก้ไขลายน้ำ",
    "feature_1": {
      "title": "ไฟล์ลายน้ำสำหรับธุรกิจของคุณ",
      "content": "ใช้ {{ProdFullName}} เพื่อทำลายน้ำไฟล์และเอกสารเพิ่มและจัดการลายน้ำโดยไม่ต้องใช้ความพยายามเป็นพิเศษในการใช้ API ของเราในแอปพลิเคชันของคุณค้นหา แก้ไข และลบลายน้ำที่เพิ่มไว้ก่อนหน้านี้"
    },
    "feature_2": {
      "title": "ปรับลายน้ำให้ละเอียดตามความต้องการของคุณ",
      "content": "API ของเรามีชุดตัวเลือกการปรับแต่งที่ครอบคลุมปรับเปลี่ยนแง่มุมต่างๆ เช่น ขนาด การวางแนวโทนสี ตระกูลแบบอักษร และอื่น ๆ ได้อย่างง่ายดายเพื่อสร้างลายน้ำในอุดมคติ"
    },
    "feature_3": {
      "title": "ใช้ประโยชน์จากคุณสมบัติเฉพาะเอกสาร",
      "content": "คุณสามารถรวมฟังก์ชันในตัวได้ทั้งนี้ขึ้นอยู่กับรูปแบบไฟล์ที่คุณใช้สิ่งเหล่านี้อาจรวมถึงพื้นหลังของเอกสาร คำอธิบายประกอบ ส่วนหัว หรือองค์ประกอบอื่น ๆ ที่จะทำหน้าที่เป็นคอนเทนเนอร์ลายน้ำ"
    },
    "code_1": {
      "title": "Excel แก้ไขข้อความลายน้ำ",
      "content": "ตัวอย่างนี้แสดงวิธีแก้ไขข้อความสำหรับลายน้ำเฉพาะในแผ่นงาน Excel",
      "comment_1": "โหลดสเปรดชีต XLSX",
      "comment_2": "โหลดเนื้อหาสเปรดชีต",
      "comment_3": "แก้ไขข้อความด้านในลายน้ำ",
      "comment_4": "บันทึกผลลัพธ์ผลลัพธ์"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "แก้ไขลายน้ำในรูปแบบ {{FileformatCap}}",
      "description": "ปรับแต่งและรักษาความปลอดภัยเอกสารของคุณได้อย่างง่ายดายด้วย {{ProdFullName}} เพิ่มความสมบูรณ์ของเอกสารและแก้ไขลายน้ำ {{FileformatCap}} ได้อย่างง่ายดาย"
    },
    "header": {
      "title": "แก้ไขลายน้ำ {{FileformatCap}} สเปรดชีตของคุณ: ประสิทธิภาพ {{EnvName}}",
      "description": "เพิ่มความปลอดภัยของเอกสารของคุณด้วยเครื่องมือทำลายน้ำที่ปรับแต่งได้ของเราที่ออกแบบมาเพื่อประสิทธิภาพ {{EnvName}}แก้ไขลายน้ำ Excel ได้อย่างง่ายดาย",
      "subtitle": "{{ProdFullName}} เอพีอี",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} ห้องสมุด",
      "content": "**แก้ไขลายน้ำ {{FileformatCap}} ด้วยเครื่องมือของเรา:** เครื่องมือ {{ProdFullName}} ของเรานำเสนอกลยุทธ์ที่มีประสิทธิภาพในการปรับปรุงและปกป้องเอกสารของคุณด้วยคุณสมบัติที่หลากหลายสำหรับนักพัฒนา {{EnvName}} การจัดการลายน้ำกลายเป็นเรื่องง่าย ทำให้มั่นใจได้ถึงความปลอดภัยและความถูกต้องของเอกสาร"
    },
    "formats": {
      "title": "ปรับแต่งลายน้ำของคุณในรูปแบบอื่น",
      "description": "ลายน้ำในรูปแบบเอกสารที่หลากหลายตามความต้องการของคุณด้วย {{ProdFullName}}"
    }
  },
  "word": {
    "ext": "ด็อกซ์",
    "head": {
      "title": "แก้ไขลายน้ำในเอกสาร {{FileformatCap}}",
      "description": "ปรับแต่งตำแหน่งลายน้ำและตรวจสอบความปลอดภัยของเอกสารด้วย {{ProdFullName}} ปรับแต่งลายน้ำ {{FileformatCap}} ในโซลูชันของคุณได้อย่างง่ายดาย"
    },
    "header": {
      "title": "เพิ่มลายน้ำ {{FileformatCap}}: ความมั่นใจ {{EnvName}}",
      "description": "ตรวจสอบความถูกต้องของเอกสาร {{FileformatCap}} และความสมบูรณ์ของแบรนด์ด้วย {{ProdFullName}} แก้ไขลายน้ำโดยใช้โซลูชันของเราอย่างมั่นใจ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**เพิ่มความปลอดภัยของเอกสาร {{FileformatCap}}:** {{ProdFullName}} ช่วยให้นักพัฒนาสามารถเพิ่มความปลอดภัยของเอกสารได้อย่างง่ายดายแก้ไขลายน้ำของคุณเพื่อตอบสนองความต้องการเฉพาะของคุณด้วยความมั่นใจ"
    },
    "formats": {
      "title": "เพิ่มความปลอดภัยในรูปแบบอื่น ๆ",
      "description": "{{ProdFullName}} นำเสนอโซลูชันที่มีประสิทธิภาพเพื่อเพิ่มความปลอดภัยของเอกสารในรูปแบบต่างๆ"
    }
  },
  "powerpoint": {
    "ext": "พีพีทีเอ็กซ์",
    "head": {
      "title": "แก้ไขลายน้ำในเอกสาร {{FileformatCap}}",
      "description": "ลดความซับซ้อนในการแก้ไขลายน้ำ {{FileformatCap}} และปกป้องเอกสารของคุณด้วย {{ProdFullName}} ไลบรารีบรรลุการควบคุมที่แม่นยำและความคล่องตัว"
    },
    "header": {
      "title": "แก้ไขตำแหน่งลายน้ำ {{FileformatCap}}: ความแม่นยำ {{EnvName}}",
      "description": "สามารถควบคุมตำแหน่งลายน้ำและความปลอดภัยของเอกสารได้อย่างแม่นยำด้วยโซลูชัน {{ProdFullName}} แก้ไขลายน้ำ {{FileformatCap}} อย่างแม่นยำ",
      "subtitle": "{{ProdFullName}} ห้องสมุด",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} เอพีอี",
      "content": "**แก้ไขตำแหน่งลายน้ำ {{FileformatCap}}:** บรรลุการควบคุมตำแหน่งลายน้ำและความปลอดภัยของเอกสารได้อย่างแม่นยำด้วยนักพัฒนา {{ProdFullName}}ปรับปรุงเวิร์กโฟลว์ของคุณและตรวจสอบความถูกต้องได้อย่างง่ายดาย"
    },
    "formats": {
      "title": "ปรับแต่งลายน้ำในรูปแบบอื่น ๆ",
      "description": "แก้ไขลายน้ำในรูปแบบเอกสารต่างๆด้วย {{ProdFullName}}"
    }
  }
}