{
  "examples": {
    "comment_1": "Обновить текстовый водяной знак {{FileFormatUp}}",
    "comment_2": "Предоставьте экземпляр {{TextWatermarker}} для файла {{FileFormatUp}}.",
    "comment_3": "Используйте {{TextTextSearchCriteria}} для поиска текстовых водяных знаков.",
    "comment_4": "Обновить текстовый водяной знак",
    "comment_5": "Наслаждайтесь результатом"
  },
  "steps": {
    "title": "Обновите водяные знаки в {{FileFormatUp}} через {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** предоставляет разработчикам {{EnvName}} надежный API для программного обновления водяных знаков в различных документах {{FileFormatUp}}. В этом руководстве описан процесс:",
      "step_1": "Начните процесс, предоставив файл {{FileFormatUp}} в качестве аргумента конструктору класса {{TextWatermarkerBold}}. В зависимости от ваших требований файл может быть предоставлен либо в виде потока, либо в виде ссылки на местоположение на локальном диске.",
      "step_2": "Впоследствии используйте объект {{TextSearchCriteriaBold}}, чтобы определить конкретные водяные знаки, требующие изменения. Этот объект позволяет точно определять водяные знаки на основе желаемых свойств.",
      "step_3": "После успешного выполнения поиска вы получите коллекцию соответствующих водяных знаков. Эти водяные знаки обеспечивают детальный контроль, позволяя обновлять такие свойства, как размеры, расположение страницы, текстовое содержимое, цветовую схему, данные изображения и многое другое.",
      "step_4": "После завершения обновления водяных знаков сохраните измененный документ. API упрощает хранение, используя либо локальный путь к файлу, либо объект потока."
    }
  },
  "more_features": {
    "title": "Освоение редактирования водяных знаков за PDF с помощью {{ProdShortName}}",
    "description": "Изучите комплексные функции API для настройки водяных знаков и управления ими в PDF s в {{EnvName}} приложениях.",
    "image_description": "Изменить водяной знак",
    "feature_1": {
      "title": "Без труда редактируйте водяные знаки за PDF s",
      "content": "{{ProdShortName}} предлагает надежные инструменты в {{EnvName}} для удобного редактирования существующих водяных знаков в PDF документах. С легкостью настраивайте положение, прозрачность и многое другое."
    },
    "feature_2": {
      "title": "Уточните детали водяных знаков для обеспечения точности",
      "content": "Возьмите детали под свой контроль. Наш API позволяет точно настроить внешний вид водяных знаков, точно изменяя размер, непрозрачность и цвет ваших PDF s."
    },
    "feature_3": {
      "title": "Упрощенное управление водяными знаками",
      "content": "Наш API упрощает управление водяными знаками. Независимо от того, обновляете ли вы или удаляете водяные знаки, вы можете эффективно управлять водяными знаками, сохраняя целостность документов и удовлетворяя потребности в брендинге."
    },
    "code_1": {
      "title": "Java Пример: отредактируйте водяной знак PDF",
      "content": "В этом примере Java показано, как редактировать существующий водяной знак в документе PDF и как программно настроить его свойства.",
      "comment_1": "Загрузите документ PDF для обработки",
      "comment_2": "Найдите конкретные водяные знаки, соответствующие вашим критериям",
      "comment_3": "Отредактируйте настройки водяного знака, такие как размер, цвет и положение",
      "comment_4": "Сохраните обновленный документ в локальной системе или передайте его напрямую"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "Обновить водяные знаки для электронных таблиц Excel",
      "description": "Обновите водяные знаки в электронных таблицах различных форматов, используя {{ProdFullName}}. Обогатите свои {{EnvName}} приложения."
    },
    "header": {
      "title": "Революционизируйте использование водяных знаков в электронных таблицах с помощью {{EnvName}}",
      "description": "Ощутите всю мощь {{ProdFullName}}. Защитите свои деловые документы различными водяными знаками. Обновите размер водяного знака, выравнивание, угол поворота, положение и т. д.",
      "subtitle": "{{ProdFullName}} API",
      "action_title": "Скачать бесплатно {{PackageStoreName}}"
    },
    "about": {
      "title": "библиотека {{ProdFullName}}",
      "content": "{{ProdFullName}} — это комплексное решение для управления водяными знаками в среде {{EnvName}}. С помощью этого инструмента разработчики могут легко выполнять такие операции, как добавление, редактирование, поиск и удаление водяных знаков из документов в различных форматах файлов, включая PDF, Microsoft Word, Excel, PowerPoint, Visio, электронную почту и графические форматы. {{ProdShortName}} поддерживает все основные операционные системы и версии Node.js."
    },
    "formats": {
      "title": "Обновление водяных знаков в поддерживаемых форматах файлов",
      "description": "Эффективно обновляйте водяные знаки в PDF, Word, Excel и других системах с помощью {{ProdFullName}}. Документы с водяными знаками могут обогатить ваши бизнес-процессы."
    }
  },
  "word": {
    "ext": "docx",
    "head": {
      "title": "Легко обновляйте водяные знаки в {{FileFormatUp}}",
      "description": "Упростите обновление водяных знаков в форматах документов {{FileFormatUp}}, используя {{ProdShortName}}, используя {{EnvName}}. Расширьте возможности своих бизнес-решений."
    },
    "header": {
      "title": "Упростите обновление водяных знаков в документах {{FileFormatUp}}",
      "description": "Откройте для себя эффективные возможности обновления водяных знаков с помощью {{ProdFullName}}. Защитите свои деловые документы с помощью различных водяных знаков. Обновите атрибуты водяных знаков, такие как размер, выравнивание, угол поворота и положение, в соответствии со своими потребностями.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Скачайте бесплатно на {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} способностей",
      "content": "{{ProdFullName}} предлагает удобное решение для управления водяными знаками с помощью {{EnvName}} приложений. Этот универсальный инструмент позволяет разработчикам легко редактировать водяные знаки в документах различных форматов файлов, включая PDF, Microsoft Word, Excel, PowerPoint, Visio, электронную почту и форматы изображений. {{ProdShortName}} поддерживает все основные операционные системы и версии {{EnvName}}."
    },
    "formats": {
      "title": "Обновить водяные знаки в других форматах файлов",
      "description": "Упростите редактирование водяных знаков в PDF, Word, Excel и других версиях с помощью {{ProdFullName}}. Поддерживаются все популярные бизнес-форматы."
    }
  },
  "powerpoint": {
    "ext": "pptx",
    "head": {
      "title": "Без труда обновляйте водяные знаки в {{FileFormatUp}}",
      "description": "Эффективно обновляйте водяные знаки в форматах документов {{FileFormatUp}} с помощью {{ProdFullName}}. Усовершенствуйте свои бизнес-процессы."
    },
    "header": {
      "title": "Без труда обновляйте водяные знаки документа {{FileFormatUp}}",
      "description": "Ощутите беспроблемное удаление водяных знаков с помощью {{ProdFullName}}. Защитите свои деловые документы различными водяными знаками. Настройте размеры водяных знаков, положение, угол поворота и расположение водяных знаков и многое другое.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Получите бесплатный доступ от {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} API",
      "content": "{{ProdFullName}} предоставляет удобное решение для управления {{FileFormatUp}} водяными знаками с помощью {{EnvName}}. С помощью этого инструмента разработчики могут эффективно обновлять водяные знаки в различных документах и форматах файлов, включая PDF, Microsoft Word, Excel, PowerPoint, Visio и форматы электронной почты. {{ProdShortName}} поддерживает все основные операционные системы и версии {{EnvName}}."
    },
    "formats": {
      "title": "Обновить водяные знаки в других форматах файлов",
      "description": "Эффективно обновляйте водяные знаки в PDF, Word, Excel и т. д., используя {{ProdFullName}}. Мы поддерживаем все популярные бизнес-форматы."
    }
  }
}