{
  "examples": {
    "comment_1": "Налаштування {{FileFormatUp}} текстового водяного знака",
    "comment_2": "Створіть водяний маркер із введеним документом {{FileFormatUp}}",
    "comment_3": "Ініціалізуйте TextSearchCriteria та знайдіть текстові водяні знаки",
    "comment_4": "Налаштування властивостей водяного знака тексту",
    "comment_5": "Збережіть оновлений документ"
  },
  "steps": {
    "title": "Налаштування водяних знаків у документах {{FileformatCap}} за допомогою {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** дозволяє розробникам {{EnvName}} легко налаштувати текстові водяні знаки у своїх програмах, реалізуючи кілька простих кроків:",
      "step_1": "**Watermarker**. Ви можете надати файл для подальшої обробки як потік або як шлях на локальному диску.",
      "step_2": "**Критерії пошуку** допомагає ідентифікувати водяні знаки з правими властивостями, які раніше були додані до документа.",
      "step_3": "**Пошук**. Налаштуйте знайдені властивості водяних знаків, такі як розмір, вирівнювання сторінки, текст, колір, вміст зображення тощо Є багато способів налаштувати ваші дані.",
      "step_4": "Після завершення процесу налаштування водяних знаків потрібно зберегти оновлений документ. Використовуйте локальний шлях до файлу, файл або байтовий потік для зберігання результатів."
    }
  },
  "more_features": {
    "title": "Глибоко зануритися в {{FileFormatUp}} коригування водяного знака",
    "description": "Наш API надає {{EnvName}} програмам можливість додавати, редагувати, видаляти та шукати водяні знаки у популярних форматах документів.",
    "image_description": "Налаштування водяного знака",
    "feature_1": {
      "title": "Легко водяним знаком ваші документи",
      "content": "{{ProdShortName}} спрощує водяні маркування для розробників {{EnvName}}. Додайте різноманітні водяні знаки до різних ділових документів і файлів. Ви не тільки можете застосовувати водяні знаки, але також можете оновити або видалити існуючі."
    },
    "feature_2": {
      "title": "Налаштуйте водяні знаки відповідно до ваших потреб",
      "content": "Наш API надає широкі можливості налаштування. Легко регулюйте розмір, обертання, колір, шрифт, стилі тощо, щоб досягти ідеального водяного знака."
    },
    "feature_3": {
      "title": "Використання функцій власного документа {{FileFormatUp}}",
      "content": "Залежно від конкретного формату документа, ви можете використовувати власні функції. Вони можуть включати фон сторінки документа, анотації, заголовки або інші об'єкти як контейнери водяних знаків."
    },
    "code_1": {
      "title": "PDF налаштувати текстовий водяний знак",
      "content": "У цьому прикладі показано, як налаштувати текст конкретних артефактів.",
      "comment_1": "Завантажити документ PDF",
      "comment_2": "Отримати вміст документа",
      "comment_3": "Налаштування певного тексту водяного знака",
      "comment_4": "Зберегти документ"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "Налаштування Excel Інструмент водяного знака - {{ProdShortName}}",
      "description": "Налаштуйте, оновлюйте та керуйте водяними знаками без зусиль за допомогою {{ProdShortName}}. Налаштуйте документи з легкістю."
    },
    "header": {
      "title": "Інструмент «Налаштування водяних знаків електронних таблиць»: потужно простий",
      "description": "Покращуйте свої документи за допомогою нашого інтуїтивно зрозумілого інструменту редагування водяних знаків Спростіть робочий процес без особливих зусиль.",
      "subtitle": "{{ProdFullName}} АПІЯ",
      "action_title": "Безкоштовно {{PackageStoreName}} завантажити"
    },
    "about": {
      "title": "{{ProdFullName}} АПІЯ",
      "content": "**Інструмент коригування водяного знаку**: Наш інструмент водяних знаків пропонує зручне рішення для покращення та захисту ваших документів. Завдяки інтуїтивно зрозумілим функціям редагування керування водяними знаками стає легким, забезпечуючи безпеку та автентичність документів."
    },
    "formats": {
      "title": "Налаштуйте водяний знак через {{ProdFullName}} для інших форматів",
      "description": "Легко налаштовуйте водяні знаки в широкому діапазоні форматів документів. Підвищуйте безпеку та автентичність документів без зусиль."
    }
  },
  "word": {
    "ext": "докс",
    "head": {
      "title": "Налаштуйте Word водяні знаки без особливих зусиль - {{ProdShortName}}",
      "description": "Плавно налаштовуйте водяні знаки у різних форматах документів за допомогою {{ProdShortName}}. Підвищення безпеки документів."
    },
    "header": {
      "title": "Налаштуйте Word водяні знаки: Безпека без особливих зусиль",
      "description": "Захистіть свої документи без зусиль за допомогою наших потужних можливостей модифікації водяних знаків. Захистіть свій контент з упевненістю.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Скачати на {{PackageStoreName}} безкоштовно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**Змінити водяні знаки**: {{ProdShortName}} надає користувачам можливість легко змінювати водяні знаки в різних форматах документів. Завдяки точному контролю та універсальним опціям, налаштовуйте документи з упевненістю."
    },
    "formats": {
      "title": "Налаштування водяних знаків за допомогою {{ProdFullName}} для популярних форматів",
      "description": "GroupDocs.Watermark підтримує безшовну модифікацію водяних знаків у різних форматах. Налаштуйте свою стратегію водяних знаків відповідно до ваших конкретних потреб."
    }
  },
  "powerpoint": {
    "ext": "ППТХ",
    "head": {
      "title": "Налаштуйте PowerPoint водяні знаки з легкістю - {{ProdShortName}}",
      "description": "Легко оновлюйте водяні знаки в різних типах документів за допомогою {{ProdShortName}}. Підтримуйте цілісність документів без особливих зусиль."
    },
    "header": {
      "title": "Налаштування PowerPoint водяних знаків: Точний контроль",
      "description": "Підтримуйте точний контроль над цілісністю вашого документа за допомогою нашої функції оновлення водяних знаків. Забезпечте автентичність з легкістю.",
      "subtitle": "{{ProdFullName}} Бібліотека",
      "action_title": "Завантажити за адресою {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} Бібліотека",
      "content": "**Оновити водяні знаки**: контролюйте цілісність вашого документа за допомогою нашої функції оновлення водяних знаків. Легко переглядайте водяні знаки для різних типів документів, зберігаючи автентичність та безпеку."
    },
    "formats": {
      "title": "Налаштування водяних знаків у бізнес-форматах за допомогою {{ProdFullName}}",
      "description": "Легко оновлюйте водяні знаки для різних типів документів за допомогою точного контролю. Безперебійно підтримуйте цілісність та безпеку документів."
    }
  }
}