{
  "examples": {
    "comment_1": "{{FileFormatUp}} علامت متن را تنظیم کنید",
    "comment_2": "نشانگر واترمارک نمونه ای با سند ورودی {{FileFormatUp}}",
    "comment_3": "TextSearchCriteria را اولیه کنید و علامت های متن را پیدا کنید",
    "comment_4": "ویژگی های واترمارک متن را تنظیم کنید",
    "comment_5": "سند به روز شده را ذخیره کنید"
  },
  "steps": {
    "title": "واترمارک ها را در {{FileformatCap}} اسناد با {{EnvName}} تنظیم کنید",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** با اجرای چند مرحله آسان، تنظیم واترمارک های متن در برنامه های کاربردی خود را برای توسعه دهندگان {{EnvName}} آسان می کند:",
      "step_1": "**Watermarker** بارگذاری کنید. شما می توانید فایل را برای پردازش بیشتر به عنوان جریان یا به عنوان یک مسیر در یک دیسک محلی ارائه دهید.",
      "step_2": "**معیارهای جستجو** به شناسایی علامت های آب با خواص مناسب که قبلاً به یک سند اضافه شده بودند کمک می کند.",
      "step_3": "**جستجو** دریافت کنید. ویژگی های واترمارک های یافت شده مانند اندازه، تراز صفحه، متن، رنگ، محتوای تصویر و غیره را تنظیم کنید راه های زیادی برای سفارشی کردن داده های شما وجود دارد.",
      "step_4": "پس از اتمام فرآیند تنظیم واترمارک، شما باید سند به روز شده را ذخیره کنید. برای ذخیره نتیجه از مسیر فایل محلی، فایل یا جریان بایت استفاده کنید."
    }
  },
  "more_features": {
    "title": "بررسی عمیق در {{FileFormatUp}} تنظیم واترمارک",
    "description": "API ما {{EnvName}} برنامه را قادر می سازد تا در قالب های محبوب سند اضافه، ویرایش، حذف و جستجو برای واترمارک ها را فراهم کند.",
    "image_description": "تنظیم واترمارک",
    "feature_1": {
      "title": "به راحتی اسناد خود را علامت گذاری کنید",
      "content": "{{ProdShortName}} علامت گذاری آب را برای {{EnvName}} توسعه دهندگان ساده می کند. واترمارک های متنوع را به اسناد و فایل های مختلف کسب و کار اضافه کنید. نه تنها می توانید واترمارک ها را اعمال کنید، بلکه می توانید علامت های موجود را نیز به روز کنید یا حذف کنید."
    },
    "feature_2": {
      "title": "واترمارک ها را متناسب با نیازهای خود سفارشی کنید",
      "content": "API ما گزینه های سفارشی سازی گسترده ای را ارائه می دهد. اندازه، چرخش، رنگ، فونت، سبک ها و موارد دیگر را به راحتی تنظیم کنید تا به علامت کامل دست یابید."
    },
    "feature_3": {
      "title": "از ویژگی های سند بومی {{FileFormatUp}} استفاده کنید",
      "content": "بسته به فرمت سند خاص، می توانید از قابلیت های بومی استفاده کنید. اینها ممکن است شامل پس زمینه صفحه سند، حاشیه نویسی ها، هدرها یا سایر اشیاء به عنوان ظروف واترمارک باشد."
    },
    "code_1": {
      "title": "PDF تنظیم علامت متن",
      "content": "این مثال نحوه تنظیم متن مصنوعات خاص را نشان می دهد.",
      "comment_1": "بارگذاری PDF سند",
      "comment_2": "دریافت محتوای سند",
      "comment_3": "متن واترمارک خاص را تنظیم کنید",
      "comment_4": "سند را ذخیره کنید"
    }
  },
  "excel": {
    "ext": "اکس‌اس‌لکس",
    "head": {
      "title": "تنظیم ابزار واترمارک Excel - {{ProdShortName}}",
      "description": "با {{ProdShortName}} بدون زحمت واترمارک ها را تنظیم، به روز کنید و مدیریت کنید. اسناد خود را با سهولت سفارشی کنید."
    },
    "header": {
      "title": "تنظیم ابزار واترمارک صفحات گسترده: بسیار ساده",
      "description": "اسناد خود را با ابزار ویرایش واترمارک بصری ما بهبود ببخشید. گردش کار خود را بدون زحمت ساده کنید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} آپی",
      "content": "**ابزار تنظیم واترمارک**: ابزار علامت گذاری ما یک راه حل کاربر پسند برای بهبود و محافظت از اسناد شما ارائه می دهد. با ویژگی های ویرایش بصری، مدیریت واترمارک ها بدون دردسر می شود و امنیت و اصالت اسناد را تضمین می کند."
    },
    "formats": {
      "title": "تنظیم واترمارک از طریق {{ProdFullName}} برای فرمت های دیگر",
      "description": "واترمارک ها را در طیف گسترده ای از فرمت های سند با سهولت سفارشی کنید. امنیت و اصالت سند را بدون زحمت افزایش دهید."
    }
  },
  "word": {
    "ext": "داکس",
    "head": {
      "title": "Word علامت های آب را بدون زحمت تنظیم کنید - {{ProdShortName}}",
      "description": "با استفاده از {{ProdShortName}}، واترمارک ها را در چندین فرمت سند به طور یکپارچه تنظیم کنید. امنیت اسناد خود را افزایش دهید"
    },
    "header": {
      "title": "تنظیم Word واترمارک: بدون زحمت ایمن",
      "description": "با قابلیت های قدرتمند اصلاح علامت ما، اسناد خود را بدون زحمت ایمن کنید از محتوای خود با اعتماد به نفس محافظت کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**اصلاح علامت ها**: {{ProdShortName}} کاربران را قادر می سازد تا واترمارک ها را در قالب های مختلف سند به طور یکپارچه تغییر دهند. با کنترل دقیق و گزینه های همه کاره، اسناد خود را با اطمینان سفارشی کنید."
    },
    "formats": {
      "title": "تنظیم واترمارک ها با استفاده از {{ProdFullName}} برای فرمت های محبوب",
      "description": "GroupDocs.Watermark از اصلاح یکپارچه واترمارک ها در قالب های مختلف پشتیبانی می کند. استراتژی علامت گذاری خود را متناسب با نیازهای خاص خود تنظیم کنید."
    }
  },
  "powerpoint": {
    "ext": "پی‌تی‌اکس",
    "head": {
      "title": "PowerPoint واترمارک را با سهولت تنظیم کنید - {{ProdShortName}}",
      "description": "به راحتی واترمارک ها را در انواع مختلف سند با {{ProdShortName}} به روز کنید. یکپارچگی سند را بدون زحمت حفظ کنید"
    },
    "header": {
      "title": "تنظیم PowerPoint واترمارک ها: کنترل دقیق",
      "description": "با ویژگی به روز رسانی واترمارک، کنترل دقیق بر یکپارچگی سند خود را حفظ کنید. اصالت را با سهولت اطمینان حاصل کنید.",
      "subtitle": "{{ProdFullName}} کتابخانه",
      "action_title": "دانلود در {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "**به روز رسانی واترمارک**: با ویژگی علامت به روز رسانی ما، کنترل یکپارچگی سند خود را حفظ کنید. به راحتی واترمارک ها را در انواع مختلف سند تجدید نظر کنید و اصالت و امنیت را حفظ کنید."
    },
    "formats": {
      "title": "تنظیم واترمارک ها در قالب های کسب و کار با {{ProdFullName}}",
      "description": "به راحتی واترمارک ها را در انواع مختلف سند با کنترل دقیق به روز کنید. یکپارچگی و امنیت سند را به صورت یکپارچه حفظ کنید."
    }
  }
}