{
  "examples": {
    "comment_1": "واترمارک تصویر {{FileFormatUp}} را به‌روزرسانی کنید",
    "comment_2": "{{TextWatermarker}} را برای فایل {{FileFormatUp}} بنویسید",
    "comment_3": "برای پیدا کردن یک تصویر خاص از {{TextSearchCriteria}} استفاده کنید",
    "comment_4": "محتوای تصویر را به روز کنید",
    "comment_5": "فایل به روز شده را ذخیره کنید"
  },
  "steps": {
    "title": "ویرایش واترمارک پویا برای {{FileFormatUp}} در {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** به توسعه دهندگان {{EnvName}} یک API قدرتمند برای ویرایش واترمارک در اسناد مختلف {{FileFormatUp}} ارائه می‌دهد. در اینجا یک راهنمای جامع برای ساده کردن گردش کار شما آورده شده است:",
      "step_1": "**فرآیند را شروع کنید:** با ارائه فایل {{FileFormatUp}} خود به عنوان آرگومان برای سازنده کلاس {{TextWatermarkerBold}} شروع کنید. بسته به نیاز شما، فایل را می توان به صورت جریانی یا از محل دیسک محلی تهیه کرد.",
      "step_2": "** واترمارک های دقیق:** از شی {{TextSearchCriteriaBold}} برای شناسایی واترمارک هایی که نیاز به اصلاح دارند استفاده کنید. این ابزار همه کاره انتخاب واترمارک هدفمند را بر اساس ویژگی های خاص فعال می کند.",
      "step_3": "**تصفیه با دقت:** پس از اجرای موفقیت آمیز جستجو، به مجموعه ای از واترمارک های مرتبط دسترسی پیدا کنید. با قابلیت به روز رسانی ابعاد، موقعیت صفحه، محتوای متن، رنگ، داده های تصویر و موارد دیگر، از کنترل گرانول بر روی هر عنصر لذت ببرید.",
      "step_4": "** ماندگاری بدون درز:** پس از تکمیل به‌روزرسانی واترمارک، سند اصلاح‌شده را به‌طور ایمن ذخیره کنید. API گزینه های ذخیره سازی انعطاف پذیری را ارائه می دهد که به شما امکان می دهد در یک مسیر فایل محلی یا به عنوان یک شی جریان ذخیره کنید."
    }
  },
  "more_features": {
    "title": "شیوه عمیق در افزودن واترمارک",
    "description": "API برای رندر، نمایش، تبدیل اسناد، اسلاید، نمودار و بسیاری از انواع سند دیگر در .NET برنامه",
    "image_description": "افزودن واترمارک",
    "feature_1": {
      "title": "بدون زحمت واترمارک ها را در PDF s ویرایش کنید",
      "content": "{{ProdShortName}} ابزارهای قدرتمندی را در {{EnvName}} برای ویرایش یکپارچه واترمارک های موجود در PDF اسناد ارائه می دهد. موقعیت، شفافیت و موارد دیگر را با سهولت تنظیم کنید."
    },
    "feature_2": {
      "title": "جزئیات واترمارک را برای دقیق اصلاح کنید",
      "content": "کنترل جزئیات را در دست بگیرید. API ما به شما امکان می دهد ظاهر واترمارک ها را با جزئیات تنظیم کنید و تغییرات دقیق اندازه، کدورت و رنگ را در PDF s خود فعال کنید."
    },
    "feature_3": {
      "title": "مدیریت واترمارک ساده",
      "content": "API ما مدیریت واترمارک را ساده می کند. چه به روزرسانی و چه حذف کنید، می توانید واترمارک ها را به طور موثر مدیریت کنید و یکپارچگی اسناد را حفظ کنید و در عین حال نیازهای برندسازی خود"
    },
    "code_1": {
      "title": "به روز رسانی محتوای واترمارک ارائه",
      "content": "این مثال نحوه به روز رسانی محتوای متن واترمارک های ارائه را نشان می دهد",
      "comment_1": "سند PDF را برای پردازش بارگیری کنید",
      "comment_2": "علامت های خاصی را جستجو کنید که معیارهای شما را برآورده می کنند",
      "comment_3": "تنظیمات علامت، مانند اندازه، رنگ و موقعیت را ویرایش کنید",
      "comment_4": "سند به روز شده را در یک سیستم محلی ذخیره کنید یا آن را مستقیماً پخش کنید"
    }
  },
  "doc": {
    "head": {
      "title": "به روزرسانی علامت {{FileFormatUp}} Streamline",
      "description": "فرآیند به روزرسانی واترمارک ها در {{FileFormatUp}} اسناد را با {{ProdFullName}} کتابخانه ساده کنید."
    },
    "header": {
      "title": "به روز رسانی واترمارک کارآمد برای {{FileFormatUp}} اسناد",
      "description": "به روزرسانی واترمارک را با {{ProdFullName}} ساده و تسریع کنید. از امنیت فایل های شرکت خود از طریق مجموعه ای از واترمارک ها اطمینان حاصل کنید. خواص واترمارک مانند اندازه، تراز، زاویه چرخش و قرار دادن را بدون زحمت تغییر دهید.",
      "subtitle": "{{ProdFullName}} راه حل",
      "action_title": "دانلود از {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} ویژگی ها",
      "content": "{{ProdFullName}} ابزارهای کارآمد را برای ساده سازی روند به روزرسانی واترمارک ها در اسناد ارائه می دهد. با استفاده از این راه حل پیشرفته، توسعه دهندگان می توانند به راحتی واترمارک ها را در فرمت های مختلف فایل، از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل، و فرمت های تصویر به روز کنند. {{ProdShortName}} از تمام سیستم عامل های اصلی و {{EnvName}} نسخه پشتیبانی می کند."
    },
    "formats": {
      "title": "به روز رسانی واترمارک در فرمت های پشتیبانی شده ساده",
      "description": "پردازش واترمارک را در قالب های محبوب مانند PDF، Word، Excel و موارد دیگر با {{ProdFullName}} ساده کنید."
    }
  },
  "docx": {
    "head": {
      "title": "به روز رسانی واترمارک ها در {{FileFormatUp}} به طور یکپارچه",
      "description": "به طور یکپارچه واترمارک ها را در {{FileFormatUp}} اسناد با {{ProdFullName}} به روز کنید. کتابخانه ما را در برنامه خود نصب کنید."
    },
    "header": {
      "title": "پردازش واترمارک در {{FileFormatUp}} اسناد",
      "description": "بدون زحمت واترمارک ها را با دقت با استفاده از {{ProdFullName}} تنظیم کنید. با استفاده از واترمارک های مختلف، محرمانه بودن اسناد شرکت خود را حفظ کنید. ویژگی های واترمارک از جمله اندازه، تراز، زاویه چرخش و موقعیت را متناسب با مشخصات خود تنظیم کنید.",
      "subtitle": "{{ProdFullName}} کتابخانه",
      "action_title": "دانلود رایگان در {{PackageStoreName}}"
    },
    "about": {
      "title": "تحقیق {{ProdFullName}}",
      "content": "{{ProdFullName}} توسعه دهندگان را قادر می سازد تا واترمارک ها را در {{FileFormatUp}} اسناد به راحتی به روز کنند. این ابزار قدرتمند امکان تنظیم دقیق واترمارک ها در فرمت های مختلف فایل از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل و فرمت های تصویر را فراهم می کند. {{ProdFullName}} می تواند در بسیاری از سیستم عامل های محبوب استفاده شود."
    },
    "formats": {
      "title": "به روز رسانی واترمارک ها برای فرمت های دیگر",
      "description": "واترمارک ها را در PDF، Word، Excel و موارد دیگر با {{ProdFullName}} به طور یکپارچه تنظیم کنید. بسیاری از فرمت های دیگر پشتیبانی می شوند."
    }
  },
  "pdf": {
    "head": {
      "title": "بدون زحمت واترمارک ها را در {{FileFormatUp}} اسناد ارتقا دهید",
      "description": "به راحتی واترمارک ها را در {{FileFormatUp}} اسناد با {{ProdFullName}} API به روز کنید. امنیت اسناد خود را تضمین کنید"
    },
    "header": {
      "title": "به روز رسانی {{FileFormatUp}} واترمارک های سند بدون زحمت",
      "description": "کیفیت واترمارک ها را با سهولت با استفاده از {{FileFormatUp}} افزایش دهید. حفاظت از مواد تجاری خود را با طیف وسیعی از واترمارک ها افزایش دهید. ویژگی های واترمارک مانند اندازه، تراز، زاویه چرخش و موقعیت را در صورت لزوم تنظیم کنید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "{{PackageStoreName}} دانلود رایگان"
    },
    "about": {
      "title": "{{ProdFullName}} اطلاعات",
      "content": "{{ProdFullName}} قابلیت های پیشرفته را برای به روز رسانی واترمارک ها در اسناد بدون زحمت ارائه می دهد. با استفاده از این ابزار، توسعه دهندگان می توانند ظاهر و دید واترمارک ها را در فرمت های مختلف فایل، از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل و فرمت های تصویر افزایش دهند. تمام سیستم عامل های محبوب و {{EnvName}} نسخه پشتیبانی می شوند."
    },
    "formats": {
      "title": "به روز رسانی واترمارک برای بسیاری از فرمت ها در دسترس است",
      "description": "با {{ProdFullName}} بدون زحمت واترمارک ها را در PDF، Word، Excel و موارد دیگر افزایش دهید. 50+ فرمت فایل پشتیبانی می شود."
    }
  },
  "ppt": {
    "head": {
      "title": "به روز رسانی {{FileFormatUp}} واترمارک ها با دقت",
      "description": "واترمارک ها را در ارائه ها با دقت با استفاده از {{ProdFullName}} اصلاح کنید. امنیت اطلاعات کسب و کار خود را تضمین کنید"
    },
    "header": {
      "title": "به روز رسانی {{FileFormatUp}} واترمارک های ارائه با دقت",
      "description": "با {{ProdFullName}} به دقت بی نظیر در پالایش واترمارک دست یابید. سوابق کسب و کار خود را با انواع واترمارک تقویت کنید. خواص واترمارک مانند اندازه، تراز، زاویه چرخش و قرار دادن را با توجه به نیاز خود به روز کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دریافت رایگان از {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} ابزارهای دقیق را برای به روز رسانی واترمارک ها در اسناد به توسعه دهندگان فراهم می کند. این ابزار پیچیده امکان تنظیم دقیق و تصفیه واترمارک ها در فرمت های مختلف فایل از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل و فرمت های تصویر را فراهم می کند. راه حل ما از تمام سیستم عامل های اصلی و چارچوب های محبوب پشتیبانی می کند."
    },
    "formats": {
      "title": "به روز رسانی واترمارک ها در فرمت های پشتیبانی شده",
      "description": "واترمارک ها را در PDF، Word، Excel و موارد دیگر با دقت با استفاده از {{ProdFullName}} اصلاح کنید. تمام فرمت های کسب و کار پشتیبانی می شوند."
    }
  },
  "pptx": {
    "head": {
      "title": "به روز رسانی واترمارک ها در {{FileFormatUp}} اسناد به طور یکپارچه",
      "description": "به طور یکپارچه واترمارک ها را در {{FileFormatUp}} ارائه از طریق {{ProdFullName}} تغییر دهید. کتابخانه ما را به برنامه های خود بگنجانید."
    },
    "header": {
      "title": "به روز رسانی واترمارک ها در {{FileFormatUp}} ارائه",
      "description": "واترمارک ها را با سهولت و کارایی با استفاده از {{ProdFullName}} اصلاح کنید. اسناد کسب و کار خود را با استفاده از انتخاب واترمارک ها ایمن نگه دارید. ویژگی های واترمارک مانند اندازه، تراز، زاویه چرخش و موقعیت را به راحتی سفارشی کنید.",
      "subtitle": "{{ProdFullName}} کتابخانه",
      "action_title": "{{PackageStoreName}} دانلود بسته"
    },
    "about": {
      "title": "{{ProdFullName}} راه حل ها",
      "content": "{{ProdFullName}} امکان اصلاح یکپارچه واترمارک ها در اسناد را فراهم می کند. با استفاده از این ابزار همه کاره، توسعه دهندگان می توانند به راحتی واترمارک ها را در فرمت های مختلف فایل اصلاح و به روز کنند، از جمله PDF، Microsoft Word، Excel، PowerPoint، Visio، ایمیل و فرمت های تصویر. {{ProdFullName}} ممکن است با تمام سیستم عامل های محبوب استفاده شود."
    },
    "formats": {
      "title": "به روز رسانی فرمت های فایل پشتیبانی شده واترمارک",
      "description": "واترمارک ها را در PDF، Word، Excel و موارد دیگر با {{ProdFullName}} به طور یکپارچه تغییر دهید. برندسازی اسناد خود را تقویت کنید."
    }
  },
  "rtf": {
    "head": {
      "title": "{{FileFormatUp}} واترمارک ها را بدون زحمت به روز کنید",
      "description": "بدون زحمت واترمارک ها را در {{FileFormatUp}} اسناد با استفاده از {{ProdFullName}} سفارشی کنید. راه حل ما را برای منطق کسب و کار خود درگیر کنید."
    },
    "header": {
      "title": "به روز رسانی واترمارک ها در {{FileFormatUp}} اسناد بدون زحمت",
      "description": "با {{ProdFullName}} واترمارک ها را متناسب با نیازهای دقیق خود تنظیم کنید. از اسناد شرکت خود با استفاده از واترمارک های مختلف محافظت کنید. عناصر واترمارک مانند اندازه، تراز، زاویه چرخش و قرار دادن را بدون زحمت تغییر دهید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "بسته را از {{PackageStoreName}} دریافت کنید"
    },
    "about": {
      "title": "درباره {{ProdFullName}}",
      "content": "{{ProdFullName}} سفارشی سازی یکپارچه واترمارک ها را در {{FileFormatUp}} اسناد ارائه می دهد. این ابزار انعطاف پذیر به توسعه دهندگان اجازه می دهد تا به راحتی واترمارک ها را با توجه به نیازهای خاص در فرمت های مختلف فایل، از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل و فرمت های تصویر سفارشی و تنظیم کنند."
    },
    "formats": {
      "title": "به روز رسانی واترمارک ها در بسیاری از فرمت های فایل",
      "description": "به راحتی واترمارک ها را در PDF، Word، Excel و موارد دیگر با {{ProdFullName}} سفارشی کنید. منطق کسب و کار خود را تقلید کنید."
    }
  },
  "xls": {
    "head": {
      "title": "به روز رسانی و ویرایش واترمارک ها در {{FileFormatUp}} صفحات گسترده",
      "description": "به روز رسانی و ویرایش واترمارک ها در قالب های مختلف سند با {{ProdFullName}}. قابلیت های برنامه های کاربردی خود را گسترش دهید."
    },
    "header": {
      "title": "مدیریت موثر {{FileFormatUp}} واترمارک صفحات گسترده",
      "description": "مدیریت واترمارک را با {{ProdFullName}} ساده کنید. با استفاده از واترمارک های مختلف از ایمنی پرونده های کسب و کار خود اطمینان حاصل کنید. مشخصات واترمارک مانند اندازه، تراز، زاویه چرخش و موقعیت را به دلخواه خود تنظیم کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "{{PackageStoreName}} دانلود"
    },
    "about": {
      "title": "{{ProdFullName}} اطلاعات عمومی",
      "content": "{{ProdFullName}} ابزارهای کارآمدی را برای به روز رسانی و ویرایش واترمارک ها در چندین فرمت فایل ارائه می دهد. با استفاده از این راه حل جامع، توسعه دهندگان می توانند به طور یکپارچه واترمارک ها را در اسناد مختلف از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل و فرمت های تصویر مدیریت کنند. تمام سیستم عامل ها و سیستم عامل های اصلی پشتیبانی می شوند."
    },
    "formats": {
      "title": "به روز رسانی و ویرایش واترمارک ها برای فرمت های دیگر",
      "description": "به راحتی واترمارک ها را در PDF، Word، Excel و موارد دیگر با {{ProdFullName}} به روز کنید و ویرایش کنید. محتوای اسناد خود را غنی کنید"
    }
  },
  "xlsx": {
    "head": {
      "title": "{{FileFormatUp}} واترمارک ها را به نیازهای خود به روز کنید",
      "description": "با {{ProdFullName}} واترمارک ها را متناسب با نیازهای دقیق خود تنظیم کنید. منطق کسب و کار را در برنامه های خود تقویت کنید."
    },
    "header": {
      "title": "به روز رسانی {{FileFormatUp}} واترمارک صفحات گسترده به نیازهای خود",
      "description": "واترمارک ها را بدون زحمت با {{ProdFullName}} سفارشی کنید. اسناد حساس شرکت خود را با علامت های مختلف محافظت کنید. ویژگی های واترمارک مانند اندازه، تراز، زاویه چرخش و موقعیت را در صورت لزوم تنظیم کنید.",
      "subtitle": "{{ProdFullName}} راه حل",
      "action_title": "دانلود رایگان در {{PackageStoreName}}"
    },
    "about": {
      "title": "درباره {{ProdFullName}} بیشتر بدانید",
      "content": "{{ProdFullName}} توسعه دهندگان را قادر می سازد تا واترمارک ها را متناسب با نیازهای خاص خود تنظیم کنند. با استفاده از این ابزار همه کاره، توسعه دهندگان می توانند به راحتی واترمارک ها را در اسناد با توجه به نیازهای دقیق در فرمت های مختلف فایل، از جمله PDF، مایکروسافت Word، Excel، PowerPoint، Visio، ایمیل و فرمت های تصویر سفارشی و تنظیم کنند. سیستم عامل های عمده و سیستم عامل های توسعه پشتیبانی می شوند."
    },
    "formats": {
      "title": "به روز رسانی واترمارک های قرار داده شده در فرمت های دیگر",
      "description": "با {{ProdFullName}}، PDF، Word، Excel و موارد دیگر واترمارک ها را متناسب با نیازهای خود تنظیم کنید. محصول ما را به راه حل های خود بگنجانید و مزایای ارزشمندی کسب کنید."
    }
  }
}