{
  "examples": {
    "comment_1": "{{FileFormatUp}} علامت تصویر را تنظیم کنید",
    "comment_2": "نشانگر واترمارک را با {{FileFormatUp}} نمودار کنید",
    "comment_3": "معیارهای جستجوی را برای مطابقت با یک تصویر خاص اولیه کنید",
    "comment_4": "تصاویر پیدا شده را جایگزین کنید",
    "comment_5": "ذخیره فایل تنظیم شده"
  },
  "steps": {
    "title": "تنظیم علامت های {{FileformatCap}} سند با استفاده از {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** به توسعه دهندگان {{EnvName}} اجازه می دهد تا به راحتی واترمارک ها را در بسیاری از اسناد با استفاده از برنامه های خود تنظیم کنند. در اینجا یک راهنمای سریع آورده شده است:",
      "step_1": "**Watermarker** منتقل کنید. بایت یا جریان فایل یا مسیر دیسک محلی را ارائه دهید.",
      "step_2": "**SearchCriteria** برای شناسایی واترمارک ها با خواص خاصی که قبلاً به سند اضافه شده اند استفاده کنید.",
      "step_3": "پس از جستجو، لیستی از واترمارک های مربوطه دریافت خواهید کرد. سپس می توانید خواص آنها، از جمله اندازه، تراز صفحه، متن، رنگ، محتوای تصویر و موارد دیگر را تنظیم کنید. این درجه بالایی از سفارشی سازی داده های شما را ارائه می دهد.",
      "step_4": "پس از اتمام تنظیم واترمارک ها، سند به روز شده را ذخیره کنید. شما می توانید از یک مسیر فایل محلی یا جریان برای ذخیره نتیجه استفاده کنید."
    }
  },
  "more_features": {
    "title": "مدیریت پیشرفته {{FileFormatUp}} علامت واترمارک برای {{EnvName}} برنامه",
    "description": "API {{ProdShortName}} به توسعه دهندگان این امکان را می دهد تا قابلیت واترمارک را به طور یکپارچه در {{EnvName}} برنامه های خود ادغام کنند. از افزودن، ویرایش، حذف و جستجوی واترمارک ها در طیف گسترده ای از فرمت های سند پشتیبانی می کند.",
    "image_description": "تنظیم واترمارک",
    "feature_1": {
      "title": "ادغام علامت بدون دردسر",
      "content": "{{ProdShortName}} روند افزودن واترمارک های متنوع به اسناد و فایل های مختلف کسب و کار در {{EnvName}} برنامه ها را ساده می کند. توسعه دهندگان نه تنها می توانند واترمارک ها را اعمال کنند، بلکه موارد موجود را به صورت برنامه نویسی به روز یا حذف کنند."
    },
    "feature_2": {
      "title": "سفارشی سازی علامت گرانول",
      "content": "API گزینه های سفارشی سازی گسترده ای را برای واترمارک ها فراهم می کند. توسعه دهندگان می توانند به راحتی اندازه، چرخش، رنگ، فونت، سبک ها و سایر خواص را برای دستیابی به جلوه بصری مورد نظر تنظیم کنند."
    },
    "feature_3": {
      "title": "استفاده از {{FileFormatUp}} ویژگی های اسناد بومی",
      "content": "بسته به قالب سند هدف، توسعه دهندگان می توانند از قابلیت های بومی برای قرار دادن واترمارک استفاده کنند. این قابلیت ها ممکن است شامل پس زمینه صفحه سند، حاشیه نویسی ها، هدرها یا سایر اشیاء به عنوان ظروف واترمارک باشد."
    },
    "code_1": {
      "title": "تنظیم علامت تصویر در صفحات گسترده",
      "content": "این مثال ها نحوه تنظیم تصویر اشکال خاص در یک برگه Excel را نشان می دهد.",
      "comment_1": "بارگذاری سند به عنوان صفحه گسترده",
      "comment_2": "بایت های واترمارک جدید را دریافت کنید",
      "comment_3": "محتوای واترمارک خاص را تنظیم کنید",
      "comment_4": "ذخیره سند نتیجه"
    }
  },
  "doc": {
    "head": {
      "title": "{{FileFormatUp}} علامت های آبرنگ را به صورت حرفه ای تنظیم کنید - {{ProdShortName}}",
      "description": "با {{ProdShortName}} واترمارک ها را به صورت حرفه ای مدیریت و سفارشی کنید. اسناد خود را با اطمینان حفاظت کنید"
    },
    "header": {
      "title": "تنظیم {{FileFormatUp}} واترمارک ها: تضمین حرفه ای",
      "description": "با راه حل مدیریت واترمارک ما از استانداردهای حرفه ای اطمینان حاصل کنید. اسناد خود را با قابلیت اطمینان حفاظت کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود بسته از {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**مدیریت علامت ها**: راه حل حرفه ای مدیریت واترمارک ما اطمینان را در محافظت از اسناد شما فراهم می کند. گردش کار خود را با ابزارهای کارآمد برای افزودن، ویرایش و حذف واترمارک ها ساده کنید."
    },
    "formats": {
      "title": "ویرایش واترمارک ها در فرمت های دیگر از طریق {{ProdFullName}}",
      "description": "مدیریت واترمارک را در فرمت های مختلف سند ساده کنید. راه حل ما ابزارهای کارآمدی را برای افزودن، ویرایش و حذف علامت های آب به راحتی ارائه می دهد."
    }
  },
  "docx": {
    "head": {
      "title": "تنظیم واترمارک ها در {{FileFormatUp}} اسناد - {{ProdShortName}}",
      "description": "با استفاده از {{ProdShortName}}، واترمارک ها را به طور موثر در قالب های مختلف سند ویرایش کنید. اصالت سند را افزایش دهید."
    },
    "header": {
      "title": "تنظیم {{FileFormatUp}} علامت های آب: سفارشی سازی بدون درز",
      "description": "اسناد خود را به صورت یکپارچه با ابزار ویرایش واترمارک کارآمد ما سفارشی کنید. تصویر برند خود را بدون زحمت ارتقا دهید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} آپی",
      "content": "**ویرایش علامت ها**: اسناد خود را با ابزارهای ویرایش قدرتمند ما به صورت یکپارچه سفارشی کنید. خواه تنظیم مکان یا تغییر محتوا باشد، بدون زحمت به جلوه های واترمارک دلخواه خود دست یابید."
    },
    "formats": {
      "title": "واترمارک ها را در بسیاری از فرمت ها با استفاده از {{ProdFullName}} اصلاح کنید",
      "description": "به طور یکپارچه واترمارک ها را در چندین قالب سند ویرایش کنید ضمن اطمینان از حفاظت و اصالت، اسناد خود را بدون زحمت سفارشی کنید."
    }
  },
  "pdf": {
    "head": {
      "title": "تنظیم واترمارک ها در {{FileFormatUp}} - {{ProdShortName}}",
      "description": "با {{ProdShortName}} واترمارک ها را در انواع مختلف سند بدون زحمت تنظیم و اصلاح کنید. اطمینان از اعتبار سند."
    },
    "header": {
      "title": "تنظیم {{FileFormatUp}} واترمارک ها: حفاظت همه کاره",
      "description": "با ویژگی های تنظیم واترمارک همه کاره ما از محتوای خود در فرمت های مختلف محافظت کنید. به طور یکپارچه با نیازهای خود سازگار شوید.",
      "subtitle": "{{ProdFullName}} راه حل",
      "action_title": "بسته رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} راه حل",
      "content": "**تنظیم علامت ها**: با ویژگی های تنظیم واترمارک همه کاره ما از محتوای خود در قالب های مختلف سند محافظت کنید. استراتژی علامت گذاری خود را طوری تنظیم کنید که نیازهای خاص خود را با سهولت برآورده کند."
    },
    "formats": {
      "title": "مدیریت واترمارک ها در فرمت های محبوب با {{ProdFullName}}",
      "description": "با ویژگی های تنظیم واترمارک همه کاره ما از محتوای خود در فرمت های مختلف محافظت کنید. به طور یکپارچه با نیازهای خود سازگار شوید."
    }
  },
  "ppt": {
    "head": {
      "title": "{{FileFormatUp}} واترمارک ها را به صورت یکپارچه تنظیم کنید - {{ProdShortName}}",
      "description": "واترمارک ها را به طور یکپارچه با {{ProdShortName}} اصلاح و سفارشی کنید. از اسناد خود با دقت محافظت کنید"
    },
    "header": {
      "title": "بازنگری {{FileFormatUp}} واترمارک ها: امنیت متناسب",
      "description": "امنیت سند خود را با گزینه های بازنگری واترمارک انعطاف پذیر ما تنظیم کنید. از حفاظت متناسب با نیازهای شما اطمینان حاصل کنید.",
      "subtitle": "{{ProdFullName}} کتابخانه",
      "action_title": "دانلود از {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "**اصلاح واترنشانه**: امنیت اسناد را با گزینههای بازنگری ما افزایش دهید. {{ProdShortName}} راهکارهای مناسبی را برای بازنگری و تصفیه واترمارک ها متناسب با برندسازی و نیازهای حفاظتی شما ارائه میدهد."
    },
    "formats": {
      "title": "واترمارک ها را در سایر فرمت های پشتیبانی شده با استفاده از {{ProdFullName}} اصلاح کنید",
      "description": "امنیت اسناد را با گزینه های اصلاح واترمارک متناسب اطمینان حاصل کنید. GroupDocs.Watermark راه حل های انعطاف پذیر برای اصلاح و تصفیه واترمارک ها ارائه می دهد."
    }
  },
  "pptx": {
    "head": {
      "title": "{{FileFormatUp}} علامت های آب را بدون زحمت تنظیم کنید - {{ProdShortName}}",
      "description": "اسناد خود را بدون زحمت با {{ProdShortName}} سفارشی کنید. واترمارک ها را با سهولت ویرایش و مدیریت کنید."
    },
    "header": {
      "title": "سفارشی کردن {{FileFormatUp}} واترمارک ها: برندسازی بصری",
      "description": "اسناد خود را به طور موثر با ابزار علامت گذاری قابل تنظیم ما مارک گذاری کنید. حضور برند خود را بدون زحمت افزایش دهید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود {{PackageStoreName}} بسته"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**سفارشی کردن واترمارک**: تصویر برند خود را با ابزارهای واترمارک قابل تنظیم ما ارتقا دهید. بدون زحمت عناصر برندسازی را اضافه کنید و ضمن اطمینان از امنیت و اصالت سند."
    },
    "formats": {
      "title": "تنظیم واترمارک ها در سایر فرمت های پشتیبانی شده توسط {{ProdFullName}}",
      "description": "حضور برند خود را با ابزارهای واترمارک قابل تنظیم افزایش دهید. اسناد خود را به طور موثر با حفظ امنیت و اصالت برند کنید."
    }
  },
  "rtf": {
    "head": {
      "title": "تنظیم واترمارک در {{FileFormatUp}} - {{ProdShortName}}",
      "description": "اسناد خود را با دقت با استفاده از {{ProdShortName}} جلا کنید. بدون زحمت واترمارک ها را تنظیم و به روز کنید."
    },
    "header": {
      "title": "اسناد {{FileFormatUp}} خود را پالش کنید: ویرایش واترمارک",
      "description": "اسناد خود را با قابلیت های ویرایش واترمارک جامع ما اصلاح کنید. محتوای خود را با دقت پالایش کنید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}} آپی",
      "content": "**اسناد خود را پالش کنید**: قابلیت های ویرایش واترمارک جامع ما به شما امکان می دهد اسناد خود را با دقت اصلاح کنید. از تنظیمات جزئی گرفته تا تغییرات کامل، بدون زحمت به نتایج عالی دست یابید."
    },
    "formats": {
      "title": "واترمارک های سند لهستانی در فرمت های دیگر با {{ProdFullName}}",
      "description": "با استفاده از قابلیت های ویرایش علامت جامع ما، اسناد خود را با دقت اصلاح کنید. اصالت سند را بدون زحمت افزایش دهید."
    }
  },
  "xls": {
    "head": {
      "title": "علامت های {{FileFormatUp}} خود را تنظیم کنید - {{ProdShortName}}",
      "description": "مکان علامت واترمارک خود را با {{ProdShortName}} اصلاح کنید. امنیت و اصالت سند را افزایش دهید."
    },
    "header": {
      "title": "جایگذاری علامت {{FileFormatUp}} خود را اصلاح کنید: دقت تخصصی",
      "description": "با ابزارهای دقیق ما به قرار دادن واترمارک متخصص دست یابید. امنیت اسناد را با دقت افزایش دهید.",
      "subtitle": "{{ProdFullName}} راه حل",
      "action_title": "دانلود رایگان در {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} راه حل",
      "content": "**جایگذاری واترمارک خود را اصلاح کنید**: با ابزارهای دقیق ما به جایگذاری تخصصی واترمارک ها دست یابید. {{ProdShortName}} کنترل های بصری را برای تصفیه قرار دادن و اطمینان از امنیت اسناد ارائه می دهد."
    },
    "formats": {
      "title": "تصفیه واترمارک ها در سایر فرمت های پشتیبانی شده با {{ProdFullName}}",
      "description": "با کنترل های بصری به قرار دادن واترمارک متخصص دست یابید از امنیت سند با قرار دادن دقیق و سفارشی سازی اطمینان حاصل کنید."
    }
  },
  "xlsx": {
    "head": {
      "title": "تنظیم و مدیریت {{FileFormatUp}} علامت های آب - {{ProdShortName}}",
      "description": "فرآیند مدیریت واترمارک خود را با {{ProdShortName}} ساده کنید. حفاظت از اسناد و برندسازی را ساده کنید."
    },
    "header": {
      "title": "Streamline {{FileFormatUp}} مدیریت واترمارک: کنترل ساده",
      "description": "فرآیند مدیریت واترمارک خود را با راه حل ساده ما ساده کنید. با سهولت روی محتوای خود تمرکز کنید.",
      "subtitle": "{{ProdFullName}} کتابخانه",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "**تنظیمات واترمارک**: با استفاده از راه حل دقیق ما، واترمارک ها را روی صفحه جابجا کنید. {{ProdShortName}} گزینه های زیادی برای تنظیم واترمارک ها و اطمینان از امنیت اسناد ارائه می دهد."
    },
    "formats": {
      "title": "از {{ProdFullName}} برای ویرایش واترمارک در فرمت های دیگر فایل استفاده کنید",
      "description": "فرآیند مدیریت واترمارک خود را در فرمت های مختلف سند ساده کنید. ضمن اطمینان از حفاظت و برندسازی، به راحتی بر محتوای خود تمرکز کنید."
    }
  }
}