{
  "examples": {
    "comment_1": "ปรับลายน้ำรูปภาพ {{FileFormatUp}}",
    "comment_2": "สร้างอินสแตนซ์ {{TextWatermarker}} ด้วย {{FileFormatUp}}",
    "comment_3": "เริ่มต้น {{TextSearchCriteria}} เพื่อให้ตรงกับรูปภาพที่ต้องการ",
    "comment_4": "แทนที่รูปภาพที่พบ",
    "comment_5": "บันทึกไฟล์ที่ปรับแต่ง"
  },
  "steps": {
    "title": "ปรับลายน้ำเอกสาร {{FileformatCap}} โดยใช้ {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** ช่วยให้นักพัฒนา {{EnvName}} ปรับลายน้ำในเอกสารจำนวนมากได้อย่างง่ายดายโดยใช้แอปพลิเคชันของตน คำแนะนำโดยย่อ:",
      "step_1": "ประการแรก คุณต้องส่งไฟล์ {{FileformatCap}} เป็นพารามิเตอร์ของตัวสร้างคลาส {{TextWatermarkerBold}} ระบุไบต์หรือสตรีมไฟล์หรือเส้นทางของดิสก์ในเครื่อง",
      "step_2": "ประการที่สอง ค้นหาลายน้ำที่ต้องปรับเปลี่ยน ใช้ {{TextSearchCriteriaBold}} เพื่อระบุลายน้ำที่มีคุณสมบัติเฉพาะที่เพิ่มลงในเอกสารก่อนหน้านี้",
      "step_3": "หลังจากการค้นหา คุณจะได้รับรายการลายน้ำที่เกี่ยวข้อง จากนั้นคุณสามารถปรับคุณสมบัติต่างๆ รวมถึงขนาด การจัดแนวหน้า ข้อความ สี เนื้อหารูปภาพ และอื่นๆ สิ่งนี้นำเสนอการปรับแต่งข้อมูลของคุณในระดับสูง",
      "step_4": "เมื่อคุณปรับลายน้ำเสร็จแล้ว ให้บันทึกเอกสารที่อัปเดต คุณสามารถใช้เส้นทางไฟล์ในเครื่องหรือสตรีมเพื่อจัดเก็บผลลัพธ์"
    }
  },
  "more_features": {
    "title": "การจัดการลายน้ำ {{FileFormatUp}} ขั้นสูงสำหรับการใช้งาน {{EnvName}}",
    "description": "API {{ProdShortName}} ช่วยให้นักพัฒนาสามารถรวมฟังก์ชันการทำลายน้ำเข้ากับแอปพลิเคชัน {{EnvName}} ได้อย่างราบรื่นรองรับการเพิ่ม แก้ไข ลบ และการค้นหาลายน้ำในรูปแบบเอกสารที่หลากหลาย",
    "image_description": "การปรับลายน้ำ",
    "feature_1": {
      "title": "การรวมลายน้ำได้อย่างง่ายดาย",
      "content": "{{ProdShortName}} ช่วยลดความยุ่งยากในการเพิ่มลายน้ำที่หลากหลายให้กับเอกสารและไฟล์ธุรกิจต่าง ๆ ภายในแอปพลิเคชัน {{EnvName}} นักพัฒนาไม่เพียง แต่สามารถใช้ลายน้ำ แต่ยังอัปเดตหรือลบลายที่มีอยู่ด้วยโปรแกรม"
    },
    "feature_2": {
      "title": "การปรับแต่งลายน้ำแบบเม็ด",
      "content": "API มีตัวเลือกการปรับแต่งที่กว้างขวางสำหรับลายน้ำนักพัฒนาสามารถปรับขนาดการหมุนสีแบบอักษรสไตล์และคุณสมบัติอื่น ๆ ได้อย่างง่ายดายเพื่อให้ได้เอฟเฟกต์ภาพที่ต้องการ"
    },
    "feature_3": {
      "title": "ใช้ประโยชน์จากคุณลักษณะเอกสารดั้งเดิม {{FileFormatUp}}",
      "content": "นักพัฒนาสามารถใช้ฟังก์ชันดั้งเดิมสำหรับการจัดวางลายน้ำขึ้นอยู่กับรูปแบบเอกสารเป้าหมายฟังก์ชันเหล่านี้อาจรวมถึงพื้นหลังหน้าเอกสาร คำอธิบายประกอบ ส่วนหัว หรือวัตถุอื่น ๆ เป็นคอนเทนเนอร์ลายน้ำ"
    },
    "code_1": {
      "title": "ปรับลายน้ำภาพในสเปรดชีต",
      "content": "ตัวอย่างนี้แสดงวิธีการปรับรูปภาพของรูปร่างเฉพาะในแผ่นงาน Excel",
      "comment_1": "โหลดเอกสารเป็นสเปรดชีต",
      "comment_2": "รับไบต์ลายน้ำใหม่",
      "comment_3": "ปรับเนื้อหาของลายน้ำเฉพาะ",
      "comment_4": "บันทึกเอกสารผลลัพธ์"
    }
  },
  "doc": {
    "head": {
      "title": "ปรับลายน้ำ {{FileFormatUp}} อย่างมืออาชีพ - {{ProdShortName}}",
      "description": "จัดการและปรับแต่งลายน้ำอย่างมืออาชีพด้วย {{ProdShortName}} รักษาความปลอดภัยเอกสารของคุณด้วยความมั่นใจ"
    },
    "header": {
      "title": "ปรับลายน้ำ {{FileFormatUp}}: การประกันระดับมืออาชีพ",
      "description": "รับรองมาตรฐานระดับมืออาชีพด้วยโซลูชันการจัดการลายน้ำของเราปกป้องเอกสารของคุณด้วยความน่าเชื่อถือ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดแพ็คเกจจาก {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**จัดการลายน้ำ**: โซลูชันการจัดการลายน้ำระดับมืออาชีพของเราให้ความมั่นใจในการปกป้องเอกสารของคุณลดความซับซ้อนของเวิร์กโฟลว์ของคุณด้วยเครื่องมือที่มีประสิทธิภาพสำหรับการเพิ่ม แก้ไข และลบลายน้ำ"
    },
    "formats": {
      "title": "แก้ไขลายน้ำในรูปแบบอื่นผ่าน {{ProdFullName}}",
      "description": "ลดความซับซ้อนในการจัดการลายน้ำในรูปแบบเอกสารที่หลากหลายโซลูชันของเรานำเสนอเครื่องมือที่มีประสิทธิภาพสำหรับการเพิ่ม แก้ไข และลบลายน้ำได้อย่างง่ายดาย"
    }
  },
  "docx": {
    "head": {
      "title": "ปรับลายน้ำในเอกสาร {{FileFormatUp}} - {{ProdShortName}}",
      "description": "แก้ไขลายน้ำได้อย่างมีประสิทธิภาพในรูปแบบเอกสารที่หลากหลายโดยใช้ {{ProdShortName}} เพิ่มความถูกต้องของเอกสาร"
    },
    "header": {
      "title": "ปรับลายน้ำ {{FileFormatUp}}: การปรับแต่งได้อย่างราบรื่น",
      "description": "ปรับแต่งเอกสารของคุณได้อย่างราบรื่นด้วยเครื่องมือแก้ไขลายน้ำที่มีประสิทธิภาพของเราเพิ่มภาพลักษณ์ของแบรนด์ของคุณได้อย่างง่ายดาย",
      "subtitle": "{{ProdFullName}} เอพีอี",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} เอพีอี",
      "content": "**แก้ไขลายน้ำ**: ปรับแต่งเอกสารของคุณได้อย่างราบรื่นด้วยเครื่องมือแก้ไขที่มีประสิทธิภาพของเราไม่ว่าจะเป็นการปรับตำแหน่งหรือเปลี่ยนเนื้อหา ให้เอฟเฟกต์ลายน้ำที่คุณต้องการได้อย่างง่ายดาย"
    },
    "formats": {
      "title": "แก้ไขลายน้ำในหลายรูปแบบโดยใช้ {{ProdFullName}}",
      "description": "แก้ไขลายน้ำได้อย่างราบรื่นในรูปแบบเอกสารหลายรูปแบบปรับแต่งเอกสารของคุณได้อย่างง่ายดายในขณะที่รับประกันการป้องกันและความถูกต้อง"
    }
  },
  "pdf": {
    "head": {
      "title": "ปรับลายน้ำใน {{FileFormatUp}} - {{ProdShortName}}",
      "description": "ปรับและปรับแต่งลายน้ำในเอกสารประเภทต่างๆ ได้อย่างง่ายดายด้วย {{ProdShortName}} ตรวจสอบความน่าเชื่อถือของเอกสาร"
    },
    "header": {
      "title": "ปรับลายน้ำ {{FileFormatUp}}: การป้องกันที่หลากหลาย",
      "description": "ปกป้องเนื้อหาของคุณในรูปแบบต่างๆ ด้วยคุณสมบัติการปรับลายน้ำอเนกประสงค์ของเราปรับให้เข้ากับความต้องการของคุณได้อย่างราบรื่น",
      "subtitle": "{{ProdFullName}} โซลูชั่น",
      "action_title": "แพ็คเกจฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} โซลูชั่น",
      "content": "**ปรับลายน้ำ**: ปกป้องเนื้อหาของคุณในรูปแบบเอกสารที่หลากหลายด้วยคุณสมบัติการปรับลายน้ำอเนกประสงค์ของเราปรับแต่งกลยุทธ์การทำลายน้ำของคุณให้ตรงตามความต้องการเฉพาะของคุณได้อย่างง่ายดาย"
    },
    "formats": {
      "title": "จัดการลายน้ำในรูปแบบยอดนิยมด้วย {{ProdFullName}}",
      "description": "ปกป้องเนื้อหาของคุณในรูปแบบต่างๆ ด้วยคุณสมบัติการปรับลายน้ำอเนกประสงค์ของเราปรับให้เข้ากับความต้องการของคุณได้อย่างราบรื่น"
    }
  },
  "ppt": {
    "head": {
      "title": "ปรับลายน้ำ {{FileFormatUp}} ได้อย่างราบรื่น - {{ProdShortName}}",
      "description": "แก้ไขและปรับแต่งลายน้ำได้อย่างราบรื่นด้วย {{ProdShortName}} ปกป้องเอกสารของคุณด้วยความแม่นยำ"
    },
    "header": {
      "title": "แก้ไข {{FileFormatUp}} ลายน้ำ: การรักษาความปลอดภัยที่ปรับแต่ง",
      "description": "ปรับแต่งความปลอดภัยของเอกสารของคุณด้วยตัวเลือกการแก้ไขลายน้ำที่ยืดหยุ่นของเราตรวจสอบการป้องกันที่ปรับให้เหมาะสมกับความต้องการของคุณ",
      "subtitle": "{{ProdFullName}} ห้องสมุด",
      "action_title": "ดาวน์โหลดจาก {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} ห้องสมุด",
      "content": "**แก้ไขลายน้ำ**: เพิ่มความปลอดภัยของเอกสารด้วยตัวเลือกการแก้ไขของเรา {{ProdShortName}} นำเสนอโซลูชันที่ปรับแต่งสำหรับการแก้ไขและปรับแต่งลายน้ำเพื่อให้เหมาะกับความต้องการด้านการสร้างแบรนด์และการป้องกันของคุณ"
    },
    "formats": {
      "title": "แก้ไขลายน้ำในรูปแบบอื่นที่รองรับโดยใช้ {{ProdFullName}}",
      "description": "รับรองความปลอดภัยของเอกสารด้วยตัวเลือกการแก้ไขลายน้ำที่ปรับแต่ง GroupDocs.Watermark นำเสนอโซลูชันที่ยืดหยุ่นสำหรับการแก้ไขและปรับแต่งลายน้ำ"
    }
  },
  "pptx": {
    "head": {
      "title": "ปรับลายน้ำ {{FileFormatUp}} ได้อย่างง่ายดาย - {{ProdShortName}}",
      "description": "ปรับแต่งเอกสารของคุณได้อย่างง่ายดายด้วย {{ProdShortName}} แก้ไขและจัดการลายน้ำได้อย่างง่ายดาย"
    },
    "header": {
      "title": "ปรับแต่ง {{FileFormatUp}} ลายน้ำ: การสร้างแบรนด์ที่ใช้งานง่าย",
      "description": "สร้างแบรนด์เอกสารของคุณได้อย่างมีประสิทธิภาพด้วยเครื่องมือลายน้ำที่ปรับแต่งได้ของเรายกระดับความโดดเด่นของแบรนด์ของคุณได้อย่างง่ายดาย",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดแพ็คเกจ {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**ปรับแต่งลายน้ำ**: ยกระดับภาพลักษณ์ของแบรนด์ของคุณด้วยเครื่องมือลายน้ำที่ปรับแต่งได้ของเราเพิ่มองค์ประกอบการสร้างแบรนด์ได้อย่างง่ายดายในขณะที่มั่นใจในความปลอดภัยและความถูกต้องของเอกสาร"
    },
    "formats": {
      "title": "ปรับลายน้ำในรูปแบบอื่นที่รองรับโดย {{ProdFullName}}",
      "description": "ยกระดับความโดดเด่นของแบรนด์ของคุณด้วยเครื่องมือลายน้ำที่ปรับแต่งได้สร้างแบรนด์เอกสารของคุณอย่างมีประสิทธิภาพในขณะที่รักษาความปลอดภัยและความถูกต้อง"
    }
  },
  "rtf": {
    "head": {
      "title": "ปรับลายน้ำใน {{FileFormatUp}} - {{ProdShortName}}",
      "description": "ขัดเอกสารของคุณด้วยความแม่นยำโดยใช้ {{ProdShortName}} ปรับและอัปเดตลายน้ำได้อย่างง่ายดาย"
    },
    "header": {
      "title": "ขัดเอกสาร {{FileFormatUp}} ของคุณ: การแก้ไขลายน้ำ",
      "description": "ปรับแต่งเอกสารของคุณด้วยความสามารถในการแก้ไขลายน้ำที่ครอบคลุมของเราขัดเนื้อหาของคุณด้วยความแม่นยำ",
      "subtitle": "{{ProdFullName}} เอพีอี",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}} เอพีอี",
      "content": "**ขัดเอกสารของคุณ**: ความสามารถในการแก้ไขลายน้ำที่ครอบคลุมของเราช่วยให้คุณปรับแต่งเอกสารของคุณได้อย่างแม่นยำตั้งแต่การปรับเปลี่ยนเล็กน้อยไปจนถึงการเปลี่ยนแปลงที่สมบูรณ์ ให้ผลลัพธ์ที่ขัดแย้งได้อย่างง่ายดาย"
    },
    "formats": {
      "title": "ลายน้ำเอกสารโปแลนด์ในรูปแบบอื่นด้วย {{ProdFullName}}",
      "description": "ปรับแต่งเอกสารของคุณด้วยความแม่นยำโดยใช้ความสามารถในการแก้ไขลายน้ำที่ครอบคลุมของเราเพิ่มความถูกต้องของเอกสารได้อย่างง่ายดาย"
    }
  },
  "xls": {
    "head": {
      "title": "ปรับลายน้ำ {{FileFormatUp}} ของคุณ - {{ProdShortName}}",
      "description": "ปรับแต่งตำแหน่งลายน้ำของคุณด้วย {{ProdShortName}} เพิ่มความปลอดภัยและความถูกต้องของเอกสาร"
    },
    "header": {
      "title": "ปรับแต่งตำแหน่งลายน้ำ {{FileFormatUp}} ของคุณ: ความแม่นยำจากผู้เชี่ยวชาญ",
      "description": "บรรลุการวางลายน้ำจากผู้เชี่ยวชาญด้วยเครื่องมือที่มีความแม่นยำของเราเพิ่มความปลอดภัยของเอกสารด้วยความแม่นยำ",
      "subtitle": "{{ProdFullName}} โซลูชั่น",
      "action_title": "ดาวน์โหลดฟรีที่ {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} โซลูชั่น",
      "content": "**ปรับแต่งตำแหน่งลายน้ำของคุณ**: บรรลุการวางลายน้ำอย่างมืออาชีพด้วยเครื่องมือที่มีความแม่นยำของเรา {{ProdShortName}} นำเสนอการควบคุมที่ใช้งานง่ายสำหรับการปรับแต่งตำแหน่งและรับประกันความปลอดภัยของเอกสาร"
    },
    "formats": {
      "title": "ปรับแต่งลายน้ำในรูปแบบอื่นที่รองรับด้วย {{ProdFullName}}",
      "description": "บรรลุการวางลายน้ำจากผู้เชี่ยวชาญด้วยการควบคุมที่ใช้งานง่ายตรวจสอบความปลอดภัยของเอกสารด้วยการจัดวางและการปรับแต่งที่ถูกต้อง"
    }
  },
  "xlsx": {
    "head": {
      "title": "ปรับและจัดการลายน้ำ {{FileFormatUp}} - {{ProdShortName}}",
      "description": "ปรับปรุงกระบวนการจัดการลายน้ำของคุณด้วย {{ProdShortName}} ลดความซับซ้อนในการป้องกันเอกสารและการสร้างแบรนด์"
    },
    "header": {
      "title": "การจัดการลายน้ำ {{FileFormatUp}} คล่องตัว: การควบคุมแบบง่าย",
      "description": "ลดความซับซ้อนของกระบวนการจัดการลายน้ำของคุณด้วยโซลูชันที่คล่องตัวของเรามุ่งเน้นไปที่เนื้อหาของคุณได้อย่างง่ายดาย",
      "subtitle": "{{ProdFullName}} ห้องสมุด",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}} ห้องสมุด",
      "content": "**ปรับตัวเลือกลายน้ำ**: ย้ายลายน้ำบนหน้าโดยใช้โซลูชันที่แม่นยำของเรา {{ProdShortName}} มีตัวเลือกมากมายสำหรับการปรับลายน้ำและรับประกันความปลอดภัยของเอกสาร"
    },
    "formats": {
      "title": "ใช้ {{ProdFullName}} สำหรับการแก้ไขลายน้ำในรูปแบบไฟล์อื่น",
      "description": "ลดความซับซ้อนของกระบวนการจัดการลายน้ำของคุณในรูปแบบเอกสารต่างๆมุ่งเน้นไปที่เนื้อหาของคุณได้อย่างง่ายดายในขณะที่รับประกันการป้องกันและการสร้างแบรนด์"
    }
  }
}