{
  "examples": {
    "comment_1": "Отрегулируйте водяной знак изображения {{FileFormatUp}}",
    "comment_2": "Создайте экземпляр водяного маркера с помощью {{FileFormatUp}}",
    "comment_3": "Инициализируйте SearchCriteria для соответствия определенному изображению",
    "comment_4": "Заменить найденное изображение",
    "comment_5": "Сохранить измененный файл"
  },
  "steps": {
    "title": "Отрегулируйте водяные знаки документа {{FileformatCap}}, используя {{EnvName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** позволяет разработчикам {{EnvName}} легко настраивать водяные знаки во многих документах с помощью своих приложений. Вот краткое руководство:",
      "step_1": "**Watermarker**. Укажите поток байтов, файлов или путь к локальному диску.",
      "step_2": "**SearchCriteria** для идентификации водяных знаков с определенными свойствами, ранее добавленными в документ.",
      "step_3": "После поиска вы получите список соответствующих водяных знаков. Затем вы можете настроить их свойства, включая размер, выравнивание страницы, текст, цвет, содержимое изображения и многое другое. Это обеспечивает высокую степень настройки ваших данных.",
      "step_4": "Закончив настройку водяных знаков, сохраните обновленный документ. Для хранения результатов можно использовать локальный путь к файлу или потоковую передачу."
    }
  },
  "more_features": {
    "title": "Расширенное управление водяными знаками {{FileFormatUp}} для приложений {{EnvName}}",
    "description": "API {{ProdShortName}} позволяет разработчикам легко интегрировать функции водяных знаков в свои приложения {{EnvName}}. Он поддерживает добавление, редактирование, удаление и поиск водяных знаков в самых разных форматах документов.",
    "image_description": "Регулировка водяных знаков",
    "feature_1": {
      "title": "Простая интеграция водяных знаков",
      "content": "{{ProdShortName}} упрощает процесс добавления различных водяных знаков к различным деловым документам и файлам в {{EnvName}} приложениях. Разработчики могут не только применять водяные знаки, но и программно обновлять или удалять существующие."
    },
    "feature_2": {
      "title": "Детальная настройка водяных знаков",
      "content": "API предоставляет широкие возможности настройки водяных знаков. Разработчики могут легко настроить размер, поворот, цвет, шрифт, стили и другие свойства для достижения желаемого визуального эффекта."
    },
    "feature_3": {
      "title": "Использование встроенных функций документов {{FileFormatUp}}",
      "content": "В зависимости от формата целевого документа разработчики могут использовать встроенные функции для размещения водяных знаков. Эти функции могут включать фон страницы документа, аннотации, заголовки или другие объекты в качестве контейнеров для водяных знаков."
    },
    "code_1": {
      "title": "Настройте водяной знак изображения в электронных таблицах",
      "content": "В этом примере показано, как настроить изображение определенных фигур на рабочем листе Excel.",
      "comment_1": "Загрузить документ в виде электронной таблицы",
      "comment_2": "Получите новые байты водяных знаков",
      "comment_3": "Отрегулируйте содержимое определенного водяного знака",
      "comment_4": "Сохранить документ с результатами"
    }
  },
  "doc": {
    "head": {
      "title": "Профессионально настройте водяные знаки {{FileFormatUp}} - {{ProdShortName}}",
      "description": "Профессионально управляйте водяными знаками и настраивайте их с помощью {{ProdShortName}}. Уверенно защищайте свои документы."
    },
    "header": {
      "title": "Отрегулируйте водяные знаки {{FileFormatUp}}: профессиональная гарантия",
      "description": "Обеспечьте профессиональные стандарты с помощью нашего решения по управлению водяными знаками. Надежно защитите свои документы.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Загрузите пакет от {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**Управление водяными знаками**: наше профессиональное решение по управлению водяными знаками обеспечивает безопасность ваших документов. Упростите рабочий процесс с помощью эффективных инструментов для добавления, редактирования и удаления водяных знаков."
    },
    "formats": {
      "title": "Редактирование водяных знаков в других форматах с помощью {{ProdFullName}}",
      "description": "Упростите управление водяными знаками в различных форматах документов. Наше решение предлагает эффективные инструменты для простого добавления, редактирования и удаления водяных знаков."
    }
  },
  "docx": {
    "head": {
      "title": "Настройка водяных знаков в {{FileFormatUp}} документах - {{ProdShortName}}",
      "description": "Эффективно редактируйте водяные знаки в различных форматах документов с помощью {{ProdShortName}}. Повысьте аутентичность документов."
    },
    "header": {
      "title": "Настройте водяные знаки {{FileFormatUp}}: удобная настройка",
      "description": "Легко настраивайте свои документы с помощью нашего эффективного инструмента для редактирования водяных знаков. Улучшите имидж своего бренда без особых усилий.",
      "subtitle": "{{ProdFullName}} API",
      "action_title": "Скачать бесплатно {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} API",
      "content": "**Редактирование водяных знаков**: легко настраивайте документы с помощью наших мощных инструментов редактирования. Будь то корректировка размещения или изменение содержимого, вы можете без труда добиться желаемых эффектов водяных знаков."
    },
    "formats": {
      "title": "Измените водяные знаки во многих форматах, используя {{ProdFullName}}",
      "description": "Легко редактируйте водяные знаки в различных форматах документов. Легко настраивайте документы, обеспечивая при этом защиту и подлинность."
    }
  },
  "pdf": {
    "head": {
      "title": "Настройте водяные знаки в {{FileFormatUp}} - {{ProdShortName}}",
      "description": "С легкостью настраивайте и уточняйте водяные знаки в разных типах документов с помощью {{ProdShortName}}. Обеспечьте достоверность документов."
    },
    "header": {
      "title": "Отрегулируйте водяные знаки {{FileFormatUp}}: универсальная защита",
      "description": "Защитите свой контент в различных форматах с помощью наших универсальных функций настройки водяных знаков. Легко адаптируйтесь к своим потребностям.",
      "subtitle": "{{ProdFullName}} Решение",
      "action_title": "Бесплатный пакет {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} Решение",
      "content": "**Настройте водяные знаки**: защитите содержимое документов различных форматов с помощью наших универсальных функций настройки водяных знаков. С легкостью адаптируйте стратегию нанесения водяных знаков в соответствии со своими конкретными требованиями."
    },
    "formats": {
      "title": "Управляйте водяными знаками в популярных форматах с помощью {{ProdFullName}}",
      "description": "Защитите свой контент в различных форматах с помощью наших универсальных функций настройки водяных знаков. Легко адаптируйтесь к своим потребностям."
    }
  },
  "ppt": {
    "head": {
      "title": "Легко корректируйте водяные знаки {{FileFormatUp}} - {{ProdShortName}}",
      "description": "Легко редактируйте и настраивайте водяные знаки с помощью {{ProdShortName}}. Прецизионно защищайте свои документы."
    },
    "header": {
      "title": "Пересмотрите водяные знаки {{FileFormatUp}}: индивидуальная защита",
      "description": "Настройте защиту документов с помощью наших гибких опций редактирования водяных знаков. Обеспечьте защиту, соответствующую вашим требованиям.",
      "subtitle": "{{ProdFullName}} Библиотека",
      "action_title": "Загрузить из {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} Библиотека",
      "content": "**Пересмотрите водяные знаки**: повысьте безопасность документов с помощью наших вариантов редактирования. {{ProdShortName}} предлагает индивидуальные решения по редактированию и уточнению водяных знаков в соответствии с вашими потребностями в брендинге и защите."
    },
    "formats": {
      "title": "Исправьте водяные знаки в других поддерживаемых форматах, используя {{ProdFullName}}",
      "description": "Обеспечьте безопасность документов с помощью специальных опций редактирования водяных знаков. GroupDocs.Watermark предлагает гибкие решения для редактирования и уточнения водяных знаков."
    }
  },
  "pptx": {
    "head": {
      "title": "Отрегулируйте водяные знаки {{FileFormatUp}} без особых усилий - {{ProdShortName}}",
      "description": "С легкостью настраивайте документы с помощью {{ProdShortName}}. С легкостью редактируйте водяные знаки и управляйте ими."
    },
    "header": {
      "title": "Настройка водяных знаков {{FileFormatUp}}: интуитивно понятный брендинг",
      "description": "Эффективно брендируйте свои документы с помощью нашего настраиваемого инструмента для нанесения водяных знаков. Повышайте узнаваемость своего бренда без особых усилий.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Загрузить пакет {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "**Настройте водяные знаки**: улучшите имидж своего бренда с помощью наших настраиваемых инструментов для создания водяных знаков. Легко добавляйте элементы брендинга, обеспечивая при этом безопасность и подлинность документов."
    },
    "formats": {
      "title": "Настройте водяные знаки в других поддерживаемых форматах с помощью {{ProdFullName}}",
      "description": "Повысьте узнаваемость своего бренда с помощью настраиваемых инструментов нанесения водяных знаков. Эффективно брендируйте свои документы, сохраняя при этом безопасность и подлинность."
    }
  },
  "rtf": {
    "head": {
      "title": "Настройте водяной знак в {{FileFormatUp}} - {{ProdShortName}}",
      "description": "Точно отполируйте документы с помощью {{ProdShortName}}. Легко настраивайте и обновляйте водяные знаки."
    },
    "header": {
      "title": "Отполируйте ваши {{FileFormatUp}} документы: редактирование водяных знаков",
      "description": "Усовершенствуйте свои документы с помощью наших комплексных возможностей редактирования водяных знаков. Тщательно отполируйте содержимое.",
      "subtitle": "{{ProdFullName}} API",
      "action_title": "Скачайте бесплатно на {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} API",
      "content": "**Отполируйте документы**: наши комплексные возможности редактирования водяных знаков позволяют точно дорабатывать документы. От незначительных корректировок до полных преобразований — легко добивайтесь безупречных результатов."
    },
    "formats": {
      "title": "Водяные знаки польских документов в других форматах с {{ProdFullName}}",
      "description": "Уточняйте свои документы с высокой точностью, используя наши комплексные возможности редактирования водяных знаков. Повышайте подлинность документов без особых усилий."
    }
  },
  "xls": {
    "head": {
      "title": "Отрегулируйте свои водяные знаки {{FileFormatUp}} - {{ProdShortName}}",
      "description": "Уточните размещение водяных знаков с помощью {{ProdShortName}}. Повысьте безопасность и подлинность документов."
    },
    "header": {
      "title": "Уточните расположение водяных знаков {{FileFormatUp}}: высочайшая точность",
      "description": "Обеспечьте профессиональное нанесение водяных знаков с помощью наших прецизионных инструментов. Повысьте точность защиты документов.",
      "subtitle": "{{ProdFullName}} Решение",
      "action_title": "Скачать бесплатно на {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} Решение",
      "content": "**Уточните размещение водяных знаков**: наши прецизионные инструменты позволяют грамотно размещать водяные знаки. {{ProdShortName}} предлагает интуитивно понятные средства управления для уточнения размещения и обеспечения безопасности документов."
    },
    "formats": {
      "title": "Уточните водяные знаки в других поддерживаемых форматах с помощью {{ProdFullName}}",
      "description": "Обеспечьте профессиональное размещение водяных знаков с помощью интуитивно понятного управления. Обеспечьте безопасность документов с помощью точного размещения и настройки."
    }
  },
  "xlsx": {
    "head": {
      "title": "Настройка и управление водяными знаками {{FileFormatUp}} - {{ProdShortName}}",
      "description": "Упростите процесс управления водяными знаками с помощью {{ProdShortName}}. Упростите защиту документов и создание фирменного стиля."
    },
    "header": {
      "title": "Упростите управление водяными знаками {{FileFormatUp}}: упрощенное управление",
      "description": "Упростите процесс управления водяными знаками с помощью нашего оптимизированного решения. С легкостью сосредоточьтесь на своем контенте.",
      "subtitle": "{{ProdFullName}} Библиотека",
      "action_title": "Скачайте бесплатно на {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} Библиотека",
      "content": "**Настройте параметры водяных знаков**: перемещайте водяные знаки на странице с помощью нашего прецизионного решения. {{ProdShortName}} предлагает множество вариантов настройки водяных знаков и обеспечения безопасности документов."
    },
    "formats": {
      "title": "Используйте {{ProdFullName}} для редактирования водяных знаков в других форматах файлов",
      "description": "Упростите процесс управления водяными знаками в различных форматах документов. С легкостью сосредоточьтесь на своем контенте, обеспечив при этом защиту и фирменную символику."
    }
  }
}