{
  "examples": {
    "comment_1": "واترمارک نوشتاری را در سند {{FileformatCap}} حذف کنید",
    "comment_2": "{{TextWatermarker}} را با سند {{FileformatCap}} نمونه برداری کنید",
    "comment_3": "واترمارک های متنی پاک با شرایط جستجو مطابقت دارند",
    "comment_4": "فایل پردازش شده را ذخیره کنید"
  },
  "steps": {
    "title": "{{FileformatCap}} حذف واترمارک با استفاده از {{EnvName}}",
    "content": {
      "title": "**[{{ProdShortName}}]({{ProductUrl}})** به توسعه دهندگان {{EnvName}} یک API جامع برای حذف برنامه‌ای واترمارک‌های خاص تعبیه‌شده در اسناد مختلف {{FileformatCap}} ارائه می‌دهد. این راهنما به فرآیند فنی می پردازد:",
      "step_1": "با نمونه سازی کلاس {{TextWatermarkerBold}} و ارائه فایل {{FileformatCap}} خود به عنوان آرگومان سازنده، گردش کار را آغاز کنید. فایل را می توان به صورت یک جریان بایت، یک جریان فایل، یا یک مرجع مسیر به یک محل دیسک محلی ارائه کرد.",
      "step_2": "برای رسیدن به هدف گذاری واترمارک دقیق، از قابلیت های شیء {{TextSearchCriteriaBold}} استفاده کنید. این شی ساخت فیلترهای پیچیده را بر اساس ویژگی هایی که قبلاً در سند تعبیه شده است تسهیل می کند. می‌توانید از یک تصویر به عنوان پارامتر جستجو در کنار ویژگی‌های متن یا قالب‌بندی برای فعال کردن فرآیند انتخاب بسیار دانه‌دار استفاده کنید.",
      "step_3": "پس از اجرای جستجو، مجموعه ای از واترمارک های شناسایی شده را دریافت خواهید کرد. این واترمارک ها ممکن است به راحتی حذف شوند.",
      "step_4": "پس از حذف موفقیت آمیز واترمارک، سند اصلاح شده را ادامه دهید. API انعطاف پذیری ذخیره سازی را فراهم می کند و به شما امکان می دهد از یک مسیر فایل محلی یا یک شی جریان برای خروجی نهایی استفاده کنید."
    }
  },
  "more_features": {
    "title": "{{EnvName}} API برای حذف واترمارک کارآمد",
    "description": "از {{EnvName}} API ما برای حذف یا پاک کردن واترمارک ها از انواع قالب های سند از جمله PDF s و فایل های Office استفاده کنید. این API که برای توسعه دهندگان طراحی شده است، بدون زحمت با {{EnvName}} برنامه های شما ادغام می شود و اسناد پاک و شفاف را تضمین می کند.",
    "image_description": "حذف علامت",
    "feature_1": {
      "title": "{{EnvName}} حذف علامت",
      "content": "از {{EnvName}} API ما برای حذف علامت های آب با دقت و سهولت استفاده کنید. ایده آل برای برنامه هایی که نیاز به اسناد علامت گذاری نشده برای ارائه یا پردازش بیشتر دارند."
    },
    "feature_2": {
      "title": "پردازش حذف واترمارک دسته ای",
      "content": "با ویژگی حذف علامت فله ما، چندین اسناد را به طور موثر مدیریت کنید. با پردازش دسته های بزرگ فایل ها به طور همزمان در {{EnvName}} برنامه های شما، در زمان و منابع سرور صرفه جویی کنید."
    },
    "feature_3": {
      "title": "ویرایش و حذف واترمارک ها به صورت انعطاف پذیر",
      "content": "API ما امکان ویرایش و حذف انعطاف پذیر عناصر واترمارک را فراهم می کند و نیازهای مختلف کسب و کار و انواع اسناد را برآورده می کند. اسناد خود را برای حفظ ظاهر حرفه ای و ضمن اطمینان از یکپارچگی محتوا تطبیق دهید."
    },
    "code_1": {
      "title": "حذف PDF علامت هایپرلینک",
      "content": "این مثال نحوه حذف تمام واترمارک ها با هیپر-لینک مناسب از PDF نشان می دهد",
      "comment_1": "بارگذاری PDF در واترمارکر",
      "comment_2": "جستجوی واترمارک ها با هایپر لینک",
      "comment_3": "واترمارک های انتخاب شده را حذف کنید",
      "comment_4": "ذخیره تغییرات در سند"
    }
  },
  "excel": {
    "ext": "اکس‌اس‌لکس",
    "head": {
      "title": "{{EnvName}} API برای حذف علامت {{FileformatCap}}",
      "description": "قابلیت های حذف علامت واترمارک را در {{FileformatCap}} فایل ها با {{EnvName}} API ما ادغام کنید، وضوح سند و ارائه داده ها را افزایش دهید."
    },
    "header": {
      "title": "{{EnvName}} API برای مدیریت {{FileformatCap}} واترمارک ها",
      "description": "از {{ProdFullName}} API برای حذف یا تغییر علامت های آب در {{FileformatCap}} اسناد استفاده کنید که برای اطمینان از برگه های داده پاک در گردش کار خودکار مناسب است.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود رایگان در {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "کتابخانه {{ProdFullName}} مدیریت واترمارک در {{FileformatCap}} فایل را ساده می کند و توسعه دهندگان را قادر می سازد تا واترمارک ها را حذف، تنظیم یا کاملاً پاک کنند. این ابزار برای حفظ یکپارچگی و ارائه داده های مالی و تحلیلی در {{FileformatCap}} ورق ضروری است و از انواع فرآیندهای تجاری پشتیبانی می کند."
    },
    "formats": {
      "title": "افزایش {{FileformatCap}} فایل ها با {{EnvName}}",
      "description": "بیاموزید که چگونه API {{ProdFullName}} می تواند به شما در مدیریت و حذف واترمارک ها از {{FileformatCap}} اسناد کمک کند و از دید بی مانع داده ها و زیبایی شناسی حرفه ای اسناد اطمینان حاصل کند."
    }
  },
  "word": {
    "ext": "داکس",
    "head": {
      "title": "{{FileformatCap}} علامت های آب را به طور موثر با {{EnvName}} API حذف کنید",
      "description": "گردش کار سند خود را با ادغام حذف واترمارک برای {{FileformatCap}} فایل ها با استفاده از {{EnvName}} API ما بهینه کنید."
    },
    "header": {
      "title": "{{EnvName}} API برای حذف علامت {{FileformatCap}}",
      "description": "از {{ProdFullName}} API برای حذف یا ویرایش موثر واترمارک ها از {{FileformatCap}} سند استفاده کنید که برای اطمینان از خروجی های تمیز و حرفه ای اسناد ایده آل است.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "کتابخانه {{ProdFullName}} ابزارهای قدرتمندی را برای مدیریت واترمارک ها در {{FileformatCap}} سند به توسعه دهندگان ارائه می دهد. چه نیاز به پاک کردن، ویرایش یا حذف واترمارک ها داشته باشید، این API دستکاری آسان عناصر سند را برای حفظ کیفیت بصری و یکپارچگی اسناد شما تسهیل می کند و آن را برای تنظیمات حقوقی، دانشگاهی و شرکتی مناسب می کند."
    },
    "formats": {
      "title": "مدیریت موثر واترمارک در {{FileformatCap}} با {{EnvName}}",
      "description": "قابلیت های API {{ProdFullName}} را برای مدیریت و حذف واترمارک ها در {{FileformatCap}} اسناد بررسی کنید و از وضوح و خوانایی برای تمام فایل های مهم خود اطمینان حاصل کنید."
    }
  },
  "powerpoint": {
    "ext": "پی‌تی‌اکس",
    "head": {
      "title": "{{EnvName}} API برای حذف علامت {{FileformatCap}}",
      "description": "وضوح ارائه را با حذف یکپارچه واترمارک ها از {{FileformatCap}} اسلاید با {{EnvName}} API ما افزایش دهید."
    },
    "header": {
      "title": "{{EnvName}} {{FileformatCap}} کنترل واترمارک",
      "description": "از {{ProdFullName}} API برای پاک کردن واترمارک ها از {{FileformatCap}} ارائه به طور موثر استفاده کنید و از تصاویر اسلاید بی مانع و حرفه ای اطمینان حاصل کنید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "کتابخانه {{ProdFullName}} توسعه دهندگان را قادر می سازد تا به راحتی واترمارک ها را در {{FileformatCap}} فایل حذف و مدیریت کنند. این ابزار قوی از کنترل دقیق روی علامت های متن و تصویر پشتیبانی می کند و امکان حفظ ارائه های با کیفیت بالا در محیط های تجاری و آموزشی را فراهم می کند."
    },
    "formats": {
      "title": "بهینه سازی {{FileformatCap}} اسلاید با {{EnvName}}",
      "description": "کشف کنید که چگونه API {{ProdFullName}} می تواند روند حذف واترمارک ها از {{FileformatCap}} اسلاید را ساده کند و ارائه های واضح تر و تأثیرگذارتر را تسهیل کند."
    }
  }
}