{
  "examples": {
    "comment_1": "واترمارک نوشتاری را در سند {{FileformatCap}} پاک کنید",
    "comment_2": "{{TextWatermarker}} را با سند {{FileformatCap}} نمونه برداری کنید",
    "comment_3": "واترمارک خاص را پاک کنید",
    "comment_4": "فایل پردازش شده را ذخیره کنید"
  },
  "steps": {
    "title": "پاک کردن اسناد {{FileformatCap}} از واترمارک با استفاده از {{EnvName}}",
    "content": {
      "title": "**[{{ProdShortName}}]({{ProductUrl}})** پاک کردن اسناد تجاری از واترمارک های اضافه شده قبلی را آسان می کند. با نصب کتابخانه ما، برنامه {{EnvName}} خود را قدرتمند کنید و این کار را در چند مرحله ساده انجام دهید:",
      "step_1": "اول از همه کلاس اصلی به نام {{TextWatermarkerBold}} را با سند {{FileformatCap}} نمونه سازی کنید. API ما از ارسال یک سند برای پردازش به عنوان جریان یا یک مسیر محلی پشتیبانی می کند.",
      "step_2": "از {{TextSearchCriteriaBold}} برای محدود کردن مجموعه ای از واترمارک های مورد پردازش استفاده کنید. امکان استفاده از یک تصویر به عنوان پارامتر جستجو و همچنین ویژگی های متن یا قالب بندی وجود دارد. سپس پارامترهای جستجوی خاص تری را ارائه می دهید، سپس نتیجه دقیق تری به دست می آورید.",
      "step_3": "فهرست فرآیند واترمارک های سندی را که به عنوان نتیجه جستجو به دست آورده اید، پردازش کنید. سند را پاک کنید.",
      "step_4": "پس از پاک کردن سند، نتیجه را به عنوان یک فایل محلی یا یک جریان بایت ذخیره کنید."
    }
  },
  "more_features": {
    "title": "حذف واترمارک کارآمد از طریق {{EnvName}} API",
    "description": "قابلیت های قوی API {{EnvName}} ما را برای حذف یا پاک کردن واترمارک ها از انواع مختلف سند، از جمله PDF s و فایل های Office بررسی کنید. ایده آل برای توسعه دهندگان که به دنبال حفظ تصاویر پاک و محافظت از یکپارچگی اسناد هستند.",
    "image_description": "واترمارک پاک",
    "feature_1": {
      "title": "واترمارک ها را با دقت حذف کنید",
      "content": "از {{EnvName}} API ما برای هدف قرار دادن و حذف دقیق واترمارک ها بدون ایجاد اختلال در طرح اصلی سند استفاده کنید. ایده آل برای اسناد حساس یا رسمی که شفافیت و دقت در آنها بسیار مهم است."
    },
    "feature_2": {
      "title": "حذف واترمارک دسته ای",
      "content": "با حذف واترمارک ها از چندین فایل به طور همزمان، کارایی پردازش سند خود را افزایش دهید. API ما از عملیات دسته ای پشتیبانی می کند و در زمان و منابع برای کارهای بزرگ صرفه جویی می کند."
    },
    "feature_3": {
      "title": "ویرایش عناصر واترمارک",
      "content": "ابزارهای ویرایش پیشرفته ما به شما امکان می دهد اجزای واترمارک را به طور انتخابی ویرایش کنید و انعطاف پذیری در مدیریت ارائه سند را در عین حال اطمینان از امنیت"
    },
    "code_1": {
      "title": "PDF واترمارک متن پاک",
      "content": "این مثال نحوه یافتن و حذف تمام حاشیه نویسی حاوی متن با قالب بندی خاص از یک سند PDF را نشان می دهد.",
      "comment_1": "بارگذاری PDF سند",
      "comment_2": "دریافت محتوای سند",
      "comment_3": "واترمارک های متن را با فونت خاص پاک کنید",
      "comment_4": "سند را ذخیره کنید"
    }
  },
  "excel": {
    "ext": "اکس‌اس‌لکس",
    "head": {
      "title": "حذف واترمارک ها از {{FileformatCap}} با {{EnvName}} API",
      "description": "با استفاده از {{ProdFullName}} API به راحتی واترمارک ها را از {{FileformatCap}} فایل ها پاک کنید، حذف یا ویرایش کنید. یکپارچگی و ارائه سند را تقویت کنید."
    },
    "header": {
      "title": "{{EnvName}} {{FileformatCap}} مدیریت واترمارک",
      "description": "از {{ProdFullName}} برای حذف یا ویرایش واترمارک ها در صفحات گسترده {{FileformatCap}} به طور موثر و با دقت استفاده کنید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود رایگان در {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "با کتابخانه {{ProdFullName}}، توسعه دهندگان می توانند واترمارک ها را در {{FileformatCap}} فایل به طور یکپارچه مدیریت کنند. این ابزار از عملیاتی مانند حذف، تنظیم و جستجوی هر دو علامت متن و تصویر پشتیبانی می کند. ایده آل برای برنامه های کاربردی که نیاز به ارائه بصری تمیز از داده ها بدون به خطر انداختن امنیت یا طرح سند دارند."
    },
    "formats": {
      "title": "مدیریت {{FileformatCap}} واترمارک در {{EnvName}}",
      "description": "بیاموزید که چگونه API {{FileformatCap}} حذف واترمارک از {{FileformatCap}} اسناد را ساده کرده و یکپارچگی و وضوح فایل را حفظ می کند."
    }
  },
  "word": {
    "ext": "داکس",
    "head": {
      "title": "حذف {{FileformatCap}} علامت آب با {{EnvName}} API",
      "description": "حذف، ویرایش و وضوح واترمارک برای {{FileformatCap}} اسناد را با استفاده از {{ProdFullName}} API ساده کنید."
    },
    "header": {
      "title": "{{EnvName}} {{FileformatCap}} حذف علامت",
      "description": "با استفاده از {{ProdFullName}} API، بر حذف واترمارک ها از {{FileformatCap}} سند تسلط داشته باشید و از خروجی های اسناد بکر اطمینان حاصل کنید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "{{PackageStoreName}} دانلود"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "از کتابخانه {{ProdFullName}} برای مدیریت و پاک کردن واترمارک ها از {{FileformatCap}} اسناد به طور موثر استفاده کنید. این ابزار قدرتمند قابلیت هایی را برای حذف، تنظیم و جستجو برای واترمارک های متن و تصویر فراهم می کند و حفاظت و مدیریت صحت و ظاهر سند را تسهیل می کند."
    },
    "formats": {
      "title": "مدیریت {{FileformatCap}} علامت های آب با {{EnvName}}",
      "description": "نحوه مدیریت و حذف واترمارک ها در {{FileformatCap}} فایل ها، افزایش امنیت و خوانایی سند با API {{ProdFullName}} را کشف کنید."
    }
  },
  "powerpoint": {
    "ext": "پی‌تی‌اکس",
    "head": {
      "title": "{{EnvName}} API برای پاک کردن واترمارک ها در ارائه ها",
      "description": "ارائه های خود را با حذف علامت های آب با {{EnvName}} API ما بهینه کنید و از اسلایدهای تمیز برای استفاده حرفه ای اطمینان حاصل کنید."
    },
    "header": {
      "title": "{{EnvName}} پاک کننده واترمارک ارائه",
      "description": "API {{ProdFullName}} را برای حذف موثر واترمارک ها از اسلایدهای ارائه، افزایش وضوح بصری و مشارکت مخاطبان استفاده کنید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "کتابخانه {{ProdFullName}} {{EnvName}} توسعه دهندگان را قادر می سازد تا واترمارک ها را از فایل های ارائه به راحتی دستکاری و حذف کنند. از ویژگی های جامع برای تنظیم و پاک کردن واترمارک های متن و تصویر پشتیبانی می کند و اطمینان حاصل می کند که ارائه های شما ظاهر حرفه ای را حفظ می کنند و در عین حال یکپارچگی محتوا را حفظ می کنند."
    },
    "formats": {
      "title": "مدیریت واترمارک کارآمد در {{EnvName}} برای ارائه",
      "description": "با استفاده از {{ProdFullName}} API که برای نگهداری اسلایدهای حرفه ای با کیفیت بالا طراحی شده است، سهولت مدیریت و حذف واترمارک ها از ارائه ها را کشف کنید."
    }
  }
}