{
  "examples": {
    "comment_1": "Tìm kiếm hình mờ văn bản trong tài liệu {{FileFormatUp}}",
    "comment_2": "Lấy phiên bản {{TextWatermarker}} cho tài liệu {{FileFormatUp}}",
    "comment_3": "Tìm kiếm hình mờ theo tiêu chí",
    "comment_4": "Xử lý hình mờ"
  },
  "steps": {
    "title": "Tìm kiếm hình mờ trong tệp {{FileformatCap}} bằng cách sử dụng {{EnvName}}",
    "content": {
      "title": "**[{{ProdShortName}}]({{ProductUrl}})** giúp bạn dễ dàng tìm kiếm các hình mờ đã được đặt trong tài liệu kinh doanh. Tải xuống gói của chúng tôi và đưa gói đó vào ứng dụng {{EnvName}} của bạn để tận dụng các lợi ích của gói đó.",
      "step_1": "Để sử dụng các tính năng thư viện của chúng tôi, bạn cần tải tệp {{FileformatCap}} vào phiên bản lớp {{TextWatermarkerBold}}. Có thể chỉ cung cấp đường dẫn tệp, luồng tệp hoặc luồng byte.",
      "step_2": "Để thu hẹp danh sách các hình mờ có thể sử dụng đối tượng {{TextSearchCriteriaBold}}. Cung cấp hình ảnh làm ví dụ để có được hình mờ hình ảnh tương tự. Nếu bạn muốn tìm kiếm hình mờ văn bản, hãy cung cấp văn bản, phông chữ, màu sắc và các tùy chọn khác.",
      "step_3": "Để lấy hình mờ được đặt trong tài liệu, hãy sử dụng phương thức {{TextSearchBold}} của đối tượng {{TextWatermarkerBold}}. Bạn sẽ được cung cấp bộ sưu tập các đối tượng có thể được xử lý dưới dạng hình mờ.",
      "step_4": "Cuối cùng, bạn có thể tự do thực hiện bất cứ điều gì bạn muốn với kết quả tìm kiếm. Hoàn toàn có thể xóa các hình mờ được tìm thấy hoặc chỉnh sửa thuộc tính của chúng. Thay đổi kích thước hoặc văn bản, ví dụ."
    }
  },
  "more_features": {
    "title": "Khai thác Java để tìm kiếm hình mờ nâng cao với {{ProdShortName}}",
    "description": "Sử dụng {{ProdShortName}} Java API để thực hiện các tìm kiếm tinh vi cho hình mờ trong tài liệu trên các định dạng khác nhau trong {{EnvName}}.",
    "image_description": "Tìm kiếm hình mờ nâng cao",
    "feature_1": {
      "title": "Java - Kỹ thuật tìm kiếm hình mờ nâng cao",
      "content": "Hỗ trợ Java ứng dụng của bạn với các kỹ thuật tìm kiếm nâng cao bằng cách sử dụng {{ProdShortName}}. API của chúng tôi cho phép tìm kiếm sâu các hình mờ nhúng trên các loại tài liệu khác nhau, mang lại độ chính xác và hiệu quả."
    },
    "feature_2": {
      "title": "Xác định hình mờ với truy vấn tùy chỉnh Java",
      "content": "Tùy chỉnh truy vấn Java của bạn để phát hiện hình mờ hiệu quả hơn. Sử dụng {{ProdShortName}} để sắp xếp và lọc hình mờ theo các thuộc tính như độ trong suốt, phương pháp nhúng và nội dung văn bản hoặc hình ảnh."
    },
    "feature_3": {
      "title": "Quản lý hiệu quả các hình mờ tài liệu",
      "content": "Hợp lý hóa việc quản lý hình mờ trong Java ứng dụng của bạn. Với {{ProdShortName}}, nhanh chóng tìm, xem xét và phân tích hình mờ để đảm bảo tính toàn vẹn của tài liệu và tuân thủ các nguyên tắc xây dựng thương hiệu."
    },
    "code_1": {
      "title": "Java Ví dụ về mã: Tìm kiếm hình mờ thông minh",
      "content": "Tìm hiểu cách triển khai tìm kiếm hình mờ thông minh bằng cách sử dụng Java với {{ProdShortName}}, thể hiện khả năng xử lý các hoạt động tìm kiếm phức tạp và quản lý kết quả của API.",
      "comment_1": "Thiết lập môi trường Java và tải tài liệu từ nhiều nguồn khác nhau",
      "comment_2": "Xác định các tham số tìm kiếm nâng cao để xác định vị trí các loại hình mờ cụ thể",
      "comment_3": "Thực hiện tìm kiếm và xử lý các hình mờ tìm thấy để xem xét chi tiết",
      "comment_4": "Lưu hoặc cập nhật tài liệu dựa trên kết quả tìm kiếm hình mờ"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "Khám phá {{FileformatCap}} Bảng tính Hình mờ Tìm kiếm",
      "description": "Khám phá cách {{ProdFullName}} cho phép bạn dễ dàng tìm kiếm, tìm và quản lý hình mờ ở các định dạng tài liệu khác nhau."
    },
    "header": {
      "title": "Ra mắt khả năng tìm kiếm hình mờ của bảng tính {{FileformatCap}}",
      "description": "Tìm hiểu sức mạnh của {{ProdFullName}} để tìm kiếm, chỉnh sửa và thao tác hình mờ một cách dễ dàng.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Tải xuống tại {{PackageStoreName}} miễn phí"
    },
    "about": {
      "title": "Thông tin cơ sở {{ProdFullName}}",
      "content": "{{ProdFullName}} là một giải pháp toàn diện để quản lý {{FileformatCap}} hình mờ bằng cách sử dụng {{EnvName}}. Với công cụ này, các nhà phát triển có thể dễ dàng thực hiện các thao tác như tạo, chỉnh sửa, tìm kiếm và xóa hình mờ khỏi tài liệu ở các định dạng tệp phổ biến. Nó hỗ trợ làm việc với cả hình mờ văn bản và hình ảnh trong nhiều tài liệu, bao gồm PDF, Microsoft Word, Excel, PowerPoint, Visio, email và định dạng hình ảnh. {{ProdFullName}} hỗ trợ tất cả các hệ điều hành chính và {{EnvName}} phiên bản."
    },
    "formats": {
      "title": "Mở khóa sức mạnh của Tìm kiếm Hình mờ",
      "description": "Trao quyền cho bản thân để tìm và quản lý hình mờ ở các định dạng tệp được hỗ trợ khác nhau với {{ProdFullName}}."
    }
  },
  "word": {
    "ext": "docx",
    "head": {
      "title": "Sức mạnh của {{FileformatCap}} Tài liệu Tìm kiếm Hình mờ",
      "description": "Trải nghiệm khả năng tuyệt vời để tìm kiếm và quản lý hình mờ trên các loại tài liệu khác nhau với {{ProdFullName}}."
    },
    "header": {
      "title": "Khám phá Tìm kiếm Hình mờ Nâng cao {{FileformatCap}}",
      "description": "Bắt tay vào hành trình khám phá các tính năng tìm kiếm hình mờ tiên tiến được cung cấp bởi {{ProdFullName}}.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Nhận từ {{PackageStoreName}}"
    },
    "about": {
      "title": "Khoảng {{ProdFullName}}",
      "content": "{{ProdFullName}} cung cấp một giải pháp mạnh mẽ để quản lý hình mờ bằng cách sử dụng {{EnvName}}. Các nhà phát triển có thể dễ dàng tạo, chỉnh sửa, tìm kiếm và xóa hình mờ khỏi tài liệu ở các định dạng tệp phổ biến. Nó hỗ trợ cả hình mờ văn bản và hình ảnh trên các loại tài liệu khác nhau, bao gồm PDF, Microsoft Word, Excel, PowerPoint, Visio, email và định dạng hình ảnh. {{ProdFullName}} tích hợp liền mạch với tất cả các hệ điều hành chính và {{EnvName}} phiên bản."
    },
    "formats": {
      "title": "Tìm kiếm hình mờ chính trên các định dạng",
      "description": "Mở khóa tiềm năng của {{ProdFullName}} để tìm kiếm và thao tác hình mờ ở các định dạng tệp được hỗ trợ khác nhau."
    }
  },
  "powerpoint": {
    "ext": "pptx",
    "head": {
      "title": "Tìm kiếm {{FileformatCap}} Hình mờ bài thuyết trình:",
      "description": "Đổi mới chiến lược quản lý hình mờ của bạn với {{ProdFullName}} khả năng tìm kiếm nâng cao trên các định dạng tài liệu khác nhau."
    },
    "header": {
      "title": "Nâng cao quy trình làm việc của bạn với {{FileformatCap}} Trình bày Hình mờ Tìm kiếm",
      "description": "Nâng cao năng suất của bạn bằng cách tận dụng {{ProdFullName}} chức năng tìm kiếm hình mờ hiện đại.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Tải xuống gói {{PackageStoreName}}"
    },
    "about": {
      "title": "Tìm hiểu thêm về {{ProdFullName}}",
      "content": "{{ProdFullName}} cung cấp một giải pháp toàn diện để quản lý hình mờ bằng cách sử dụng {{EnvName}}. Các nhà phát triển có thể tạo, chỉnh sửa, tìm kiếm và xóa hình mờ khỏi tài liệu ở các định dạng tệp khác nhau một cách liền mạch. Nó hỗ trợ hình mờ văn bản và hình ảnh trên một loạt các loại tài liệu, bao gồm PDF, Microsoft Word, Excel, PowerPoint, Visio, email và định dạng hình ảnh. {{ProdFullName}} tương thích với tất cả các hệ điều hành chính và {{EnvName}} phiên bản."
    },
    "formats": {
      "title": "Chuyển đổi quy trình làm việc của bạn với Tìm kiếm hình mờ",
      "description": "Trải nghiệm hiệu quả vô song trong việc quản lý hình mờ trên các định dạng tệp khác nhau với {{ProdFullName}}."
    }
  }
}