{
  "examples": {
    "comment_1": "ค้นหาลายน้ำข้อความใน {{FileFormatUp}}",
    "comment_2": "สร้าง {{TextWatermarker}} ด้วยเส้นทาง {{FileFormatUp}}",
    "comment_3": "ค้นหาลายน้ำ",
    "comment_4": "ใช้ข้อมูลลายน้ำที่พบ"
  },
  "steps": {
    "title": "ค้นหาลายน้ำในไฟล์ {{FileformatCap}} โดยใช้ {{EnvName}}",
    "content": {
      "title": "**[{{ProdShortName}}]({{ProductUrl}})** เพิ่มความคล่องตัวให้กับกระบวนการค้นหาลายน้ำภายในเอกสารทางธุรกิจ รวมแพ็คเกจของเราเข้ากับแอปพลิเคชัน {{EnvName}} ของคุณเพื่อปลดล็อกข้อได้เปรียบ",
      "step_1": "เพื่อใช้ประโยชน์จากคุณสมบัติไลบรารีของเรา ให้โหลดไฟล์ {{FileformatCap}} ลงในอินสแตนซ์คลาส {{TextWatermarkerBold}} คุณสามารถระบุเส้นทางของไฟล์ สตรีมไฟล์ หรือสตรีมไบต์ได้",
      "step_2": "หากต้องการปรับแต่งรายการลายน้ำที่เป็นไปได้ ให้ใช้ออบเจ็กต์ {{TextSearchCriteriaBold}} ตัวอย่างเช่น จัดเตรียมรูปภาพเพื่อค้นหาลายน้ำของรูปภาพที่คล้ายกัน หากพบลายน้ำที่เป็นข้อความ ให้ระบุข้อความ แบบอักษร สี และตัวเลือกอื่นๆ ที่เกี่ยวข้อง",
      "step_3": "ใช้เมธอด {{TextSearchBold}} ของออบเจ็กต์ {{TextWatermarkerBold}} เพื่อดึงลายน้ำที่วางไว้ภายในเอกสาร คุณจะได้รับชุดวัตถุที่แสดงลายน้ำเพื่อนำไปประมวลผลต่อไป",
      "step_4": "สุดท้ายนี้ คุณมีความยืดหยุ่นในการจัดการกับผลการค้นหาได้ตามต้องการ คุณสามารถลบลายน้ำที่พบหรือแก้ไขคุณสมบัติได้ เช่น การเปลี่ยนขนาดหรือข้อความ"
    }
  },
  "more_features": {
    "title": "ค้นหาและค้นหาลายน้ำได้อย่างมีประสิทธิภาพด้วย {{ProdShortName}}",
    "description": "ใช้พลังของ {{ProdShortName}} เพื่อค้นหาและค้นหาลายน้ำในเอกสารประเภทใดก็ได้โดยใช้ C# ภายใน {{EnvName}}",
    "image_description": "ค้นหาลายน้ำ",
    "feature_1": {
      "title": "ค้นพบลายน้ำด้วยการค้นหาขั้นสูง",
      "content": "ใช้ {{ProdShortName}} เพื่อค้นหาลายน้ำในเอกสารหลายประเภทได้อย่างง่ายดายเครื่องมือของเราช่วยให้คุณสามารถค้นหาตามพารามิเตอร์เช่นเนื้อหาขนาดและความทึบแสง"
    },
    "feature_2": {
      "title": "ค้นหาลายน้ำตามพารามิเตอร์ที่กำหนดเอง",
      "content": "ปรับแต่งเกณฑ์การค้นหาของคุณด้วย {{ProdShortName}} เพื่อค้นหาลายน้ำตามคุณสมบัติเฉพาะ เพื่อให้แน่ใจว่าคุณสามารถจัดการและตรวจสอบได้อย่างมีประสิทธิภาพ"
    },
    "feature_3": {
      "title": "ดึงข้อมูลและจัดการลายน้ำอย่างมีประสิทธิภาพ",
      "content": "ปรับปรุงกระบวนการจัดการเอกสารของคุณด้วยการดึงลายน้ำทั้งหมดในเอกสารอย่างรวดเร็วAPI ของเราช่วยให้สามารถระบุและวิเคราะห์ลายน้ำได้อย่างรวดเร็ว"
    },
    "code_1": {
      "title": "ตัวอย่าง C #: ค้นหาลายน้ำ",
      "content": "ตัวอย่าง C# นี้แสดงให้เห็นถึงวิธีการค้นหาลายน้ำภายในเอกสารใด ๆ โดยใช้ {{ProdShortName}} ซึ่งแสดงให้เห็นถึงวิธีการใช้พารามิเตอร์สำหรับการค้นพบที่แม่นยำ",
      "comment_1": "โหลดเอกสารจากแหล่งข้อมูลภายในหรือเครือข่ายสำหรับการประมวลผล",
      "comment_2": "กำหนดพารามิเตอร์สำหรับการค้นหาลายน้ำ เช่น ประเภทหรือการมองเห็น",
      "comment_3": "ดึงลายน้ำทั้งหมดที่ตรงกับเกณฑ์ที่ระบุ",
      "comment_4": "ตรวจสอบและจัดการรายการลายน้ำที่พบเพื่อประเมินผลกระทบ"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "ค้นหาลายน้ำ {{FileformatCap}} สเปรดชีตที่มองไม่เห็น",
      "description": "ค้นพบลายน้ำที่มองไม่เห็นในเอกสารโดยใช้ {{ProdShortName}} ได้อย่างง่ายดาย"
    },
    "header": {
      "title": "ค้นหา {{FileformatCap}} สเปรดชีตลายน้ำทันที",
      "description": "เปิดเผยและจัดการลายน้ำที่ซ่อนอยู่ได้อย่างง่ายดายด้วย {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "รับข้อมูล {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็นโซลูชันที่ครอบคลุมสำหรับการจัดการลายน้ำโดยใช้ {{EnvName}}สร้าง แก้ไข ค้นหา และลบลายน้ำจากรูปแบบเอกสารต่างๆ เช่น PDF, Microsoft Word, Excel และอื่นๆ ได้อย่างง่ายดายรวมการจัดการลายน้ำเข้ากับแอปพลิเคชันของคุณได้อย่างราบรื่นด้วย {{ProdFullName}}"
    },
    "formats": {
      "title": "ค้นพบลายน้ำในรูปแบบ",
      "description": "ค้นหาและระบุลายน้ำได้อย่างง่ายดายในรูปแบบไฟล์ที่รองรับต่างๆ"
    }
  },
  "word": {
    "ext": "ด็อกซ์",
    "head": {
      "title": "ค้นหาลายน้ำที่ซ่อนอยู่ใน {{FileformatCap}} เอกสาร",
      "description": "ค้นหาลายน้ำที่ซ่อนอยู่ภายในเอกสารได้อย่างง่ายดายด้วย {{ProdShortName}}"
    },
    "header": {
      "title": "ค้นหาลายน้ำที่ซ่อนอยู่ในเอกสาร {{FileformatCap}} ได้อย่างง่ายดาย",
      "description": "ระบุและจัดการลายน้ำที่ซ่อนอยู่ได้อย่างรวดเร็วด้วย {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "แพ็คเกจ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}} ข้อมูล",
      "content": "{{ProdFullName}} นำเสนอโซลูชันที่ครอบคลุมสำหรับการจัดการลายน้ำโดยใช้ {{EnvName}}สร้าง แก้ไข ค้นหา และลบลายน้ำจากรูปแบบเอกสารที่หลากหลาย ได้แก่ PDF, Microsoft Word, Excel และอื่น ๆ ได้อย่างง่ายดายค้นหาลายน้ำด้วยแอปพลิเคชันของคุณโดยใช้ {{ProdFullName}}"
    },
    "formats": {
      "title": "ค้นพบลายน้ำในรูปแบบที่รองรับ",
      "description": "ค้นหาและจัดการลายน้ำได้อย่างรวดเร็วในรูปแบบไฟล์ที่รองรับหลากหลาย"
    }
  },
  "powerpoint": {
    "ext": "พีพีทีเอ็กซ์",
    "head": {
      "title": "Unearth {{FileformatCap}} งานนำเสนอ ลายน้ำที่ซ่อนอยู่",
      "description": "ค้นพบลายน้ำที่ซ่อนอยู่ในเอกสารได้อย่างง่ายดายด้วย {{ProdShortName}}"
    },
    "header": {
      "title": "ค้นพบลายน้ำที่ซ่อนอยู่ {{FileformatCap}} งานนำเสนอได้อย่างง่ายดาย",
      "description": "เปิดเผยและจัดการลายน้ำที่ซ่อนอยู่ได้อย่างรวดเร็วด้วย {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} นำเสนอโซลูชันที่แข็งแกร่งสำหรับการจัดการลายน้ำโดยใช้ {{EnvName}}สร้าง แก้ไข ค้นหา และลบลายน้ำจากรูปแบบเอกสารต่างๆ เช่น PDF, Microsoft Word, Excel และอื่นๆ ได้อย่างง่ายดายรวมการค้นหาลายน้ำเข้ากับแอปพลิเคชันของคุณด้วย {{ProdFullName}}"
    },
    "formats": {
      "title": "ค้นพบลายน้ำในหลายรูปแบบ",
      "description": "ระบุและจัดการลายน้ำได้อย่างง่ายดายในรูปแบบไฟล์ที่รองรับหลายรูปแบบ"
    }
  }
}