{
  "examples": {
    "comment_1": "ตรวจจับลายน้ำข้อความในรูปแบบ {{FileFormatUp}}",
    "comment_2": "เริ่มต้น {{TextWatermarker}} ด้วยไฟล์ {{FileFormatUp}}",
    "comment_3": "ดำเนินการค้นหาลายน้ำ",
    "comment_4": "ประมวลผลรายการของลายน้ำที่ตรวจพบ"
  },
  "steps": {
    "title": "วิธีการตรวจจับลายน้ำในไฟล์ {{FileformatCap}} ผ่าน {{ProgLang}}",
    "content": {
      "title": "ด้วย **[{{ProdShortName}}]({{ProductUrl}})** การระบุลายน้ำที่ฝังในเอกสารธุรกิจของคุณเป็นเรื่องที่ง่ายขึ้น นำความสามารถนี้ไปใช้ในเวิร์กโฟลว์ของคุณด้วย {{ProgLang}} เพื่อการตรวจจับที่ราบรื่น",
      "step_1": "เริ่มต้นด้วยการโหลดเอกสาร {{FileformatCap}} ลงในอินสแตนซ์ของคลาส {{TextWatermarkerBold}} ซึ่งรองรับการรับค่าเป็นพาธ, สตรีม หรืออาร์เรย์ของไบต์",
      "step_2": "จำกัดการค้นหาของคุณด้วยวัตถุ {{TextSearchCriteriaBold}} หากต้องการค้นหาลายน้ำนภาพ ให้ใช้ตัวอย่างภาพ สำหรับลายน้ำข้อความ ให้ระบุลักษณะเช่นเนื้อหา, สไตล์ หรือสี",
      "step_3": "เรียกใช้วิธีการ {{TextSearchBold}} จากวัตถุ {{TextWatermarkerBold}} เพื่อนำข้อมูลลายน้ำออกมา โดยจะได้รับการเก็บรวบรวมของอินสแตนซ์ลายน้ำเพื่อตรวจสอบ",
      "step_4": "หลังจากรีเทิร์นผลลัพธ์แล้ว คุณสามารถจัดการผลลัพธ์ได้: ลบลายน้ำที่ไม่ต้องการ หรืออัปเดตข้อมูลเช่นขนาดหรือเนื้อหาข้อความ"
    }
  },
  "more_features": {
    "title": "การตรวจจับลายน้ำที่ทรงพลังด้วย {{ProdShortName}}",
    "description": "ใช้ {{ProdShortName}} ในโปรเจ็กต์ {{ProgLang}} ของคุณเพื่อตรวจสอบและค้นหาลายน้ำในเอกสารประเภทต่างๆ อย่างมีประสิทธิภาพ",
    "image_description": "การตรวจจับลายน้ำ",
    "feature_1": {
      "title": "การตรวจจับขั้นสูงด้วยฟิลเตอร์อัจฉริยะ",
      "content": "ระบุตำแหน่งลายน้ำในรูปแบบเอกสารที่หลากหลายได้อย่างแม่นยำ {{ProdShortName}} รองรับการกรองโดยลักษณะทางภาพและข้อความรวมถึงรูปทรง ความโปร่งแสง และอื่นๆ"
    },
    "feature_2": {
      "title": "เกณฑ์ยืดหยุ่นในการค้นหา",
      "content": "กำหนดพารามิเตอร์การค้นหาลายน้ำที่กำหนดเองด้วย {{ProdShortName}} ความแม่นยำนี้ช่วยให้การดึงข้อมูลลายน้ำที่ซ่อนหรือปรับแต่งได้ง่ายขึ้น"
    },
    "feature_3": {
      "title": "เข้าถึงและจัดการลายน้ำที่ตรวจพบ",
      "content": "ทำให้การตรวจสอบเอกสารง่ายขึ้นโดยการดึงลายน้ำที่ฝังทั้งหมด เครื่องมือของเราช่วยให้การดึงข้อมูล แสดงผล และจัดการกับรายการที่พบทำได้อย่างมีประสิทธิภาพ"
    },
    "code_1": {
      "title": "ตัวอย่างโค้ด: ตรวจจับลายน้ำ",
      "content": "ดูวิธีใช้ {{ProdShortName}} ในการค้นหาเอกสารที่มีเนื้อหาลายน้ำที่ฝังอยู่โดยใช้กฎการตรวจจับที่หลากหลาย",
      "comment_1": "เปิดเอกสารเป้าหมายจากดิสก์หรือสตรีม",
      "comment_2": "กำหนดคุณสมบัติลายน้ำเฉพาะที่จะใช้ในการค้นหา",
      "comment_3": "ดำเนินการค้นหาและรวบรวมผลการค้นหา",
      "comment_4": "ทำงานกับผลลัพธ์ที่พบเพื่อการดำเนินการต่อไป"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "ตรวจจับลายน้ำที่มองไม่เห็นในเอกสาร {{FileformatCap}}",
      "description": "เปิดเผยลายน้ำที่ซ่อนอยู่ในไฟล์สเปรดชีตได้อย่างรวดเร็วและแม่นยำด้วย {{ProdShortName}}"
    },
    "header": {
      "title": "ระบุลายน้ำในเอกสาร {{FileformatCap}} ได้ทันที",
      "description": "ค้นหาและจัดการลายน้ำได้อย่างราบรื่นโดยใช้ {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลด {{PackageStoreName}} ตอนนี้ – ฟรี"
    },
    "about": {
      "title": "ภาพรวมของ {{ProdFullName}}",
      "content": "{{ProdFullName}} นำเสนอชุดเครื่องมือจัดการลายน้ำแบบครบวงจรสำหรับนักพัฒนา {{ProgLang}} ทำการสร้าง แก้ไข ค้นหา และลบรอยลายน้ำออกจากเอกสารเช่น Excel, Word, PDF และอื่นๆ ด้วยความพยายามน้อยที่สุด"
    },
    "formats": {
      "title": "ค้นหาลายน้ำในหลายรูปแบบ",
      "description": "ค้นหาลายน้ำในเนื้อหาทั้งหมดของไฟล์ประเภทที่ {{ProdShortName}} รองรับ"
    }
  },
  "word": {
    "ext": "docx",
    "head": {
      "title": "ระบุลายน้ำที่ซ่อนอยู่ในเอกสาร {{FileformatCap}}",
      "description": "ค้นหาเอกสารสำหรับลายน้ำที่ซ่อนอยู่ได้ง่ายด้วย {{ProdShortName}}"
    },
    "header": {
      "title": "ค้นพบลายน้ำในเอกสาร {{FileformatCap}} ได้รวดเร็ว",
      "description": "เปิดเผยและตรวจสอบเนื้อหาลายน้ำที่ซ่อนอยู่โดยใช้ {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ฟรีกับ {{PackageStoreName}}"
    },
    "about": {
      "title": "เรียนรู้เกี่ยวกับ {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็นยูทิลิตี้ที่ทรงพลังสำหรับการจัดการลายน้ำใน {{ProgLang}} ไม่ว่าคุณจะเพิ่ม ลบ หรือค้นหาลายน้ำ มันรองรับรูปแบบเช่น DOCX, XLSX, PDF และอื่นๆ"
    },
    "formats": {
      "title": "ความสามารถในการตรวจจับหลายรูปแบบ",
      "description": "การสนับสนุนการวิเคราะห์ลายน้ำในหลากหลายประเภทไฟล์ที่ใช้กันอย่างแพร่หลาย"
    }
  },
  "powerpoint": {
    "ext": "pptx",
    "head": {
      "title": "ตรวจจับลายน้ำที่ซ่อนอยู่ในเอกสารนำเสนอ {{FileformatCap}}",
      "description": "ตรวจจับลายน้ำที่ซ่อนอยู่ในสไลด์พรีเซนเทชันได้ง่ายด้วย {{ProdShortName}}"
    },
    "header": {
      "title": "เปิดเผยลายน้ำในเอกสารนำเสนอ {{FileformatCap}}",
      "description": "จัดการลายน้ำในกลุ่มสไลด์ด้วยฟีเจอร์ที่เชื่อถือได้ของ {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ทดลองใช้งานฟรีที่ {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} คืออะไร?",
      "content": "{{ProdFullName}} ช่วยให้นักพัฒนาจัดการงานลายน้ำใน {{ProgLang}} ได้อย่างมีประสิทธิภาพ มีการออกแบบที่ยืดหยุ่น รองรับการค้นหา แทรก แก้ไข และลบลายน้ำในไฟล์รูปแบบต่างๆ เช่น PPTX, DOCX และ PDF"
    },
    "formats": {
      "title": "ความเข้ากันได้กับหลายรูปแบบ",
      "description": "เพลิดเพลินกับการตรวจจับลายน้ำอย่างราบรื่นในหลายรูปแบบเอกสารและพรีเซนเทชันที่รองรับ"
    }
  }
}