{
  "examples": {
    "comment_1": "یافتن واترمارک متنی در {{FileFormatUp}}",
    "comment_2": "{{TextWatermarker}} را با مسیر {{FileFormatUp}} ایجاد کنید",
    "comment_3": "واترمارک ها را پیدا کنید",
    "comment_4": "از اطلاعات واترمارک یافت شده استفاده کنید"
  },
  "steps": {
    "title": "یافتن واترمارک در فایل‌های {{FileformatCap}} با استفاده از {{EnvName}}",
    "content": {
      "title": "**[{{ProdShortName}}]({{ProductUrl}})** فرآیند یافتن واترمارک در اسناد تجاری را ساده می‌کند. بسته ما را در برنامه های کاربردی {{EnvName}} خود ادغام کنید تا قفل مزایای آن را باز کنید.",
      "step_1": "برای استفاده از ویژگی های کتابخانه ما، فایل {{FileformatCap}} را در یک نمونه کلاس {{TextWatermarkerBold}} بارگیری کنید. می توانید یک مسیر فایل، جریان فایل یا جریان بایت ارائه دهید.",
      "step_3": "از روش {{TextSearchBold}} شیء {{TextWatermarkerBold}} برای بازیابی واترمارک های قرار داده شده در سند استفاده کنید. شما مجموعه ای از اشیاء را دریافت خواهید کرد که نشان دهنده واترمارک های بالقوه برای پردازش بیشتر هستند.",
      "step_4": "در نهایت، شما این قابلیت را دارید که در صورت نیاز نتایج جستجو را دستکاری کنید. می‌توانید واترمارک‌های یافت شده را حذف کنید یا ویژگی‌های آن‌ها را ویرایش کنید، مانند تغییر اندازه یا متن.",
      "step_2": "برای اصلاح فهرست واترمارک های احتمالی، از شیء {{TextSearchCriteriaBold}} استفاده کنید. به عنوان مثال، یک تصویر برای یافتن واترمارک های مشابه ارائه دهید. در صورت یافتن واترمارک متنی، متن، فونت، رنگ و سایر گزینه های مرتبط را ارائه دهید."
    }
  },
  "more_features": {
    "title": "با {{ProdShortName}} به طور موثر جستجو و پیدا کردن واترمارک ها",
    "description": "از قدرت {{ProdShortName}} برای جستجو و یافتن واترمارک ها در هر نوع سند با استفاده از C# در {{EnvName}} استفاده کنید.",
    "image_description": "جستجوی واترمارک ها",
    "feature_1": {
      "title": "کشف واترمارک ها با جستجوی پیشرفته",
      "content": "از {{ProdShortName}} برای یافتن بدون زحمت واترمارک ها در انواع مختلف سند استفاده کنید. ابزارهای ما به شما امکان می دهد با پارامترهایی مانند محتوا، اندازه و کدورت جستجو کنید."
    },
    "feature_2": {
      "title": "یافتن واترمارک ها با پارامترهای سفارشی",
      "content": "معیارهای جستجوی خود را با {{ProdShortName}} تنظیم کنید تا واترمارک ها را بر اساس ویژگی های خاص پیدا کنید و اطمینان حاصل کنید که می توانید آنها را به طور موثر مدیریت و بررسی کنید."
    },
    "feature_3": {
      "title": "بازیابی و مدیریت واترمارک ها به طور موثر",
      "content": "با بازیابی سریع همه واترمارک ها در یک سند، روند مدیریت اسناد خود را ساده کنید. API ما امکان شناسایی و تجزیه و تحلیل سریع واترمارک ها را فراهم می کند."
    },
    "code_1": {
      "title": "مثال C #: جستجو برای واترمارک ها",
      "content": "این مثال C# نشان می دهد که چگونه واترمارک ها را در هر سند با استفاده از {{ProdShortName}} جستجو کنید و نحوه استفاده از پارامترها برای یافتههای دقیق را نشان میدهد.",
      "comment_1": "سند را از یک منبع محلی یا شبکه ای برای پردازش بارگیری کنید",
      "comment_2": "پارامترهای جستجوی واترمارک، مانند نوع یا دید را تعریف کنید",
      "comment_3": "بازیابی تمام واترمارک هایی که با معیارهای مشخص شده مطابقت دارند",
      "comment_4": "لیست علامت های یافت شده را مرور و مدیریت کنید تا تأثیر آنها را ارزیابی کنید"
    }
  },
  "excel": {
    "ext": "اکس‌اس‌لکس",
    "head": {
      "title": "یافتن واترمارک های گسترده {{FileformatCap}} نامرئی",
      "description": "با استفاده از {{ProdShortName}} علامت های نامرئی در اسناد را بدون زحمت کشف کنید."
    },
    "header": {
      "title": "{{FileformatCap}} علامت های صفحه گسترده را فوراً پیدا کنید",
      "description": "علامت های پنهان را بدون زحمت با {{ProdFullName}} رونمایی و مدیریت کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "دریافت اطلاعات {{ProdFullName}}",
      "content": "{{ProdFullName}} یک راه حل جامع برای مدیریت واترمارک ها با استفاده از {{EnvName}} ارائه می دهد. به راحتی واترمارک ها را از قالب های مختلف سند مانند PDF، مایکروسافت Word، Excel و موارد دیگر تولید، ویرایش، و حذف کنید. مدیریت واترمارک را به طور یکپارچه در برنامه های خود با {{ProdFullName}} ادغام کنید."
    },
    "formats": {
      "title": "کشف واترمارک ها در سراسر فرمت ها",
      "description": "بدون زحمت علامت های واترمارک را در فرمت های مختلف فایل پشتیبانی شده جستجو و شناسایی کنید."
    }
  },
  "word": {
    "ext": "داکس",
    "head": {
      "title": "علامت های پنهان را در {{FileformatCap}} اسناد پیدا کنید",
      "description": "علامت های پنهان را در اسناد بدون زحمت با {{ProdShortName}} پیدا کنید."
    },
    "header": {
      "title": "بدون زحمت، علامت های پنهان را در {{FileformatCap}} اسناد پیدا کنید",
      "description": "به سرعت علامت های پنهان را با {{ProdFullName}} شناسایی و مدیریت کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "{{PackageStoreName}} بسته به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}} اطلاعات",
      "content": "{{ProdFullName}} یک راه حل جامع برای مدیریت واترمارک ها با استفاده از {{EnvName}} ارائه می دهد. به راحتی واترمارک ها را از انواع قالب های سند از جمله PDF، Microsoft Word، Excel و موارد دیگر تولید، ویرایش، و حذف کنید. با استفاده از {{ProdFullName}} واترمارک ها را با برنامه های خود پیدا کنید."
    },
    "formats": {
      "title": "واترمارک ها را در فرمت های پشتیبانی شده کشف کنید",
      "description": "به سرعت واترمارک ها را در طیف گسترده ای از فرمت های فایل پشتیبانی شده پیدا کرده و مدیریت کنید."
    }
  },
  "powerpoint": {
    "ext": "پی‌تی‌اکس",
    "head": {
      "title": "کشف {{FileformatCap}} ارائه علامت های پنهان",
      "description": "با {{ProdShortName}} علامت های پنهان در اسناد را بدون زحمت کشف کنید."
    },
    "header": {
      "title": "علامت های پنهان {{FileformatCap}} ارائه را بدون زحمت کشف کنید",
      "description": "به سرعت علامت های پنهان را با {{ProdFullName}} آشکار و مدیریت کنید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} یک راه حل قوی برای مدیریت واترمارک ها با استفاده از {{EnvName}} ارائه می دهد. به راحتی واترمارک ها را از قالب های مختلف سند مانند PDF، مایکروسافت Word، Excel و موارد دیگر تولید، ویرایش، و حذف کنید. جستجوی واترمارک را با {{ProdFullName}} در برنامه های خود ادغام کنید."
    },
    "formats": {
      "title": "کشف واترمارک ها در فرمت های متعدد",
      "description": "علامت های آب را در چندین فرمت فایل پشتیبانی شده بدون زحمت شناسایی و مدیریت کنید."
    }
  }
}