{
  "examples": {
    "comment_1": "รับรายการลายน้ำข้อความสำหรับ {{FileFormatUp}}",
    "comment_2": "คลาสเครื่องหมายน้ำ Instantiate",
    "comment_3": "รับลายน้ำตามเกณฑ์ข้อความ",
    "comment_4": "ใช้ข้อมูลลายน้ำ"
  },
  "steps": {
    "title": "รับลายน้ำในไฟล์ {{FileformatCap}} ได้อย่างมีประสิทธิภาพโดย {{ProdShortName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** ช่วยเพิ่มประสิทธิภาพในการดึงลายน้ำที่ฝังอยู่ในรูปแบบเอกสารธุรกิจต่างๆรวม {{ProdShortName}} เข้ากับแอปพลิเคชัน {{EnvName}} ของคุณได้อย่างราบรื่นเพื่อเพิ่มประสิทธิภาพให้กับพวกเขาด้วยความสามารถในการตรวจจับลายน้ำที่แข็งแกร่ง",
      "step_1": "**Watermarker** และให้เส้นทางไฟล์ {{FileformatCap}} สตรีมไฟล์ หรือไบต์สตรีมเป็นอินพุตการกระทำนี้โหลดเอกสารสำหรับการวิเคราะห์ลายน้ำ",
      "step_2": "**SearchCriteria**ระบุภาพสำหรับการค้นหาลายน้ำภาพที่คล้ายกันหรือสำหรับลายน้ำที่เป็นข้อความ ให้กำหนดเนื้อหาข้อความ คุณสมบัติตัวอักษร แอตทริบิวต์สี และพารามิเตอร์ที่เกี่ยวข้องอื่น ๆ เพื่อปรับแต่งเกณฑ์การค้นหา",
      "step_3": "**Get** ของวัตถุ **Watermarker** เพื่อเริ่มกระบวนการตรวจจับลายน้ำภายในเอกสารที่โหลดฟังก์ชันนี้จะส่งคืนคอลเลกชันของวัตถุที่เป็นตัวแทนของลายน้ำที่อาจเกิดขึ้นทำให้สามารถประมวลผลต่อไป",
      "step_4": "คอลเลกชันของวัตถุลายน้ำที่ดึงมาช่วยให้คุณมีความเป็นไปได้มากมายคุณสามารถลบลายน้ำที่ไม่ต้องการหรือแก้ไขคุณสมบัติเปลี่ยนเนื้อหา ย้ายลายน้ำบนหน้าและอื่น ๆ อีกมากมาย"
    }
  },
  "more_features": {
    "title": "ปรับปรุงการค้นหาลายน้ำของคุณด้วย {{ProdShortName}} ใน Node.js",
    "description": "เรียนรู้การใช้ฟังก์ชันการค้นหาลายน้ำขั้นสูงในแอปพลิเคชัน Node.js ของคุณด้วย {{ProdShortName}} เพิ่มประสิทธิภาพการจัดการเอกสารภายใน {{EnvName}}",
    "image_description": "ค้นหาลายน้ำใน Node.js",
    "feature_1": {
      "title": "การตรวจจับลายน้ำขั้นสูงใน Node.js",
      "content": "ใช้ {{ProdShortName}} เพื่อเพิ่มความสามารถในการตรวจจับและระบุลายน้ำในรูปแบบเอกสารใด ๆค้นหาอย่างมีประสิทธิภาพโดยใช้ตัวเลือกการกรองที่ซับซ้อน"
    },
    "feature_2": {
      "title": "Node.js API สำหรับการค้นหาลายน้ำที่กำหนดเอง",
      "content": "ปรับแต่งการดำเนินการค้นหาของคุณด้วย Node.js API ของเราค้นหาลายน้ำโดยระบุพารามิเตอร์โดยละเอียด เช่น ตำแหน่ง ความทึบแสง และประเภทเนื้อหา เพื่อเพิ่มประสิทธิภาพเวิร์กโฟลว์เอกสารของคุณ"
    },
    "feature_3": {
      "title": "การดึงข้อมูลและการวิเคราะห์ลายน้ำที่มีประสิทธิภาพ",
      "content": "ด้วย {{ProdShortName}} แยกและวิเคราะห์ลายน้ำจากเอกสารต่าง ๆ ได้อย่างรวดเร็วAPI ของเรารองรับการดึงข้อมูลอย่างรวดเร็ว ช่วยให้คุณรักษาความสอดคล้องและความสม่ำเสมอของแบรนด์"
    },
    "code_1": {
      "title": "ตัวอย่าง Node.js: การค้นหาลายน้ำที่มีประสิทธิภาพ",
      "content": "สำรวจวิธีใช้ Node.js กับ {{ProdShortName}} เพื่อค้นหาลายน้ำในเอกสารประเภทต่างๆ แสดงให้เห็นถึงการใช้เกณฑ์การค้นหาแบบไดนามิกสำหรับผลลัพธ์ที่แม่นยำ",
      "comment_1": "เริ่มต้นสภาพแวดล้อม Node.js และโหลดเอกสารเป้าหมาย",
      "comment_2": "ตั้งค่าแบบสอบถามการค้นหาโดยใช้เกณฑ์ที่ยืดหยุ่นเพื่อค้นหาลายน้ำเฉพาะ",
      "comment_3": "ดำเนินการค้นหาและรวบรวมลายน้ำที่ตรงตามเกณฑ์",
      "comment_4": "ประมวลผลและวิเคราะห์ผลลัพธ์เพื่อกำหนดการกระทำที่จำเป็น"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "ปลดล็อก {{FileformatCap}} สเปรดชีตความลับลายน้ำ",
      "description": "ค้นพบพลังของ {{ProdFullName}} เพื่อดึงลายน้ำจากเอกสารได้อย่างง่ายดาย"
    },
    "header": {
      "title": "เปิดเผยลายน้ำที่ซ่อนอยู่ใน {{FileformatCap}} สเปรดชีต",
      "description": "ค้นพบลายน้ำที่ซ่อนอยู่ในเอกสารของคุณด้วย {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "รับจาก {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} ข้อมูลพื้นฐาน",
      "content": "ปลดล็อกศักยภาพของ {{ProdFullName}} ในการจัดการลายน้ำใน {{EnvName}}สร้าง อัปเดต รับ และลบลายน้ำจากรูปแบบไฟล์ต่างๆ ได้อย่างง่ายดาย รวมถึง PDF, Word, Excel, PowerPoint และอื่นๆ"
    },
    "formats": {
      "title": "สำรวจหลายรูปแบบ",
      "description": "ค้นพบ ดึงข้อมูล และจัดการลายน้ำในรูปแบบไฟล์ที่แตกต่างกันได้อย่างง่ายดาย"
    }
  },
  "word": {
    "ext": "ด็อกซ์",
    "head": {
      "title": "การสกัดลายน้ำหลักจากเอกสาร {{FileformatCap}}",
      "description": "เป็นมืออาชีพในการแยกลายน้ำจากเอกสารโดยใช้ {{ProdShortName}}"
    },
    "header": {
      "title": "ผู้เชี่ยวชาญ {{FileformatCap}} การดึงลายน้ำเอกสาร",
      "description": "เพิ่มพลังให้กับตัวเองด้วยความเชี่ยวชาญในการดึงลายน้ำโดยใช้ {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดแพ็คเกจ {{PackageStoreName}}"
    },
    "about": {
      "title": "ประมาณ {{ProdFullName}}",
      "content": "ฝึกฝนศิลปะการจัดการลายน้ำด้วย {{ProdFullName}}จัดการงานลายน้ำได้อย่างง่ายดายในรูปแบบไฟล์หลายรูปแบบรวมถึง PDF, Word, Excel และอื่น ๆ"
    },
    "formats": {
      "title": "การจัดการรูปแบบไฟล์ที่มีประสิทธิภาพ",
      "description": "จัดการลายน้ำในรูปแบบไฟล์ต่าง ๆ ได้อย่างมีประสิทธิภาพด้วย {{ProdFullName}}"
    }
  },
  "powerpoint": {
    "ext": "พีพีทีเอ็กซ์",
    "head": {
      "title": "ค้นพบ {{FileformatCap}} งานนำเสนอ ลายน้ำที่ซ่อนอยู่",
      "description": "เปิดเผยลายน้ำที่ซ่อนอยู่ภายในเอกสารโดยใช้ {{ProdShortName}}"
    },
    "header": {
      "title": "เปิดตัวลายน้ำที่วางไว้ในงานนำเสนอ {{FileformatCap}}",
      "description": "ค้นพบและเปิดเผยลายน้ำที่ซ่อนอยู่ในเอกสารของคุณด้วย {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "เรียนรู้เพิ่มเติมเกี่ยวกับ {{ProdFullName}}",
      "content": "สำรวจความสามารถของ {{ProdFullName}} ในการจัดการลายน้ำได้อย่างราบรื่นใน {{EnvName}}จัดการการดำเนินการลายน้ำได้อย่างง่ายดาย เช่น สร้าง อัปเดต รับ และลบในรูปแบบไฟล์ต่างๆ"
    },
    "formats": {
      "title": "ค้นพบลายน้ำในรูปแบบ",
      "description": "ค้นพบลายน้ำในรูปแบบไฟล์ที่แตกต่างกันได้อย่างง่ายดายด้วย {{ProdFullName}}"
    }
  }
}