{
  "examples": {
    "comment_1": "ค้นหาลายน้ำข้อความในเอกสาร {{FileFormatUp}}",
    "comment_2": "รับอินสแตนซ์ {{TextWatermarker}} สำหรับเอกสาร {{FileFormatUp}}",
    "comment_3": "ค้นหาลายน้ำตามเกณฑ์",
    "comment_4": "ประมวลผลลายน้ำ"
  },
  "steps": {
    "title": "ค้นหาลายน้ำในไฟล์ {{FileformatCap}} โดยใช้ {{EnvName}}",
    "content": {
      "title": "**[{{ProdShortName}}]({{ProductUrl}})** ทำให้การค้นหาลายน้ำที่อยู่ในเอกสารทางธุรกิจเป็นเรื่องง่าย ดาวน์โหลดแพ็คเกจของเราและนำไปใช้กับใบสมัคร {{EnvName}} ของคุณเพื่อใช้ประโยชน์จากสิทธิประโยชน์ต่างๆ",
      "step_1": "ในการใช้คุณลักษณะไลบรารีของเรา คุณต้องโหลดไฟล์ {{FileformatCap}} ไปยังอินสแตนซ์คลาส {{TextWatermarkerBold}} เป็นไปได้ที่จะระบุเพียงเส้นทางของไฟล์ สตรีมไฟล์ หรือสตรีมไบต์",
      "step_2": "หากต้องการจำกัดรายการลายน้ำที่เป็นไปได้ให้แคบลง ให้ใช้วัตถุ {{TextSearchCriteriaBold}} ให้รูปภาพเป็นตัวอย่างเพื่อให้ได้ลายน้ำของรูปภาพที่คล้ายกัน หากคุณต้องการค้นหาลายน้ำข้อความ ให้ระบุข้อความ แบบอักษร สี และตัวเลือกอื่นๆ",
      "step_3": "หากต้องการใส่ลายน้ำในเอกสารให้ใช้วิธีการ {{TextSearchBold}} ของออบเจ็กต์ {{TextWatermarkerBold}} คุณจะได้รับคอลเลกชั่นวัตถุที่อาจนำไปประมวลผลเป็นลายน้ำได้",
      "step_4": "ในที่สุด คุณมีอิสระที่จะทำผลการค้นหาตามที่คุณต้องการ เป็นไปได้อย่างยิ่งที่จะลบลายน้ำที่พบหรือแก้ไขคุณสมบัติ เปลี่ยนขนาดหรือข้อความ เป็นต้น"
    }
  },
  "more_features": {
    "title": "สายรัด Java สำหรับการค้นหาลายน้ำขั้นสูงด้วย {{ProdShortName}}",
    "description": "ใช้ {{ProdShortName}} Java API เพื่อทำการค้นหาลายน้ำอย่างซับซ้อนในเอกสารในรูปแบบที่หลากหลายใน {{EnvName}}",
    "image_description": "การค้นหาลายน้ำขั้นสูง",
    "feature_1": {
      "title": "Java - เทคนิคการค้นหาลายน้ำที่ได้รับการปรับปรุง",
      "content": "เพิ่มพลังให้กับแอปพลิเคชัน Java ของคุณด้วยเทคนิคการค้นหาขั้นสูงโดยใช้ {{ProdShortName}} API ของเราช่วยให้สามารถค้นหาลายน้ำฝังตัวในรูปแบบเอกสารต่างๆ ได้อย่างลึกซึ้ง ให้ความแม่นยำและมีประสิทธิภาพ"
    },
    "feature_2": {
      "title": "ระบุลายน้ำด้วยแบบสอบถาม Java แบบกำหนดเอง",
      "content": "ปรับแต่งแบบสอบถาม Java ของคุณเพื่อตรวจจับลายน้ำได้อย่างมีประสิทธิภาพมากขึ้นใช้ {{ProdShortName}} เพื่อจัดเรียงและกรองลายน้ำตามคุณสมบัติ เช่น ความโปร่งใส วิธีการฝัง และเนื้อหาข้อความหรือรูปภาพ"
    },
    "feature_3": {
      "title": "การจัดการลายน้ำเอกสารอย่างมีประสิทธิภาพ",
      "content": "ปรับปรุงการจัดการลายน้ำในแอปพลิเคชัน Java ของคุณด้วย {{ProdShortName}} สามารถค้นหา ตรวจสอบ และวิเคราะห์ลายน้ำได้อย่างรวดเร็วเพื่อให้แน่ใจว่าเอกสารมีความสมบูรณ์และสอดคล้องกับแนวทางในการสร้างแบรนด์"
    },
    "code_1": {
      "title": "Java ตัวอย่างรหัส: การค้นหาลายน้ำอัจฉริยะ",
      "content": "เรียนรู้วิธีใช้การค้นหาลายน้ำอัจฉริยะโดยใช้ Java กับ {{ProdShortName}} แสดงให้เห็นถึงความสามารถของ API ในการจัดการการดำเนินการค้นหาที่ซับซ้อนและการจัดการผลลัพธ์",
      "comment_1": "ตั้งค่าสภาพแวดล้อม Java และโหลดเอกสารจากแหล่งต่างๆ",
      "comment_2": "กำหนดพารามิเตอร์การค้นหาขั้นสูงเพื่อค้นหาลายน้ำประเภทเฉพาะ",
      "comment_3": "ดำเนินการค้นหาและประมวลผลลายน้ำที่พบเพื่อตรวจสอบโดยละเอียด",
      "comment_4": "บันทึกหรืออัปเดตเอกสารตามผลการค้นหาลายน้ำ"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "สำรวจ {{FileformatCap}} สเปรดชีตลายน้ำ ค้นหา",
      "description": "ค้นพบวิธีที่ {{ProdFullName}} ช่วยให้คุณค้นหา ค้นหา และจัดการลายน้ำในรูปแบบเอกสารต่างๆ ได้อย่างง่ายดาย"
    },
    "header": {
      "title": "เปิดตัวความสามารถในการค้นหาลายน้ำ {{FileformatCap}} สเปรดชีต",
      "description": "เจาะลึกพลังของ {{ProdFullName}} เพื่อค้นหา แก้ไข และจัดการลายน้ำได้อย่างง่ายดาย",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "ข้อมูลพื้นฐาน {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็นโซลูชันที่ครอบคลุมสำหรับการจัดการลายน้ำ {{FileformatCap}} โดยใช้ {{EnvName}} ด้วยเครื่องมือนี้นักพัฒนาสามารถดำเนินการได้อย่างง่ายดาย เช่น สร้าง แก้ไข ค้นหา และลบลายน้ำออกจากเอกสารในรูปแบบไฟล์ยอดนิยมรองรับการทำงานกับลายน้ำทั้งข้อความและรูปภาพในเอกสารที่หลากหลาย รวมถึง PDF, Microsoft Word, Excel, PowerPoint, Visio, อีเมลและรูปภาพ {{ProdFullName}} รองรับระบบปฏิบัติการที่สำคัญทั้งหมดและ {{EnvName}} เวอร์ชัน"
    },
    "formats": {
      "title": "ปลดล็อกพลังของการค้นหาลายน้ำ",
      "description": "เพิ่มพลังให้กับตัวเองในการค้นหาและจัดการลายน้ำในรูปแบบไฟล์ที่รองรับต่างๆด้วย {{ProdFullName}}"
    }
  },
  "word": {
    "ext": "ด็อกซ์",
    "head": {
      "title": "พลังของ {{FileformatCap}} เอกสาร ค้นหาลายน้ำ",
      "description": "สัมผัสความสามารถที่ไม่มีใครเทียบได้ในการค้นหาและจัดการลายน้ำในประเภทเอกสารที่หลากหลายด้วย {{ProdFullName}}"
    },
    "header": {
      "title": "ค้นพบ การค้นหาลายน้ำ {{FileformatCap}} ขั้นสูง",
      "description": "เริ่มต้นการเดินทางเพื่อสำรวจฟีเจอร์การค้นหาลายน้ำที่ล้ำสมัยที่ {{ProdFullName}} นำเสนอ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "รับจาก {{PackageStoreName}}"
    },
    "about": {
      "title": "ประมาณ {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็นโซลูชันที่แข็งแกร่งสำหรับการจัดการลายน้ำโดยใช้ {{EnvName}} นักพัฒนาสามารถสร้าง แก้ไข ค้นหา และลบลายน้ำออกจากเอกสารในรูปแบบไฟล์ยอดนิยมได้อย่างง่ายดายรองรับทั้งลายน้ำข้อความและรูปภาพในเอกสารประเภทต่างๆ รวมถึง PDF, Microsoft Word, Excel, PowerPoint, Visio, อีเมลและรูปแบบภาพ {{ProdFullName}} รวมเข้ากับระบบปฏิบัติการที่สำคัญทั้งหมดและ {{EnvName}} ได้อย่างราบรื่น"
    },
    "formats": {
      "title": "การค้นหาลายน้ำต้นแบบในรูปแบบ",
      "description": "ปลดล็อกศักยภาพของ {{ProdFullName}} ในการค้นหาและจัดการลายน้ำในรูปแบบไฟล์ที่รองรับต่างๆ"
    }
  },
  "powerpoint": {
    "ext": "พีพีทีเอ็กซ์",
    "head": {
      "title": "ค้นหา {{FileformatCap}} ลายน้ำงานนำเสนอ:",
      "description": "ปรับปรุงกลยุทธ์การจัดการลายน้ำของคุณด้วยความสามารถในการค้นหาขั้นสูง {{ProdFullName}} ในรูปแบบเอกสารต่างๆ"
    },
    "header": {
      "title": "ยกระดับเวิร์กโฟลว์ของคุณด้วยการค้นหาลายน้ำ {{FileformatCap}} งานนำเสนอ",
      "description": "เพิ่มประสิทธิภาพการทำงานของคุณด้วยการใช้ประโยชน์จากฟังก์ชันการค้นหาลายน้ำที่ล้ำสมัย {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดแพ็คเกจ {{PackageStoreName}}"
    },
    "about": {
      "title": "เรียนรู้เพิ่มเติมเกี่ยวกับ {{ProdFullName}}",
      "content": "{{ProdFullName}} นำเสนอโซลูชันที่ครอบคลุมสำหรับการจัดการลายน้ำโดยใช้ {{EnvName}} นักพัฒนาสามารถสร้าง แก้ไข ค้นหา และลบลายน้ำออกจากเอกสารในรูปแบบไฟล์ต่างๆ ได้อย่างราบรื่นรองรับลายน้ำข้อความและรูปภาพในประเภทเอกสารที่หลากหลาย รวมถึง PDF, Microsoft Word, Excel, PowerPoint, Visio, อีเมลและรูปแบบภาพ {{ProdFullName}} เข้ากันได้กับระบบปฏิบัติการที่สำคัญทั้งหมดและ {{EnvName}} เวอร์ชัน"
    },
    "formats": {
      "title": "เปลี่ยนเวิร์กโฟลว์ของคุณด้วยการค้นหาลายน้ำ",
      "description": "สัมผัสประสิทธิภาพที่ไม่มีใครเทียบได้ในการจัดการลายน้ำในรูปแบบไฟล์ที่แตกต่างกันด้วย {{ProdFullName}}"
    }
  }
}