{
  "examples": {
    "comment_1": "Знайти текстовий водяний знак у {{FileFormatUp}}",
    "comment_2": "Створіть {{TextWatermarker}} із шляхом {{FileFormatUp}}",
    "comment_3": "Знайдіть водяні знаки",
    "comment_4": "Використовуйте інформацію про знайдені водяні знаки"
  },
  "steps": {
    "title": "Знайдіть водяні знаки у файлах {{FileformatCap}} за допомогою {{EnvName}}",
    "content": {
      "title": "**[{{ProdShortName}}]({{ProductUrl}})** спрощує процес пошуку водяних знаків у бізнес-документах. Інтегруйте наш пакет у свої програми {{EnvName}}, щоб розкрити його переваги.",
      "step_1": "Щоб скористатися функціями нашої бібліотеки, завантажте файл {{FileformatCap}} в екземпляр класу {{TextWatermarkerBold}}. Ви можете вказати шлях до файлу, потік файлів або потік байтів.",
      "step_2": "Щоб уточнити список потенційних водяних знаків, використовуйте об’єкт {{TextSearchCriteriaBold}}. Наприклад, надайте зображення, щоб знайти схожі водяні знаки. Якщо знайшли текстові водяні знаки, укажіть текст, шрифт, колір та інші відповідні параметри.",
      "step_3": "Використовуйте метод {{TextSearchBold}} об’єкта {{TextWatermarkerBold}}, щоб отримати водяні знаки, розміщені в документі. Ви отримаєте колекцію об’єктів, які представляють потенційні водяні знаки для подальшої обробки.",
      "step_4": "Нарешті, у вас є можливість маніпулювати результатами пошуку за потреби. Ви можете видалити знайдені водяні знаки або змінити їх властивості, наприклад змінити розмір або текст."
    }
  },
  "more_features": {
    "title": "Ефективний пошук і пошук водяних знаків за допомогою {{ProdShortName}}",
    "description": "Використовуйте можливості {{ProdShortName}} для пошуку та пошуку водяних знаків у будь-якому типі документа за допомогою C# у межах {{EnvName}}.",
    "image_description": "Пошук водяних знаків",
    "feature_1": {
      "title": "Відкрийте для себе водяні знаки за допомогою розширеного пошуку",
      "content": "Використовуйте {{ProdShortName}}, щоб легко знаходити водяні знаки для різних типів документів. Наші інструменти дозволяють шукати за такими параметрами, як вміст, розмір та непрозорість."
    },
    "feature_2": {
      "title": "Знайдіть водяні знаки за користувальницькими параметрами",
      "content": "Налаштуйте свої критерії пошуку за допомогою {{ProdShortName}}, щоб знайти водяні знаки на основі конкретних властивостей, гарантуючи, що ви можете ефективно керувати ними та переглядати їх."
    },
    "feature_3": {
      "title": "Ефективне отримання та керування водяними знаками",
      "content": "Оптимізуйте процес керування документами, швидко отримуючи всі водяні знаки в документі. Наш API дозволяє швидко ідентифікувати та аналізувати водяні знаки."
    },
    "code_1": {
      "title": "Приклад C #: Пошук водяних знаків",
      "content": "Цей приклад C# демонструє, як шукати водяні знаки в будь-якому документі за допомогою {{ProdShortName}}, ілюструючи, як використовувати параметри для точних результатів.",
      "comment_1": "Завантаження документа з локального або мережевого джерела для обробки",
      "comment_2": "Визначте параметри для пошуку водяних знаків, такі як тип або видимість",
      "comment_3": "Отримати всі водяні знаки, які відповідають вказаним критеріям",
      "comment_4": "Перегляньте список знайдених водяних знаків та керуйте ним, щоб оцінити їх вплив"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "Знайти невидимі {{FileformatCap}} водяні знаки для електронних таблиць",
      "description": "Легко розкривайте невидимі водяні знаки в документах за допомогою {{ProdShortName}}."
    },
    "header": {
      "title": "Знайдіть {{FileformatCap}} водяні знаки електронних таблиць миттєво",
      "description": "Відкривайте та керуйте прихованими водяними знаками без зусиль за допомогою {{ProdFullName}}.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Безкоштовно {{PackageStoreName}} Завантажити"
    },
    "about": {
      "title": "Отримати інформацію {{ProdFullName}}",
      "content": "{{ProdFullName}} надає комплексне рішення для керування водяними знаками за допомогою {{EnvName}}. Легко генеруйте, редагуйте, знаходьте та видаляйте водяні знаки з різних форматів документів, таких як PDF, Microsoft Word, Excel тощо. Плавно інтегруйте керування водяними знаками у свої програми за допомогою {{ProdFullName}}."
    },
    "formats": {
      "title": "Розкрийте водяні знаки у різних форматах",
      "description": "Легко шукайте та ідентифікуйте водяні знаки в різних підтримуваних форматах файлів."
    }
  },
  "word": {
    "ext": "докс",
    "head": {
      "title": "Знайдіть приховані водяні знаки в документах {{FileformatCap}}",
      "description": "Знайдіть приховані водяні знаки в документах без особливих зусиль за допомогою {{ProdShortName}}."
    },
    "header": {
      "title": "Легко знаходьте приховані водяні знаки в документах {{FileformatCap}}",
      "description": "Швидко ідентифікуйте та керуйте прихованими водяними знаками за допомогою {{ProdFullName}}.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "{{PackageStoreName}} пакет безкоштовно"
    },
    "about": {
      "title": "{{ProdFullName}} Інформація",
      "content": "{{ProdFullName}} пропонує комплексне рішення для керування водяними знаками за допомогою {{EnvName}}. Легко створюйте, редагуйте, знаходьте та видаляйте водяні знаки з різних форматів документів, включаючи PDF, Microsoft Word, Excel тощо. Знайдіть водяні знаки зі своїми програмами за допомогою {{ProdFullName}}."
    },
    "formats": {
      "title": "Відкрийте для себе водяні знаки у підтримуваних форматах",
      "description": "Швидко знаходьте та керуйте водяними знаками у широкому діапазоні підтримуваних форматів файлів."
    }
  },
  "powerpoint": {
    "ext": "ППТХ",
    "head": {
      "title": "Розкрийте {{FileformatCap}} презентації Приховані водяні знаки",
      "description": "Розкривайте приховані водяні знаки в документах без особливих зусиль за допомогою {{ProdShortName}}."
    },
    "header": {
      "title": "Легко розкрийте {{FileformatCap}} презентацій Приховані водяні знаки",
      "description": "Швидко розкривайте та керуйте прихованими водяними знаками за допомогою {{ProdFullName}}.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Скачати на {{PackageStoreName}} безкоштовно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} пропонує надійне рішення для керування водяними знаками за допомогою {{EnvName}}. Легко генеруйте, редагуйте, знаходьте та видаляйте водяні знаки з різних форматів документів, таких як PDF, Microsoft Word, Excel тощо. Інтегруйте пошук водяних знаків у свої програми за допомогою {{ProdFullName}}."
    },
    "formats": {
      "title": "Розкрийте водяні знаки в декількох форматах",
      "description": "Легко визначте і керуйте водяними знаками в декількох підтримуваних форматах файлів."
    }
  }
}