{
  "examples": {
    "comment_1": "รับลายน้ำรูปภาพวางไว้ใน {{FileFormatUp}}",
    "comment_2": "สร้างออบเจ็กต์ {{TextWatermarker}} ด้วยเส้นทางต้นทาง",
    "comment_3": "รับลายน้ำด้วยแฮชรูปภาพที่คล้ายกัน",
    "comment_4": "ประมวลผลลายน้ำตามที่คุณต้องการ"
  },
  "steps": {
    "title": "รับลายน้ำจากไฟล์ {{FileformatCap}} โดยใช้ {{ProdShortName}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** นำเสนอโซลูชั่นที่ครอบคลุมสำหรับการใส่ลายน้ำในรูปแบบเอกสารทางธุรกิจยอดนิยม ด้วยการรวมไลบรารีของเราเข้ากับแอปพลิเคชัน {{EnvName}} ของคุณ คุณสามารถจัดเตรียมความสามารถในการค้นหาลายน้ำอันทรงพลังให้กับพวกเขาได้",
      "step_1": "หากต้องการเข้าถึงฟังก์ชันการทำงานที่ {{ProdShortName}} ให้ไว้ ให้สร้างอินสแตนซ์คลาส {{TextWatermarkerBold}} และระบุเส้นทางไฟล์ {{FileformatCap}} นอกจากนี้คุณยังสามารถใช้ไฟล์ที่บันทึกเป็นสตรีมไบต์ได้ การดำเนินการนี้จะโหลดเอกสารเป้าหมายเพื่อการวิเคราะห์ลายน้ำที่ครอบคลุม",
      "step_2": "เพื่อให้บรรลุการระบุลายน้ำเป้าหมาย ให้สร้างออบเจ็กต์ {{TextSearchCriteriaBold}} คุณสามารถระบุรูปภาพเพื่อค้นหาลายน้ำรูปภาพที่คล้ายกันได้ สำหรับลายน้ำข้อความ ให้กำหนดเนื้อหาข้อความ คุณสมบัติแบบอักษร คุณลักษณะสี และพารามิเตอร์อื่นๆ ที่เกี่ยวข้อง เพื่อปรับแต่งเกณฑ์การค้นหาและให้ผลลัพธ์ที่แม่นยำยิ่งขึ้น",
      "step_3": "เรียกใช้เมธอด {{TextSearchBold}} (หรือรูปแบบการตั้งชื่อที่คล้ายกัน) ของออบเจ็กต์ {{TextWatermarkerBold}} เพื่อเริ่มกระบวนการรับลายน้ำภายในเอกสารที่โหลด ฟังก์ชันนี้จะส่งคืนคอลเลกชันของออบเจ็กต์ที่แสดงลายน้ำที่อาจเกิดขึ้น ซึ่งช่วยอำนวยความสะดวกในการประมวลผลเพิ่มเติมตามความต้องการเฉพาะของคุณ",
      "step_4": "การรวบรวมลายน้ำผลลัพธ์ช่วยให้คุณสามารถควบคุมลายน้ำที่ระบุในเอกสารได้ คุณสามารถลบลายน้ำที่ไม่ต้องการออกหรือปรับเปลี่ยนคุณสมบัติแบบไดนามิกได้ เช่น การปรับขนาด ตำแหน่ง หรือเนื้อหาข้อความ เพื่อให้เหมาะกับความต้องการของคุณ"
    }
  },
  "more_features": {
    "title": "ใช้ประโยชน์จาก Node.js สำหรับการค้นหาลายน้ำด้วย {{ProdShortName}}",
    "description": "ใช้ฟังก์ชันการค้นหาลายน้ำแบบไดนามิกและมีประสิทธิภาพในแอปพลิเคชัน Node.js ของคุณโดยใช้ {{ProdShortName}} ภายในแพลตฟอร์ม {{EnvName}}",
    "image_description": "ค้นหาลายน้ำ Node.js",
    "feature_1": {
      "title": "Node.js API สำหรับการค้นหาลายน้ำที่ยืดหยุ่น",
      "content": "ใช้ประโยชน์จากความยืดหยุ่นของ Node.js ด้วย {{ProdShortName}} เพื่อค้นหาลายน้ำในรูปแบบเอกสารหลายรูปแบบกำหนดค่าการค้นหาให้ตรงกับข้อกำหนดเฉพาะ เช่น ขนาด ประเภท หรือเนื้อหาได้อย่างง่ายดาย"
    },
    "feature_2": {
      "title": "การระบุลายน้ำที่ได้รับการปรับปรุงด้วย Node.js",
      "content": "ปรับปรุงการประมวลผลเอกสารของคุณโดยการระบุลายน้ำอย่างถูกต้องโดยใช้ Node.jsใช้ API ของ {{ProdShortName}} เพื่อตรวจจับลายน้ำแม้ภายในโครงสร้างเอกสารที่ซับซ้อน"
    },
    "feature_3": {
      "title": "โซลูชันการค้นหาลายน้ำที่ปรับขนาดได้",
      "content": "ปรับขนาดโซลูชันความปลอดภัยเอกสารของคุณด้วย Node.js {{ProdShortName}} ช่วยให้สามารถประมวลผลชุดเอกสารขนาดใหญ่ได้อย่างมีประสิทธิภาพ ทำให้เหมาะสำหรับการใช้งานระดับองค์กร"
    },
    "code_1": {
      "title": "Node.js ตัวอย่าง: ค้นหาและดึงลายน้ำ",
      "content": "ตัวอย่าง Node.js นี้แสดงวิธีการใช้ {{ProdShortName}} สำหรับการค้นหาและดึงลายน้ำ แสดงให้เห็นถึงการดำเนินการค้นหาที่มีประสิทธิภาพและปรับขนาดได้",
      "comment_1": "ตั้งค่าสภาพแวดล้อม Node.js และโหลดเอกสารที่จำเป็น",
      "comment_2": "กำหนดค่าการค้นหาของคุณเพื่อระบุลายน้ำตามเกณฑ์ที่หลากหลาย",
      "comment_3": "ดำเนินการค้นหาลายน้ำและรวบรวมข้อมูลเกี่ยวกับลายน้ำที่ระบุ",
      "comment_4": "ประมวลผลลัพธ์เพื่อแก้ไขหรือลบลายน้ำตามความต้องการทางธุรกิจ"
    }
  },
  "doc": {
    "head": {
      "title": "ดึงเอกสารลายน้ำ {{FileFormatUp}} ได้อย่างง่ายดาย",
      "description": "ดึงลายน้ำจากเอกสารได้อย่างง่ายดายด้วย {{ProdShortName}}"
    },
    "header": {
      "title": "รับลายน้ำจากเอกสาร {{FileFormatUp}}",
      "description": "ดึงลายน้ำได้อย่างง่ายดายโดยใช้ {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "เรียนรู้เพิ่มเติมเกี่ยวกับ {{ProdFullName}}",
      "content": "จัดการลายน้ำใน {{EnvName}} ได้อย่างง่ายดายด้วยความสามารถอันทรงพลังของ {{ProdFullName}} ลดความซับซ้อนในการดำเนินการลายน้ำ เช่น สร้าง อัปเดต รับ และลบในรูปแบบไฟล์ต่างๆ"
    },
    "formats": {
      "title": "ลดความซับซ้อนในการดึงลายน้ำ",
      "description": "ลดความซับซ้อนในการดึงลายน้ำในรูปแบบไฟล์ที่แตกต่างกันด้วย {{ProdFullName}}"
    }
  },
  "docx": {
    "head": {
      "title": "แยกลายน้ำจากเอกสาร {{FileFormatUp}} ได้อย่างง่ายดาย",
      "description": "แยกลายน้ำจากเอกสารของคุณได้อย่างง่ายดายโดยใช้ {{ProdShortName}}"
    },
    "header": {
      "title": "เข้าถึงลายน้ำในไฟล์ {{FileFormatUp}}",
      "description": "ดึงลายน้ำจากเอกสาร {{FileFormatUp}} ของคุณได้อย่างง่ายดายด้วย {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดฟรีที่ {{PackageStoreName}}"
    },
    "about": {
      "title": "ค้นพบ {{ProdFullName}}",
      "content": "จัดการลายน้ำในสภาพแวดล้อม {{EnvName}} ของคุณได้อย่างง่ายดาย {{ProdFullName}} ช่วยให้คุณดำเนินการลายน้ำได้หลากหลาย เช่น สร้าง อัปเดต ดึงข้อมูล และลบลายน้ำในรูปแบบไฟล์ที่หลากหลาย"
    },
    "formats": {
      "title": "คล่องตัวการสกัดลายน้ำ",
      "description": "ลดความซับซ้อนของกระบวนการแยกลายน้ำจากรูปแบบไฟล์ที่แตกต่างกันโดยใช้ {{ProdFullName}}"
    }
  },
  "pdf": {
    "head": {
      "title": "การดึงลายน้ำเอกสาร {{FileFormatUp}} อย่างมีประสิทธิภาพ",
      "description": "ดึงลายน้ำจากเอกสารอย่างมีประสิทธิภาพด้วย {{ProdFullName}}"
    },
    "header": {
      "title": "การสกัดลายน้ำที่คล่องตัวจากเอกสาร {{FileFormatUp}}",
      "description": "แยกลายน้ำได้อย่างมีประสิทธิภาพโดยใช้วิธีการที่คล่องตัว {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดแพ็คเกจ {{PackageStoreName}}"
    },
    "about": {
      "title": "ข้อมูลพื้นฐาน {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็นโซลูชันที่ราบรื่นสำหรับการจัดการลายน้ำใน {{EnvName}} ลดความซับซ้อนของกระบวนการสกัดลายน้ำและการจัดการในรูปแบบไฟล์ต่างๆ"
    },
    "formats": {
      "title": "ปรับปรุงการจัดการลายน้ำให้สะดวก",
      "description": "ปรับปรุงการจัดการลายน้ำในรูปแบบไฟล์ที่แตกต่างกันด้วย {{ProdFullName}}"
    }
  },
  "ppt": {
    "head": {
      "title": "การนำเสนอ {{FileFormatUp}} การจัดการลายน้ำได้อย่างง่ายดาย",
      "description": "จัดการลายน้ำในเอกสารได้อย่างง่ายดายด้วย {{ProdFullName}}"
    },
    "header": {
      "title": "การควบคุมลายน้ำแบบง่ายสำหรับการนำเสนอ {{FileFormatUp}}",
      "description": "ควบคุมลายน้ำได้อย่างง่ายดายโดยใช้วิธีง่ายๆ {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} ข้อมูล",
      "content": "ลดความยุ่งยากในการจัดการลายน้ำด้วย {{ProdFullName}} จัดการงานลายน้ำได้อย่างราบรื่นในรูปแบบไฟล์หลายรูปแบบด้วยความพยายามเพียงเล็กน้อย"
    },
    "formats": {
      "title": "การควบคุมลายน้ำที่ไร้รอยต่อ",
      "description": "ควบคุมลายน้ำได้อย่างราบรื่นในรูปแบบไฟล์ที่แตกต่างกันด้วย {{ProdFullName}}"
    }
  },
  "pptx": {
    "head": {
      "title": "ค้นพบข้อมูลเชิงลึกเกี่ยวกับลายน้ำในงานนำเสนอ {{FileFormatUp}}",
      "description": "ค้นพบข้อมูลเชิงลึกที่มีค่าที่ซ่อนอยู่ภายในลายน้ำโดยใช้ {{ProdFullName}}"
    },
    "header": {
      "title": "ค้นพบข้อมูลเชิงลึกเกี่ยวกับลายน้ำ {{FileFormatUp}} งานนำเสนอ",
      "description": "ปลดล็อกข้อมูลเชิงลึกที่มีค่าที่ซ่อนอยู่ภายในลายน้ำโดยใช้ {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "แพ็คเกจ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "รับข้อมูล {{ProdFullName}}",
      "content": "ปลดล็อกศักยภาพของ {{ProdFullName}} ในการค้นพบข้อมูลเชิงลึกที่มีค่าที่ซ่อนอยู่ภายในลายน้ำใน {{EnvName}} แยกและวิเคราะห์ลายน้ำจากรูปแบบไฟล์ต่างๆ ได้อย่างง่ายดาย"
    },
    "formats": {
      "title": "แยกข้อมูลเชิงลึกจากลายน้ำ",
      "description": "ดึงข้อมูลเชิงลึกที่มีค่าจากลายน้ำในรูปแบบไฟล์ที่แตกต่างกันด้วย {{ProdFullName}}"
    }
  },
  "rtf": {
    "head": {
      "title": "เอกสารการสกัดลายน้ำ {{FileFormatUp}} ที่มีประสิทธิภาพ",
      "description": "แยกลายน้ำจากเอกสารอย่างมีประสิทธิภาพโดยใช้ {{ProdFullName}}"
    },
    "header": {
      "title": "การดึงลายน้ำเอกสาร {{FileFormatUp}} ที่คล่องตัว",
      "description": "ดึงลายน้ำได้อย่างง่ายดายโดยใช้แนวทางที่คล่องตัว {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดที่ {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "เรียนรู้เพิ่มเติมเกี่ยวกับ {{ProdFullName}}",
      "content": "{{ProdFullName}} นำเสนอความสามารถในการสกัดลายน้ำที่มีประสิทธิภาพสำหรับการจัดการลายน้ำใน {{EnvName}} ปรับปรุงกระบวนการดึงลายน้ำในรูปแบบไฟล์ต่างๆ"
    },
    "formats": {
      "title": "สกัดลายน้ำอย่างมีประสิทธิภาพ",
      "description": "แยกลายน้ำจากรูปแบบไฟล์ที่แตกต่างกันได้อย่างมีประสิทธิภาพด้วย {{ProdFullName}}"
    }
  },
  "xls": {
    "head": {
      "title": "รับลายน้ำจากเอกสาร {{FileFormatUp}} ได้อย่างง่ายดาย",
      "description": "รับลายน้ำจากสเปรดชีต {{FileFormatUp}} ของคุณได้อย่างรวดเร็วด้วย {{ProdShortName}}"
    },
    "header": {
      "title": "เข้าถึงและรับลายน้ำจากสเปรดชีต {{FileFormatUp}}",
      "description": "ดึงข้อมูลและรับลายน้ำในเอกสาร {{FileFormatUp}} ของคุณโดยใช้ {{ProdFullName}} ได้อย่างง่ายดาย",
      "subtitle": "{{ProdFullName}}",
      "action_title": "รับ {{ProdFullName}} ฟรีที่ {{PackageStoreName}}"
    },
    "about": {
      "title": "ปลดล็อกการจัดการลายน้ำที่มีประสิทธิภาพด้วย {{ProdFullName}}",
      "content": "ปฏิวัติการจัดการลายน้ำภายในเวิร์กโฟลว์ {{EnvName}} ของคุณ {{ProdFullName}} ช่วยให้คุณสร้าง อัปเดต ดึงข้อมูล (รับ) และลบลายน้ำในรูปแบบไฟล์ต่างๆ ได้อย่างง่ายดาย ทำให้การประมวลผลเอกสารของคุณได้อย่างง่ายดาย"
    },
    "formats": {
      "title": "รับลายน้ำได้อย่างง่ายดายจากรูปแบบไฟล์ใด ๆ",
      "description": "ลดความซับซ้อนในการดึงลายน้ำ (get) ในรูปแบบไฟล์ทั้งหมดของคุณด้วยพลังของ {{ProdFullName}}"
    }
  },
  "xlsx": {
    "head": {
      "title": "การจัดการลายน้ำสเปรดชีต {{FileFormatUp}} ที่มีประสิทธิภาพ",
      "description": "จัดการลายน้ำในเอกสารอย่างมีประสิทธิภาพด้วย {{ProdFullName}}"
    },
    "header": {
      "title": "การควบคุมลายน้ำที่คล่องตัวในสเปรดชีต {{FileFormatUp}}",
      "description": "ควบคุมลายน้ำอย่างมีประสิทธิภาพโดยใช้แนวทางที่คล่องตัว {{ProdFullName}}",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลดแพ็คเกจ {{PackageStoreName}}"
    },
    "about": {
      "title": "ข้อมูลพื้นฐาน {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็นโซลูชันที่คล่องตัวสำหรับการจัดการลายน้ำใน {{EnvName}} ลดความซับซ้อนของกระบวนการจัดการลายน้ำในรูปแบบไฟล์ต่างๆ"
    },
    "formats": {
      "title": "การควบคุมลายน้ำที่คล่องตัว",
      "description": "ปรับปรุงการควบคุมลายน้ำในรูปแบบไฟล์ที่แตกต่างกันด้วย {{ProdFullName}}"
    }
  }
}