{
  "examples": {
    "comment_1": "ایجاد واترمارک متنی در فایل {{FileFormatUp}}",
    "comment_2": "ارائه فایل به واترمارک",
    "comment_3": "نمونه واترمارک متنی ایجاد کنید",
    "comment_4": "نتیجه {{FileFormatUp}} را ذخیره کنید"
  },
  "steps": {
    "title": "اسناد خود را تقویت کنید: با استفاده از {{EnvName}} برای {{FileformatCap}} واترمارک ایجاد کنید",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** کتابخانه ای است که افزودن واترمارک به فرمت های مختلف فایل های تجاری را برای توسعه دهندگان {{EnvName}} ساده می کند. کتابخانه ما را در برنامه خود ادغام کنید و اسناد را با استفاده از این مراحل زیر بدون دردسر علامت گذاری کنید:",
      "step_1": "**آغاز سفر واترمارکینگ شما:** با آشنایی با کلاس {{TextWatermarkerBold}} ، سنگ بنای API ما، شروع کنید. برای شروع فرآیند، مطمئن شوید که آن را قبل از پردازش سند نمونه‌برداری کرده‌اید. اهمیت ارائه فایل {{FileformatCap}} به سازنده را نادیده نگیرید، خواه مسیر باشد یا یک شی جریان.",
      "step_2": "**ساخت واترمارک های سفارشی:** با ایجاد یک شی {{TextWatermarkBold}} متناسب با مشخصات شما، به مرحله بعدی بروید. این ابزار همه کاره به صفحات سند خاص محدود نمی شود. همچنین می تواند به طور یکپارچه در عناصر سند بومی مانند پیوست ها یا هدرها ادغام شود.",
      "step_3": "**تنظیم دقیق ویژگی های واترمارک:** تجربه واترمارک خود را با تنظیم ویژگی هایی مانند ارتفاع، عرض، تراز صفحه، خانواده فونت و رنگ اصلاح کنید. این سطح از سفارشی سازی تضمین می کند که واترمارک های شما یکپارچه با اسناد شما ترکیب می شوند.",
      "step_4": "**استفاده از واترمارک های خود:** از روش {{TextWatermarkerBold}} استفاده کنید تا بدون زحمت واترمارک های سفارشی خود را روی اسناد خود اعمال کنید. چه نیاز به اضافه کردن یک یا چند واترمارک داشته باشید، این فرآیند انعطاف پذیری را ارائه می دهد. برای امنیت بیشتر، اسناد پردازش شده خود را در مکانی جداگانه ذخیره کنید."
    }
  },
  "more_features": {
    "title": "شیوه عمیق در افزودن واترمارک ها",
    "description": "از API قدرتمند ما برای رندر، نمایش، تبدیل و مدیریت اسناد، اسلاید، نمودارها و انواع مختلف سند در .NET برنامه استفاده کنید. GroupDocs.Watermark به طور یکپارچه قابلیت های واترمارک را برای افزایش امنیت اسناد و حفاظت از کپی رایت ادغام می کند.",
    "image_description": "افزودن واترمارک",
    "feature_1": {
      "title": "اسناد خود را بدون زحمت علامت گذاری کنید",
      "content": "{{ProdShortName}} توسعه دهندگان را قادر می سازد تا به راحتی واترمارک را در برنامه های خود ادغام کنند. بدون زحمت متن، تصویر یا واترمارک پویا را به اسناد و فایل های تجاری محبوب اضافه کنید و اطمینان حاصل کنید که محتوای شما به طور مداوم در همه سیستم عامل ها ایمن و برند دار است."
    },
    "feature_2": {
      "title": "واترمارک ها را متناسب با نیازهای شما تنظیم کنید.",
      "content": "با ویژگی های گسترده پشتیبانی شده توسط GroupDocs.Watermark، واترمارک ها را متناسب با نیازهای خاص خود سفارشی کنید. اندازه، چرخش، شفافیت، رنگ و فونت را تنظیم کنید تا اطمینان حاصل شود که واترمارک شما نه تنها عالی به نظر می رسد بلکه امنیت سند را نیز بدون مانع اطلاعات مهم افزایش می دهد."
    },
    "feature_3": {
      "title": "از ویژگی های اسناد بومی برای علامت گذاری استفاده کنید",
      "content": "از ویژگی های ذاتی فرمت های سند برای علامت گذاری پیشرفته استفاده کنید. چه از حاشیه نویسی PDF بومی، MS Word پس زمینه یا Excel هدر و پاورقی استفاده کند، GroupDocs.Watermark عمیقاً با ساختارهای سند ادغام می شود تا واترمارک هایی را اعمال کند که هم موثر و هم کم تهاجمی هستند."
    },
    "code_1": {
      "title": "تولید علامت تصویر برای DOCX",
      "content": "این مثال نحوه اعمال جلوه های تصویر به علامت های شکل را نشان می دهد.",
      "comment_1": "بارگیری Word سند",
      "comment_2": "تنظیمات علامت گذاری را تنظیم کنید",
      "comment_3": "تولید علامت",
      "comment_4": "ذخیره سند به روز شده"
    }
  },
  "excel": {
    "ext": "اکس‌اس‌لکس",
    "head": {
      "title": "تولید واترمارک برای Excel صفحات گسترده",
      "description": "برای امنیت ثابت، علامت گذاری تصویر را با .NET C# خودکار کنید. دسته های بزرگ تصاویر را به طور موثر مدیریت کنید."
    },
    "header": {
      "title": "افزودن علامت های پویا در Excel با استفاده از .NET C #",
      "description": "استفاده از واترمارک های متن یا تصویر پویا را در Excel فایل خود با استفاده از C# خودکار کنید. آموزش های ما به شما نشان می دهد که چگونه با حداقل مداخله دستی مورد نیاز، سازگاری و حرفه ای بودن را حفظ کنید.",
      "subtitle": "{{ProdFullName}} آپی",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}} کتابخانه",
      "content": "{{ProdFullName}} امکان ادغام یکپارچه واترمارک ها در صفحات گسترده Excel را فراهم می کند و ابزارهای لازم برای ایمن سازی و شخصی سازی اسناد خود را در اختیار کسب و کارها قرار می دهد. این کتابخانه C# انواع واترمارک را پشتیبانی می کند و امکان سفارشی سازی دقیق، از جمله کدورت، چرخش و تنظیمات تراز را فراهم می کند. علاوه بر این، مجهز به قابلیت های جستجوی پیشرفته برای تشخیص و مدیریت واترمارک های موجود است و اطمینان حاصل می کند که صفحات گسترده شما در برابر دستکاری و افشای غیر مجاز محافظت می شوند."
    },
    "formats": {
      "title": "جاسازی واترمارک های متن و تصویر در Excel با استفاده از {{ProgLang}}",
      "description": "از GroupDocs.Watermark C# API استفاده کنید تا به طور موثر واترمارک های سفارشی را به صفحات گسترده Excel اضافه کنید. امنیت اسناد و نام تجاری شرکت را با ابزارهایی که برای ادغام سریع و انعطاف پذیر واترمارک طراحی شده اند، افزایش دهید"
    }
  },
  "word": {
    "ext": "داکس",
    "head": {
      "title": "تولید Word علامت سند",
      "description": "جریان کار اسناد Word را با واترمارک ساده کنید. صداقت برند خود را به صورت حرفه ای منعکس کنید."
    },
    "header": {
      "title": "ایجاد واترمارک های پویا در Word و OpenOffice با C#",
      "description": "با استفاده از جعبه ابزار قدرتمند C# ما، واترمارک ها را به طور استراتژیک در اسناد Word خود قرار دهید. با سهولت سفارشی کنید تا با استانداردهای برند یا نیازهای امنیتی مطابقت داشته باشد.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} توانایی شما در علامت گذاری اسناد مایکروسافت Word را تغییر می دهد. این API همه کاره به طور یکپارچه در محیط توسعه شما ادغام می شود و امکان افزودن واترمارک های متنی و تصویری پیچیده را فراهم می کند که می توانند کاملاً یا نسبتاً در سند قرار گیرند. از فرمت های DOC، DOCX و RTF پشتیبانی می کند و انعطاف پذیری را در چندین نسخه Word فراهم می کند. اسناد خود را با واترمارک هایی تقویت کنید که نه تنها ایمن هستند بلکه به طور ظریف با محتوا ترکیب می شوند و خوانایی و یکپارچگی طرح را حفظ می کنند."
    },
    "formats": {
      "title": "علامت گذاری با قابلیت C# در Word و OpenOffice از طریق {{ProgLang}}",
      "description": "تأثیر اسناد MS Word و OpenOffice خود را با واترمارک های طراحی شده سفارشی که هم حفاظت و هم حرفه ای بودن ارائه می دهند، به حداکثر برسانید. API C# ما استفاده از واترمارک های دقیق و جذاب را ساده می کند."
    }
  },
  "image": {
    "ext": "جی پی جی پی",
    "head": {
      "title": "تصاویر واترمارک با .NET C#",
      "description": "یاد بگیرید که علامت های بدون درز را روی تصاویر با استفاده از .NET C# اعمال کنید. از دارایی های خود بدون به خطر انداختن کیفیت محافظت کنید."
    },
    "header": {
      "title": "علامت گذاری سریع سفارشی برای تصاویر با استفاده از {{EnvName}}",
      "description": "ابزار .NET C# ما یک راه حل سریع برای جاسازی واترمارک ها در تصاویر فراهم می کند. پشتیبانی از فرمت های تصویر گسترده پوشش کامل از عکس ها تا آثار هنری دیجیتال را تضمین می کند.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} برای خودکار کردن فرآیند علامت گذاری تصاویر طراحی شده است و از مجموعه گسترده ای از فرمت ها مانند JPEG، PNG، BMP و TIFF پشتیبانی می کند. این API قوی امکان وارد کردن سریع واترمارک های متن و تصویر را فراهم می کند که از نظر کدورت، اندازه و موقعیت قابل تنظیم هستند، متناسب با نیازهای خاص شما. چه برای حفاظت از کپی رایت باشد و چه برای تقویت مطالب بازاریابی، جعبه ابزار ما تضمین می کند که واترمارک ها با وفاداری بالا و حداقل تأثیر بر کیفیت تصویر اصلی اعمال می شوند."
    },
    "formats": {
      "title": "واترمارک ها را به سرعت در سراسر فرمت های تصویر از طریق {{ProgLang}} پیاده سازی کنید",
      "description": "حفاظت از تصویر خود را با ابزار .NET C# که قادر به مدیریت فرمت های مختلف تصویر با سرعت و کارایی است، افزایش دهید. واترمارک های خود را طوری تنظیم کنید تا کاملاً با محتوای بصری شما ترکیب شود."
    }
  },
  "photo": {
    "ext": "png",
    "head": {
      "title": "عکس های خود را به سرعت و به راحتی علامت بزنید",
      "description": "با علامت های .NET C # به سرعت حق چاپ عکس های خود را ایمن کنید و ادعا کنید. همین امروز حفاظت از کارتان را شروع کنید."
    },
    "header": {
      "title": "علامت گذاری سریع و آسان عکس با {{EnvName}}",
      "description": "کتابخانه قدرتمند C# ما امکان علامت گذاری سریع عکس های شما را فراهم می کند و به شما کمک می کند کپی رایت را حفظ کنید و هویت برند را بدون به خطر انداختن کیفیت تصویر افزایش دهید.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} یک راه حل قدرتمند برای خدمات عکاس که به دنبال محافظت از کپی رایت و هویت برند خود هستند ارائه می دهد. این API امکان افزودن سریع واترمارک های متنی یا گرافیکی به عکس ها در فرمت های مختلف از جمله JPEG، PNG و RAW را فراهم می کند. واترمارک های خود را برای شفافیت، اندازه و موقعیت سفارشی کنید تا به طور یکپارچه با عکس ترکیب شود، کیفیت زیبایی شناختی را حفظ کرده و در عین حال حقوق قانونی خود را تأیید کنید و از استفاده غیر مجاز جلوگیری کنید."
    },
    "formats": {
      "title": "از عکس های خود با علامت های موثر محافظت کنید {{ProgLang}}",
      "description": "محتوای عکاسی خود را با واترمارک های قابل تنظیم با استفاده از .NET C# API که برای ادغام یکپارچه و حفظ کیفیت تصویر طراحی شده است، ایمن و سبک سازی کنید."
    }
  },
  "powerpoint": {
    "ext": "پی‌تی‌اکس",
    "head": {
      "title": "ایجاد ویژگی های پیشرفته واترمارک برای ارائه ها",
      "description": "از تکنیک های پیشرفته برای ایجاد علامت های تأثیرگذار برای ارائه ها استفاده کنید. امنیت محتوا را به طور یکپارچه اطمینان حاصل کنید"
    },
    "header": {
      "title": "ارائه های خود را با علامت گذاری پیشرفته در C # نوآوری کنید",
      "description": "با استفاده از API C# ما، واترمارک های متنی و تصویری پیشرفته را در اسلاید PowerPoint خود قرار دهید. ایده آل برای افزایش امنیت و جذابیت حرفه ای در ارائه ها.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "دانلود در {{PackageStoreName}} به صورت رایگان"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} برای تسهیل درج علامت های پیشرفته در PowerPoint ارائه به طور موثر طراحی شده است. چه با اطلاعات محرمانه سر و کار دارید و چه به دنبال افزایش نام تجاری شرکت خود در اسلایدها هستید، API ما راه حل های واترمارک قوی ارائه می دهد که می تواند با اسلایدهای فردی یا کل ارائه ها سازگار شود. از علامت های متن ساده گرفته تا آرم های پیچیده، ظاهر و جایگذاری واترمارک خود را تنظیم کنید تا به طور یکپارچه با طرح های اسلاید شما ادغام شود و در عین حال یک لایه امنیتی اضافی را فراهم کنید."
    },
    "formats": {
      "title": "محافظت و شخصی سازی ارائه ها با واترمارک در {{ProgLang}}",
      "description": "از جعبه ابزار C# ما استفاده کنید تا به سرعت واترمارک های سفارشی را اعمال کنید که یکپارچگی و زیبایی شناسی ارائه PowerPoint شما را حفظ می کند. ایده آل برای محیط های حرفه ای و آموزشی."
    }
  }
}