{
  "examples": {
    "comment_1": "เพิ่มลายน้ำข้อความลงในไฟล์ {{FileFormatUp}}",
    "comment_2": "เลือกไฟล์ที่คุณต้องการเพิ่มลายน้ำ",
    "comment_3": "สร้างวัตถุลายน้ำข้อความ",
    "comment_4": "บันทึกไฟล์ {{FileFormatUp}} ที่อัปเดตแล้ว"
  },
  "steps": {
    "title": "เพิ่มลายน้ำอย่างง่าย: การเพิ่มลายน้ำด้วย {{ProgLang}} สำหรับ {{FileformatCap}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** เป็นไลบรารีที่ช่วยให้คุณสามารถเพิ่มลายน้ำในหลายประเภทไฟล์ธุรกิจได้อย่างรวดเร็ว ปฏิบัติตามขั้นตอนเหล่านี้เพื่อเพิ่มลายน้ำในเอกสารของคุณใน {{ProgLang}}:",
      "step_1": "**เริ่มต้นกับลายน้ำ:** เริ่มด้วยการสร้างตัวอย่างของคลาส {{TextWatermarkerBold}} ส่งไฟล์ {{FileformatCap}} ของคุณ (เป็นพาธหรือสตรีม) ไปยังคอนสตรัคเตอร์เพื่อเปิดสำหรับการเพิ่มลายน้ำ",
      "step_2": "**สร้างลายน้ำของคุณ:** สร้างวัตถุลายน้ำ {{TextWatermarkBold}} พร้อมข้อความและการตั้งค่าที่คุณต้องการ คุณสามารถเพิ่มลายน้ำไปยังหน้าใดก็ได้หรือแม้แต่ไปยังองค์ประกอบเอกสารเช่นหัวเรื่องหรือไฟล์แนบ",
      "step_3": "**ปรับแต่งลายน้ำ:** ปรับขนาด ตำแหน่ง ฟอนต์ สี และการจัดตำแหน่งของลายน้ำให้เหมาะสมตามต้องการ นี่จะช่วยให้ลายน้ำดูดีในเอกสารของคุณ",
      "step_4": "**นำไปใช้และบันทึก:** ใช้เมธอด {{TextWatermarkerBold}} เพื่อนำลายน้ำของคุณไปใช้ในเอกสาร บันทึกผลลัพธ์ โดยปกติให้บันทึกเป็นไฟล์ใหม่เพื่อความปลอดภัย"
    }
  },
  "more_features": {
    "title": "สำรวจฟีเจอร์การเพิ่มลายน้ำเพิ่มเติม",
    "description": "ใช้ API {{ProgLang}} ของเราเพื่อเพิ่ม ดู แปลง และจัดการลายน้ำในเอกสาร สไลด์ แผนภาพ และอื่นๆ {{ProdFullName}} ช่วยให้คุณปกป้องไฟล์และเพิ่มข้อมูลลิขสิทธิ์ได้อย่างรวดเร็ว",
    "image_description": "เพิ่มลายน้ำ",
    "feature_1": {
      "title": "เพิ่มลายน้ำได้อย่างรวดเร็ว",
      "content": "{{ProdShortName}} อนุญาตให้ผู้พัฒนา {{ProgLang}} สามารถเพิ่มลายน้ำข้อความ รูปภาพ หรือแบบไดนามิกลงในเอกสารทางธุรกิจได้อย่างรวดเร็ว รักษาความปลอดภัยและภาพลักษณ์ของไฟล์ด้วยความพยายามน้อยที่สุด"
    },
    "feature_2": {
      "title": "ลายน้ำที่ปรับแต่งได้ทั้งหมด",
      "content": "เปลี่ยนขนาดลายน้ำ การหมุน ความโปร่งใส สี และฟอนต์ได้ด้วย {{ProdShortName}} ทำให้ลายน้ำของคุณพอดีกับเอกสารของคุณและเก็บเนื้อหาสำคัญไว้อย่างชัดเจน"
    },
    "feature_3": {
      "title": "ใช้ฟีเจอร์เอกสารสำหรับการเพิ่มลายน้ำ",
      "content": "ใช้ประโยชน์จากฟีเจอร์เอกสารในตัว เช่น หมายเหตุ PDF พื้นหลัง Word หรือหัวเรื่อง Excel เพื่อเพิ่มลายน้ำ {{ProdShortName}} ทำงานร่วมกับโครงสร้างของเอกสารเพื่อการเพิ่มลายน้ำที่มีประสิทธิภาพและไม่รบกวน"
    },
    "code_1": {
      "title": "เพิ่มลายน้ำรูปภาพลงใน DOCX",
      "content": "ตัวอย่างนี้แสดงวิธีการใช้เอฟเฟกต์รูปภาพกับลายน้ำรูปทรง",
      "comment_1": "เปิดเอกสาร Word",
      "comment_2": "ตั้งค่าตัวเลือกลายน้ำ",
      "comment_3": "สร้างลายน้ำ",
      "comment_4": "บันทึกเอกสารพร้อมลายน้ำ"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "เพิ่มลายน้ำให้ไฟล์ Excel",
      "description": "เพิ่มลายน้ำรูปภาพให้กับไฟล์ Excel โดยอัตโนมัติด้วย {{ProgLang}} ประมวลผลไฟล์หลายไฟล์พร้อมกันเพื่อความปลอดภัยที่สอดคล้อง"
    },
    "header": {
      "title": "เพิ่มลายน้ำให้กับ Excel ด้วย {{ProgLang}}",
      "description": "เพิ่มลายน้ำข้อความหรือลายน้ำรูปภาพให้กับไฟล์ Excel โดยใช้ {{ProgLang}} คู่มือของเราจะแสดงให้คุณเห็นวิธีรักษาความเป็นมืออาชีพและความปลอดภัยในสเปรดชีตของคุณโดยมีการทำงาน手 вручที่น้อยที่สุด",
      "subtitle": "{{ProdFullName}} API",
      "action_title": "ดาวน์โหลด {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}} ไลบรารี",
      "content": "{{ProdFullName}} ช่วยให้คุณเพิ่มลายน้ำในสเปรดชีต Excel ใน {{ProgLang}} คุณสามารถใช้ประเภทของลายน้ำที่แตกต่างกันและปรับความทึบ ความหมุน และการจัดตำแหน่ง ไลบรารียังช่วยคุณค้นหาและจัดการลายน้ำที่มีอยู่เพื่อรักษาความปลอดภัยในไฟล์ของคุณจากการปลอมแปลง"
    },
    "formats": {
      "title": "เพิ่มลายน้ำข้อความและรูปภาพให้กับ Excel ด้วย {{ProgLang}}",
      "description": "ใช้ {{ProdShortName}} เพื่อเพิ่มลายน้ำที่กำหนดเองลงในไฟล์ Excel อย่างรวดเร็ว ปรับปรุงความปลอดภัยของเอกสารและภาพลักษณ์ด้วยเครื่องมือการเพิ่มลายน้ำที่มีความยืดหยุ่น"
    }
  },
  "word": {
    "ext": "docx",
    "head": {
      "title": "เพิ่มลายน้ำให้เอกสาร Word",
      "description": "เพิ่มลายน้ำให้กับไฟล์ Word เพื่อปกป้องแบรนด์และเนื้อหาของคุณ"
    },
    "header": {
      "title": "สร้างลายน้ำใน Word และ OpenOffice ด้วย {{ProgLang}}",
      "description": "เพิ่มลายน้ำลงในเอกสาร Word ของคุณโดยใช้ไลบรารี {{ProgLang}} ของเรา ปรับแต่งพวกมันให้ตรงตามแบรนด์หรือตามความต้องการของคุณ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลด {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} ทำให้การเพิ่มลายน้ำข้อความและรูปภาพในเอกสาร Microsoft Word ใน {{ProgLang}} เป็นเรื่องง่าย คุณสามารถวางลายน้ำได้ตามที่คุณต้องการ และรองรับไฟล์ DOC, DOCX และ RTF ลายน้ำจะผสมผสานกับเนื้อหาของคุณ ทำให้เอกสารอ่านง่ายและมีความปลอดภัย"
    },
    "formats": {
      "title": "เพิ่มลายน้ำให้กับไฟล์ Word และ OpenOffice ด้วย {{ProgLang}}",
      "description": "เพิ่มลายน้ำมืออาชีพให้กับเอกสาร Word และ OpenOffice ของคุณ โดยใช้ API {{ProgLang}} ของเรา ปกป้องไฟล์ของคุณให้ดูเรียบร้อย"
    }
  },
  "image": {
    "ext": "jpeg",
    "head": {
      "title": "เพิ่มลายน้ำให้กับภาพด้วย {{ProgLang}}",
      "description": "เรียนรู้วิธีเพิ่มลายน้ำให้กับภาพใน {{ProgLang}} ปกป้องภาพถ่ายของคุณโดยไม่สูญเสียคุณภาพ"
    },
    "header": {
      "title": "การเพิ่มลายน้ำภาพอย่างรวดเร็วด้วย {{ProgLang}}",
      "description": "เครื่องมือ {{ProgLang}} ของเราช่วยให้คุณเพิ่มลายน้ำให้กับภาพได้อย่างรวดเร็ว รองรับหลายรูปแบบ ตั้งแต่ภาพถ่ายไปจนถึงศิลปะดิจิทัล",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลด {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} ช่วยให้คุณเพิ่มลายน้ำในภาพใน {{ProgLang}} รองรับ JPEG, PNG, BMP, TIFF และอีกมากมาย คุณสามารถปรับความโปร่งใส ขนาด และตำแหน่งของลายน้ำให้เหมาะสมตามต้องการ ใช้เพื่อปกป้องภาพหรือเพิ่มการสร้างแบรนด์ โดยไม่สูญเสียคุณภาพต้นฉบับ"
    },
    "formats": {
      "title": "เพิ่มลายน้ำให้กับภาพด้วย {{ProgLang}}",
      "description": "ปกป้องภาพของคุณด้วยชุดเครื่องมือ {{ProgLang}} ของเรา เพิ่มลายน้ำให้กับหลายรูปแบบภาพได้อย่างรวดเร็ว"
    }
  },
  "photo": {
    "ext": "png",
    "head": {
      "title": "เพิ่มลายน้ำให้กับภาพถ่ายของคุณได้อย่างง่ายดาย",
      "description": "เพิ่มลายน้ำลงในภาพถ่ายของคุณใน {{ProgLang}} เพื่อปกป้องงานของคุณและลิขสิทธิ์"
    },
    "header": {
      "title": "การเพิ่มลายน้ำภาพถ่ายอย่างรวดเร็วด้วย {{ProgLang}}",
      "description": "ใช้ไลบรารี {{ProgLang}} ของเราเพื่อเพิ่มลายน้ำให้กับภาพถ่ายของคุณอย่างรวดเร็ว ปกป้องลิขสิทธิ์และภาพลักษณ์ของคุณโดยไม่สูญเสียคุณภาพของภาพ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลด {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} เหมาะสำหรับช่างภาพที่ต้องการปกป้องงานของตน เพิ่มลายน้ำข้อความหรือรูปภาพลงในภาพถ่ายในรูปแบบเช่น JPEG, PNG และ RAW ปรับความโปร่งใส ขนาด และตำแหน่งเพื่อให้ลายน้ำของคุณพอดีและภาพยังดูดี"
    },
    "formats": {
      "title": "ปกป้องภาพถ่ายของคุณด้วยลายน้ำใน {{ProgLang}}",
      "description": "เพิ่มลายน้ำที่กำหนดเองให้กับภาพถ่ายของคุณโดยใช้ API {{ProgLang}} ของเรา รักษาสภาพของภาพดูดีและเป็นมืออาชีพ"
    }
  },
  "powerpoint": {
    "ext": "pptx",
    "head": {
      "title": "เพิ่มลายน้ำให้กับการนำเสนอ",
      "description": "เพิ่มลายน้ำให้กับสไลด์ PowerPoint ของคุณได้อย่างง่ายดายเพื่อความปลอดภัยเพิ่มเติม"
    },
    "header": {
      "title": "การเพิ่มลายน้ำขั้นสูงสำหรับการนำเสนอใน {{ProgLang}}",
      "description": "เพิ่มลายน้ำข้อความและรูปภาพให้กับสไลด์ PowerPoint ด้วย API {{ProgLang}} ของเรา เหมาะสำหรับการรักษาความปลอดภัยและความน่าเชื่อถือของการนำเสนอของคุณ",
      "subtitle": "{{ProdFullName}}",
      "action_title": "ดาวน์โหลด {{PackageStoreName}} ฟรี"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} ช่วยให้คุณเพิ่มลายน้ำขั้นสูงให้กับการนำเสนอ PowerPoint ใน {{ProgLang}} ปกป้องข้อมูลที่เป็นความลับหรือลงโลโก้บริษัทของคุณในสไลด์ คุณสามารถเพิ่มลายน้ำลงในสไลด์เดียวหรือทั้งการนำเสนอและปรับวิธีการแสดงผลและตำแหน่งของพวกมัน"
    },
    "formats": {
      "title": "เพิ่มลายน้ำให้กับการนำเสนอด้วย {{ProgLang}}",
      "description": "ใช้ชุดเครื่องมือ {{ProgLang}} ของเราเพื่อเพิ่มลายน้ำให้กับไฟล์ PowerPoint ได้อย่างรวดเร็ว รักษาความปลอดภัยของสไลด์และให้ดูน่าประทับใจ"
    }
  }
}