{
  "examples": {
    "comment_1": "Tambahkan watermark teks ke file {{FileFormatUp}}",
    "comment_2": "Pilih file yang ingin Anda tambahkan watermark",
    "comment_3": "Buat objek watermark teks",
    "comment_4": "Simpan file {{FileFormatUp}} yang telah diperbarui"
  },
  "steps": {
    "title": "Tambahkan Watermark: Watermarking {{ProgLang}} untuk {{FileformatCap}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** adalah pustaka yang memungkinkan Anda menambahkan watermark ke banyak jenis file bisnis. Ikuti langkah-langkah berikut untuk cepat menambahkan watermark ke dokumen Anda di {{ProgLang}}:",
      "step_1": "**Mulai dengan Watermarking:** Mulailah dengan membuat instance dari kelas {{TextWatermarkerBold}}. Berikan file {{FileformatCap}} Anda (sebagai jalur atau aliran) ke konstruktor untuk membukanya agar dapat diberi watermark.",
      "step_2": "**Buat Watermark Anda:** Buat objek {{TextWatermarkBold}} dengan teks dan pengaturan yang diinginkan. Anda dapat menambahkan watermark ke halaman mana pun atau bahkan ke elemen dokumen seperti header atau lampiran.",
      "step_3": "**Sesuaikan Watermark:** Sesuaikan ukuran, posisi, font, warna, dan penempatan watermark agar sesuai dengan kebutuhan Anda. Ini membantu watermark Anda terlihat tepat di dokumen Anda.",
      "step_4": "**Terapkan dan Simpan:** Gunakan metode {{TextWatermarkerBold}} untuk menambahkan watermark Anda ke dokumen. Simpan hasilnya, idealnya ke file baru untuk keamanan."
    }
  },
  "more_features": {
    "title": "Jelajahi Fitur Watermarking Lainnya",
    "description": "Gunakan API {{ProgLang}} kami untuk menambahkan, melihat, mengonversi, dan mengelola watermark dalam dokumen, slide, diagram, dan lainnya. {{ProdFullName}} membantu Anda melindungi file Anda dan menambahkan informasi hak cipta dengan mudah.",
    "image_description": "Tambahkan Watermark",
    "feature_1": {
      "title": "Tambahkan Watermark dengan Mudah",
      "content": "{{ProdShortName}} memungkinkan pengembang {{ProgLang}} dengan cepat menambahkan watermark teks, gambar, atau dinamis ke dokumen bisnis. Jaga keamanan dan merek file Anda dengan upaya minimal."
    },
    "feature_2": {
      "title": "Watermark yang Sepenuhnya Dapat Disesuaikan",
      "content": "Ubah ukuran, rotasi, transparansi, warna, dan font watermark menggunakan {{ProdShortName}}. Buat watermark Anda sesuai dengan dokumen dengan sempurna sambil menjaga konten penting tetap terlihat."
    },
    "feature_3": {
      "title": "Gunakan Fitur Dokumen untuk Watermarking",
      "content": "Manfaatkan fitur dokumen yang sudah ada seperti anotasi PDF, latar belakang Word, atau header Excel untuk menambahkan watermark. {{ProdShortName}} bekerja dengan struktur dokumen untuk watermarking yang efektif dan tidak mengganggu."
    },
    "code_1": {
      "title": "Tambahkan Watermark Gambar ke DOCX",
      "content": "Contoh ini menunjukkan cara menerapkan efek gambar pada watermark bentuk.",
      "comment_1": "Buka dokumen Word",
      "comment_2": "Atur opsi watermark",
      "comment_3": "Buat watermark",
      "comment_4": "Simpan dokumen dengan watermark"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "Tambahkan Watermark ke File Excel",
      "description": "Tambahkan watermark gambar secara otomatis ke file Excel dengan {{ProgLang}}. Proses banyak file sekaligus untuk perlindungan yang konsisten."
    },
    "header": {
      "title": "Tambahkan Watermark ke Excel dengan {{ProgLang}}",
      "description": "Tambahkan dengan cepat watermark teks atau gambar ke file Excel menggunakan {{ProgLang}}. Panduan kami menunjukkan cara menjaga spreadsheet Anda tetap profesional dan aman dengan sedikit pekerjaan manual.",
      "subtitle": "API {{ProdFullName}}",
      "action_title": "Unduh {{PackageStoreName}} secara gratis"
    },
    "about": {
      "title": "Pustaka {{ProdFullName}}",
      "content": "{{ProdFullName}} memungkinkan Anda menambahkan watermark ke spreadsheet Excel di {{ProgLang}}. Anda bisa menggunakan berbagai jenis watermark dan menyesuaikan opasitas, rotasi, dan penempatan. Pustaka ini juga membantu Anda menemukan dan mengelola watermark yang sudah ada untuk menjaga file Anda aman dari perubahan."
    },
    "formats": {
      "title": "Tambahkan Watermark Teks dan Gambar ke Excel dengan {{ProgLang}}",
      "description": "Gunakan {{ProdShortName}} untuk dengan cepat menambahkan watermark kustom ke file Excel. Tingkatkan keamanan dokumen dan branding dengan alat watermarking yang fleksibel."
    }
  },
  "word": {
    "ext": "docx",
    "head": {
      "title": "Tambahkan Watermark ke Dokumen Word",
      "description": "Tambahkan watermark ke file Word untuk melindungi merek dan konten Anda."
    },
    "header": {
      "title": "Buat Watermark di Word dan OpenOffice dengan {{ProgLang}}",
      "description": "Tambahkan watermark ke dokumen Word Anda menggunakan pustaka {{ProgLang}} kami. Sesuaikan agar sesuai dengan merek atau kebutuhan keamanan Anda.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Unduh {{PackageStoreName}} secara gratis"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} memudahkan menambahkan watermark teks dan gambar ke dokumen Microsoft Word di {{ProgLang}}. Anda dapat menempatkan watermark persis di tempat yang Anda inginkan, dan ini bekerja dengan file DOC, DOCX, dan RTF. Watermark menyatu dengan konten Anda, menjaga dokumen tetap dapat dibaca dan aman."
    },
    "formats": {
      "title": "Watermark File Word dan OpenOffice dengan {{ProgLang}}",
      "description": "Tambahkan watermark profesional ke dokumen Word dan OpenOffice Anda menggunakan API {{ProgLang}} kami. Lindungi file Anda dan jaga tetap terlihat bagus."
    }
  },
  "image": {
    "ext": "jpeg",
    "head": {
      "title": "Watermark Gambar dengan {{ProgLang}}",
      "description": "Pelajari cara menambahkan watermark ke gambar di {{ProgLang}}. Lindungi gambar Anda tanpa kehilangan kualitas."
    },
    "header": {
      "title": "Watermark Gambar dengan Cepat menggunakan {{ProgLang}}",
      "description": "Alat {{ProgLang}} kami memungkinkan Anda dengan cepat menambahkan watermark ke gambar. Mendukung banyak format, dari foto hingga seni digital.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Unduh {{PackageStoreName}} secara gratis"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} membantu Anda menambahkan watermark ke gambar di {{ProgLang}}. Ini mendukung JPEG, PNG, BMP, TIFF, dan lebih banyak lagi. Anda dapat mengubah opasitas, ukuran, dan posisi watermark agar sesuai dengan kebutuhan Anda. Gunakan untuk melindungi gambar Anda atau menambahkan branding, semua sambil menjaga kualitas asli."
    },
    "formats": {
      "title": "Tambahkan Watermark ke Gambar dengan {{ProgLang}}",
      "description": "Lindungi gambar Anda dengan toolkit {{ProgLang}} kami. Tambahkan watermark ke banyak format gambar dengan cepat dan mudah."
    }
  },
  "photo": {
    "ext": "png",
    "head": {
      "title": "Watermark Foto Anda dengan Mudah",
      "description": "Tambahkan watermark ke foto Anda di {{ProgLang}} untuk melindungi karya dan hak cipta Anda."
    },
    "header": {
      "title": "Watermark Foto Cepat dengan {{ProgLang}}",
      "description": "Gunakan pustaka {{ProgLang}} kami untuk dengan cepat menambahkan watermark ke foto Anda. Lindungi hak cipta dan merek Anda tanpa kehilangan kualitas gambar.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Unduh {{PackageStoreName}} secara gratis"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} sangat cocok untuk fotografer yang ingin melindungi karya mereka. Tambahkan watermark teks atau gambar ke foto dalam format seperti JPEG, PNG, dan RAW. Sesuaikan transparansi, ukuran, dan posisi agar watermark Anda cocok dengan sempurna dan foto Anda tetap terlihat baik."
    },
    "formats": {
      "title": "Lindungi Foto Anda dengan Watermark di {{ProgLang}}",
      "description": "Tambahkan watermark kustom ke foto Anda menggunakan API {{ProgLang}} kami. Jaga gambar Anda aman dan terlihat profesional."
    }
  },
  "powerpoint": {
    "ext": "pptx",
    "head": {
      "title": "Tambahkan Watermark ke Presentasi",
      "description": "Tambahkan watermark dengan mudah ke slide PowerPoint Anda untuk keamanan tambahan."
    },
    "header": {
      "title": "Watermarking Lanjut untuk Presentasi di {{ProgLang}}",
      "description": "Tambahkan watermark teks dan gambar ke slide PowerPoint dengan API {{ProgLang}} kami. Sangat baik untuk menjaga presentasi Anda aman dan profesional.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Unduh {{PackageStoreName}} secara gratis"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} memungkinkan Anda menambahkan watermark canggih ke presentasi PowerPoint di {{ProgLang}}. Lindungi informasi rahasia atau tambahkan logo perusahaan Anda ke slide. Anda dapat menambahkan watermark ke slide tunggal atau seluruh presentasi, serta mengatur tampilannya dan di mana mereka muncul."
    },
    "formats": {
      "title": "Watermark Presentasi dengan {{ProgLang}}",
      "description": "Gunakan toolkit {{ProgLang}} kami untuk dengan cepat menambahkan watermark ke file PowerPoint. Jaga slide Anda aman dan tetap terlihat tajam."
    }
  }
}