{
  "examples": {
    "comment_1": "{{FileFormatUp}} ファイルにテキストウォーターマークを生成",
    "comment_2": "ウォーターマークを付けるファイルを指定してください",
    "comment_3": "テキストウォーターマークインスタンスを生成",
    "comment_4": "{{FileFormatUp}} の結果を保存"
  },
  "steps": {
    "title": "ドキュメントを強化:{{EnvName}} を使って {{FileformatCap}} のウォーターマークを生成",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** は、{{EnvName}} 開発者のさまざまなビジネスファイル形式へのウォーターマークの追加を簡単にするライブラリです。以下のステップでライブラリをアプリケーションに統合し、簡単に文書にウォーターマークを付けられます。",
      "step_1": "**ウォーターマーキングの旅を始める:** まず、APIの基礎となる **Watermarker** クラスについて理解することから始めましょう。プロセスを開始するには、文書処理の前に必ずインスタンス化してください。パスであれストリームオブジェクトであれ、{{FileformatCap}} ファイルをコンストラクターに提供することの重要性を見逃さないでください。",
      "step_2": "**カスタムウォーターマークの作成:** 仕様に合わせた **ウォーターマーク** オブジェクトを作成して、次のフェーズに進んでください。この汎用性の高いツールは、特定の文書ページだけでなく、添付ファイルやヘッダーなどのネイティブ文書要素にもシームレスに統合できます。",
      "step_3": "**ウォーターマーク属性の微調整:** 高さ、幅、ページの配置、フォントファミリ、色などのプロパティを調整して、ウォーターマークの使い勝手を向上させましょう。このレベルのカスタマイズにより、ウォーターマークがドキュメントとシームレスに調和するようになります。",
      "step_4": "**ウォーターマークの適用:** **ウォーターマーカー** メソッドを使用すると、カスタムウォーターマークをドキュメントに簡単に適用できます。ウォーターマークを 1 つ追加する場合でも、複数のウォーターマークを追加する必要がある場合でも、このプロセスは柔軟性に優れています。セキュリティを強化するには、処理済みの文書を別の場所に保存することを検討してください。"
    }
  },
  "more_features": {
    "title": "ウォーターマークの追加について詳しく調べる",
    "description": "当社の強力なAPIを活用して、.NET アプリケーション内の文書、スライド、図、その他のさまざまな文書タイプをレンダリング、表示、変換、管理できます。GroupDocs.Watermark は透かし機能をシームレスに統合して、文書のセキュリティと著作権保護を強化します。",
    "image_description": "ウォーターマークを追加",
    "feature_1": {
      "title": "ドキュメントに簡単に透かしを入れます。",
      "content": "{{ProdShortName}} は .NET 人の開発者がウォーターマークをアプリケーションに簡単に統合できるようにします。人気のビジネス文書やファイルにテキスト、画像、動的ウォーターマークを簡単に追加できるため、コンテンツが安全に保たれ、すべてのプラットフォームで一貫したブランド化が保証されます。"
    },
    "feature_2": {
      "title": "ニーズに合わせてウォーターマークをカスタマイズできます。",
      "content": "GroupDocs.Watermark がサポートする豊富な機能を使用して、特定の要件に合わせてウォーターマークをカスタマイズできます。サイズ、回転、透明度、色、フォントを調整して、ウォーターマークが完璧に見えるようにするだけでなく、重要な情報を邪魔することなく文書のセキュリティを強化できます。"
    },
    "feature_3": {
      "title": "ネイティブドキュメント機能をウォーターマークに活用",
      "content": "文書フォーマット固有の機能を活用して、高度なウォーターマークを作成できます。ネイティブの PDF 注釈、MS Word 背景、Excel ヘッダーとフッターのいずれを使用する場合でも、GroupDocs.Watermark は文書構造と緊密に統合して、効果的で侵襲性の低いウォーターマークを適用します。"
    },
    "code_1": {
      "title": "DOCX の画像ウォーターマークを生成",
      "content": "この例は、図形の透かしにイメージ効果を適用する方法を示します。",
      "comment_1": "Word ドキュメントをロード",
      "comment_2": "ウォーターマークオプションを設定する",
      "comment_3": "ウォーターマークを生成",
      "comment_4": "更新した文書を保存"
    }
  },
  "excel": {
    "ext": "xslx",
    "head": {
      "title": "Excel スプレッドシートのウォーターマークを生成",
      "description": ".NET C# を使用して画像のウォーターマークを自動化し、一貫したセキュリティを確保します。大量の画像を効率的に処理できます。"
    },
    "header": {
      "title": ".NET C# を使用して Excel に動的ウォーターマークを追加",
      "description": "C# を使用して Excel ファイル全体への動的テキストまたは画像ウォーターマークの適用を自動化します。チュートリアルでは、手動による操作を最小限に抑えながら、一貫性と専門性を維持する方法を紹介しています。",
      "subtitle": "{{ProdFullName}} API",
      "action_title": "無料 {{PackageStoreName}} ダウンロード"
    },
    "about": {
      "title": "{{ProdFullName}} ライブラリ",
      "content": "{{ProdFullName}} を使用すると、ウォーターマークを Excel スプレッドシートにシームレスに統合できるため、企業は文書の保護とパーソナライズに必要なツールを利用できます。この C# ライブラリは、さまざまなタイプのウォーターマークをサポートしており、不透明度、回転、配置の調整など、詳細なカスタマイズが可能です。さらに、既存のウォーターマークを検出して管理する高度な検索機能も備えているため、スプレッドシートを改ざんや不正開示から保護できます。"
    },
    "formats": {
      "title": "{{ProgLang}} を使用して Excel にテキストと画像のウォーターマークを埋め込む",
      "description": "GroupDocs.Watermark C# API を利用して、Excel スプレッドシートにカスタムウォーターマークを効率的に追加できます。迅速かつ柔軟にウォーターマークを統合できるように設計されたツールで、文書のセキュリティと企業ブランディングを強化しましょう。"
    }
  },
  "word": {
    "ext": "docx",
    "head": {
      "title": "Word ドキュメントウォーターマークを生成",
      "description": "ウォーターマークを使用して Word 件の文書ワークフローを効率化できます。ブランドの誠実さを専門的に反映しましょう。"
    },
    "header": {
      "title": "C# で Word と OpenOffice でダイナミックウォーターマークを作成",
      "description": "当社の堅牢な C# ツールキットを使用して、Word 文書内にウォーターマークを戦略的に導入できます。ブランド標準やセキュリティ要件に合わせて簡単にカスタマイズできます。",
      "subtitle": "{{ProdFullName}}",
      "action_title": "{{PackageStoreName}} で無料でダウンロード"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} を使用すると、Microsoft Word ドキュメントにウォーターマークを付ける機能が変わります。この多用途な API は開発環境にシームレスに統合され、高度なテキストや画像のウォーターマークを追加して、ドキュメント内の絶対的または相対的な位置に配置できます。DOC、DOCX、RTF 形式をサポートしているため、複数の Word バージョンに柔軟に対応できます。安全であるだけでなく、読みやすさとレイアウトの整合性を保ちながら、コンテンツと微妙に調和するウォーターマークを使用して文書を強化できます。"
    },
    "formats": {
      "title": "Word および {{ProgLang}} 経由の OpenOffice では C# によるウォーターマーキングが可能",
      "description": "保護とプロ意識の両方を備えたカスタムデザインのウォーターマークを使用して、MS Word ドキュメントとOpenOfficeドキュメントの影響を最大化します。C# API では、正確で魅力的なウォーターマークを簡単に適用できます。"
    }
  },
  "image": {
    "ext": "JPEG",
    "head": {
      "title": ".NET C# で画像にウォーターマークを付ける",
      "description": ".NET C# を使用して画像にシームレスなウォーターマークを適用する方法を学びましょう。品質を損なうことなく資産を保護しましょう。"
    },
    "header": {
      "title": "{{EnvName}} を使用した画像のラピッドカスタムウォーターマーキング",
      "description": ".NET C# ツールは、ウォーターマークを画像に埋め込むための迅速なソリューションを提供します。幅広い画像フォーマットをサポートしているため、写真からデジタルアートワークまですべてカバーできます。",
      "subtitle": "{{ProdFullName}}",
      "action_title": "{{PackageStoreName}} で無料でダウンロード"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} は画像の透かし処理を自動化するように設計されており、JPEG、PNG、BMP、TIFF などのさまざまな形式をサポートしています。この堅牢な API により、特定の要件に合わせて不透明度、サイズ、位置を調整できるテキストや画像のウォーターマークをすばやく挿入できます。著作権保護の目的であれ、マーケティング資料の強化であれ、当社のツールキットを使用すれば、元の画質への影響を最小限に抑えながら、高い忠実度でウォーターマークを適用できます。"
    },
    "formats": {
      "title": "{{ProgLang}} を使用して画像フォーマット全体でウォーターマークをすばやく実装",
      "description": "さまざまな画像形式を迅速かつ効率的に処理できる .NET C# ツールキットで画像保護を強化してください。ウォーターマークはビジュアルコンテンツと完璧に調和するようにカスタマイズできます。"
    }
  },
  "photo": {
    "ext": "png",
    "head": {
      "title": "写真にすばやく簡単に透かしを入れる",
      "description": ".NET C# ウォーターマークを使用して写真の著作権をすばやく保護し、著作権を主張できます。今すぐ作品の保護を始めましょう。"
    },
    "header": {
      "title": "{{EnvName}} を使えば素早く簡単に写真の透かしが入ります",
      "description": "当社の強力な C# ライブラリを使用すると、写真にすばやく透かしを入れることができるため、画質を損なうことなく著作権を保護し、ブランドアイデンティティを高めることができます。",
      "subtitle": "{{ProdFullName}}",
      "action_title": "{{PackageStoreName}} で無料でダウンロード"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} は、著作権とブランドアイデンティティの保護を目指すフォトグラファーのサービスに強力なソリューションを提供します。この API を使用すると、JPEG、PNG、RAW など、さまざまな形式の写真にテキストまたはグラフィックのウォーターマークをすばやく追加できます。ウォーターマークの透明度、サイズ、位置をカスタマイズして写真とシームレスに調和させることで、美的品質を維持しながら法的権利を主張し、不正使用を防止できます。"
    },
    "formats": {
      "title": "効果的なウォーターマークで写真を保護しましょう {{ProgLang}}",
      "description": "シームレスに統合して画質を維持するように設計された .NET C# APIを使用して、カスタマイズ可能なウォーターマークで写真コンテンツを保護し、スタイリッシュにしましょう。"
    }
  },
  "powerpoint": {
    "ext": "pptx",
    "head": {
      "title": "プレゼンテーション用の高度なウォーターマーク機能の作成",
      "description": "高度なテクニックを使って、プレゼンテーション用のインパクトのあるウォーターマークを作成しましょう。コンテンツのセキュリティをシームレスに確保できます。"
    },
    "header": {
      "title": "C# の高度なウォーターマークでプレゼンテーションを革新しましょう",
      "description": "C# API を使用して、最先端のテキストと画像のウォーターマークを PowerPoint スライドに埋め込みましょう。プレゼンテーションのセキュリティとプロとしての魅力を高めるのに最適です。",
      "subtitle": "{{ProdFullName}}",
      "action_title": "{{PackageStoreName}} で無料でダウンロード"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} は PowerPoint 個のプレゼンテーションに高度なウォーターマークを効率的に挿入できるように設計されています。機密情報を扱う場合でも、スライドで会社のブランディングを強化したい場合でも、当社の API には、個々のスライドやプレゼンテーション全体に適用できる堅牢なウォーターマークソリューションが用意されています。シンプルなテキストマークから精巧なロゴまで、ウォーターマークの外観と配置をカスタマイズして、セキュリティを強化しながらスライドのデザインとシームレスに統合できます。"
    },
    "formats": {
      "title": "{{ProgLang}} のウォーターマーク付きプレゼンテーションの保護とパーソナライズ",
      "description": "C# ツールキットを使用すると、PowerPoint プレゼンテーションの完全性と美観を損なわないカスタムウォーターマークをすばやく適用できます。業務環境や教育環境に最適です。"
    }
  }
}