{
  "examples": {
    "comment_1": "Додати текстовий водяний знак до файлу {{FileFormatUp}}",
    "comment_2": "Виберіть файл, до якого ви хочете додати водяний знак",
    "comment_3": "Створіть об’єкт текстового водяного знака",
    "comment_4": "Збережіть оновлений файл {{FileFormatUp}}"
  },
  "steps": {
    "title": "Додайте водяні знаки: водяні знаки {{ProgLang}} для {{FileformatCap}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** — це бібліотека, яка дозволяє швидко додавати водяні знаки до багатьох типів бізнес-файлів. Виконайте ці кроки, щоб швидко додати водяні знаки до ваших документів у {{ProgLang}}:",
      "step_1": "**Почніть з водяних знаків:** С почните з створення екземпляра класу {{TextWatermarkerBold}}. Передайте ваш файл {{FileformatCap}} (як шлях або потік) у конструктор, щоб відкрити його для водяного знака.",
      "step_2": "**Створіть свій водяний знак:** Створіть об’єкт {{TextWatermarkBold}} з текстом та налаштуваннями за вашим вибором. Ви можете додавати водяні знаки на будь-якій сторінці або навіть до елементів документа, таких як колонтитули чи вкладення.",
      "step_3": "**Налаштуйте водяний знак:** Налаштуйте розмір, положення, шрифт, колір і вирівнювання водяного знака відповідно до ваших потреб. Це допоможе вашому водяному знаку виглядати саме так, як потрібно у документі.",
      "step_4": "**Застосуйте і збережіть:** Використовуйте метод {{TextWatermarkerBold}}, щоб додати ваші водяні знаки до документа. Збережіть результат, бажано в новий файл для безпеки."
    }
  },
  "more_features": {
    "title": "Досліджуйте Більше Функцій Додавання Водяних Знаків",
    "description": "Використовуйте наш API {{ProgLang}}, щоб додавати, переглядати, конвертувати та керувати водяними знаками в документах, слайдах, діаграмах тощо. {{ProdFullName}} допомагає захистити ваші файли та додати інформацію про авторське право без зайвих зусиль.",
    "image_description": "Додати водяний знак",
    "feature_1": {
      "title": "Легко Додавайте Водяні Знаки",
      "content": "{{ProdShortName}} дозволяє розробникам {{ProgLang}} швидко додавати текстові, зображення або динамічні водяні знаки до бізнес-документів. Забезпечте свою безпеку файлів та брендинг з мінімум зусиль."
    },
    "feature_2": {
      "title": "Повністю Налаштовувані Водяні Знаки",
      "content": "Змінюйте розмір водяного знака, обертання, прозорість, колір і шрифт за допомогою {{ProdShortName}}. Нехай ваш водяний знак ідеально підходить до документа та зберігайте важливий контент видимим."
    },
    "feature_3": {
      "title": "Використовуйте Функції Документів для Додавання Водяних Знаків",
      "content": "Скористайтеся вбудованими функціями документів, такими як анотації PDF, фони Word або колонтитули Excel, для додавання водяних знаків. {{ProdShortName}} працює з документами для ефективного, не нав’язливого водяного знаку."
    },
    "code_1": {
      "title": "Додати Зображення Водяного Знака до DOCX",
      "content": "Цей приклад демонструє, як застосувати ефекти зображення до водяних знаків на основі форм.",
      "comment_1": "Відкрити документ Word",
      "comment_2": "Встановити параметри водяного знака",
      "comment_3": "Створити водяний знак",
      "comment_4": "Зберегти документ з водяним знаком"
    }
  },
  "excel": {
    "ext": "xlsx",
    "head": {
      "title": "Додайте Водяні Знаки до Файлів Excel",
      "description": "Автоматично додавайте зображення водяні знаки до Excel файлів за допомогою {{ProgLang}}. Обробляйте кілька файлів одночасно для послідовного захисту."
    },
    "header": {
      "title": "Додайте Водяні Знаки до Excel з {{ProgLang}}",
      "description": "Легко додавайте текстові або зображення водяні знаки до Excel файлів, використовуючи {{ProgLang}}. Наші посібники покажуть вам, як підтримувати ваші таблиці професійними та захищеними з мінімум ручних зусиль.",
      "subtitle": "API {{ProdFullName}}",
      "action_title": "Завантажте {{PackageStoreName}} безкоштовно"
    },
    "about": {
      "title": "Бібліотека {{ProdFullName}}",
      "content": "{{ProdFullName}} дозволяє вам додавати водяні знаки до електронних таблиць Excel у {{ProgLang}}. Ви можете використовувати різні типи водяних знаків і налаштовувати прозорість, обертання та вирівнювання. Бібліотека також допомагає вам знаходити та керувати існуючими водяними знаками, щоб захистити ваші файли від підробки."
    },
    "formats": {
      "title": "Додайте Текстові та Зображення Водяні Знаки до Excel з {{ProgLang}}",
      "description": "Використовуйте {{ProdShortName}} для швидкого додавання користувацьких водяних знаків до Excel файлів. Покращте безпеку та брендинг документів з гнучкими інструментами водяного знака."
    }
  },
  "word": {
    "ext": "docx",
    "head": {
      "title": "Додайте Водяні Знаки до Документів Word",
      "description": "Легко додавайте водяні знаки до файлів Word, щоб захистити свій бренд і контент."
    },
    "header": {
      "title": "Створення Водяних Знаків у Word та OpenOffice за допомогою {{ProgLang}}",
      "description": "Додавайте водяні знаки до ваших документів Word з нашою бібліотекою {{ProgLang}}. Налаштовуйте їх на відповідність вашим брендованим чи безпековим потребам.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Завантажте {{PackageStoreName}} безкоштовно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} спрощує додавання текстових і зображення водяних знаків до документів Microsoft Word у {{ProgLang}}. Ви можете розміщувати водяні знаки точно де вам потрібно, і він працює з файлами DOC, DOCX і RTF. Водяні знаки зливаються з вашим контентом, зберігаючи ваші документи читабельними і захищеними."
    },
    "formats": {
      "title": "Водяний Знак для Файлів Word та OpenOffice за допомогою {{ProgLang}}",
      "description": "Додавайте професійні водяні знаки до ваших документів Word та OpenOffice, використовуючи наш API {{ProgLang}}. Захистіть свої файли та зробіть їх виглядати чудово."
    }
  },
  "image": {
    "ext": "jpeg",
    "head": {
      "title": "Водяні Знаки на Зображеннях з {{ProgLang}}",
      "description": "Дізнайтеся, як додавати водяні знаки до зображень у {{ProgLang}}. Захистіть свої фотографії, не втрачаючи якості."
    },
    "header": {
      "title": "Швидке Додавання Водяних Знаків до Зображень з {{ProgLang}}",
      "description": "Наш інструмент {{ProgLang}} дозволяє швидко додавати водяні знаки до зображень. Підтримує багато форматів, від фотографій до цифрового мистецтва.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Завантажте {{PackageStoreName}} безкоштовно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} допомагає вам додавати водяні знаки до зображень у {{ProgLang}}. Воно підтримує JPEG, PNG, BMP, TIFF та інші формати. Ви можете змінювати прозорість, розмір і положення водяного знака відповідно до ваших потреб. Використовуйте це для захисту ваших зображень або додавання брендингу, зберігаючи при цьому оригінальну якість."
    },
    "formats": {
      "title": "Додайте Водяні Знаки до Зображень з {{ProgLang}}",
      "description": "Захистіть свої зображення за допомогою нашого набору інструментів {{ProgLang}}. Додавайте водяні знаки до багатьох форматів зображень швидко та легко."
    }
  },
  "photo": {
    "ext": "png",
    "head": {
      "title": "Легко Додавайте Водяні Знаки до Ваших Фотографій",
      "description": "Додайте водяні знаки до своїх фотографій у {{ProgLang}}, щоб захистити вашу роботу та авторські права."
    },
    "header": {
      "title": "Швидке Додавання Водяних Знаків до Фотографій з {{ProgLang}}",
      "description": "Використовуйте нашу бібліотеку {{ProgLang}} для швидкого додавання водяних знаків до ваших фотографій. Захистіть свої авторські права та брендинг, не втрачаючи якість зображення.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Завантажте {{PackageStoreName}} безкоштовно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} чудово підходить для фотографів, які хочуть захистити свою роботу. Додавайте текстові або зображення водяні знаки до фотографій у форматах JPEG, PNG і RAW. Регулюйте прозорість, розмір і положення так, щоб ваш водяний знак ідеально підходив, а ваші фотографії залишалися привабливими."
    },
    "formats": {
      "title": "Захистіть Ваші Фотографії з Водяними Знаками у {{ProgLang}}",
      "description": "Додавайте користувацькі водяні знаки до ваших фотографій за допомогою нашого API {{ProgLang}}. Захищайте свої зображення та зробіть їх вигляд професійно."
    }
  },
  "powerpoint": {
    "ext": "pptx",
    "head": {
      "title": "Додайте Водяні Знаки до Презентацій",
      "description": "Легко додавайте водяні знаки до ваших слайдів PowerPoint для додаткового захисту."
    },
    "header": {
      "title": "Просунуте Додавання Водяних Знаків до Презентацій у {{ProgLang}}",
      "description": "Додавайте текстові та зображення водяні знаки до слайдів PowerPoint за допомогою нашого API {{ProgLang}}. Прекрасно підходить для забезпечення безпеки та професійності ваших презентацій.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Завантажте {{PackageStoreName}} безкоштовно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} дозволяє вам додавати просунуті водяні знаки до PowerPoint-презентацій у {{ProgLang}}. Захистіть конфіденційну інформацію або додайте логотип вашої компанії до слайдів. Ви можете додавати водяні знаки до окремих слайдів або всього виступу, а також налаштовувати їх вигляд та місце розташування."
    },
    "formats": {
      "title": "Водяні Знаки для Презентацій з {{ProgLang}}",
      "description": "Використовуйте наш набір інструментів {{ProgLang}} для швидкого додавання водяних знаків до файлів PowerPoint. Захистіть свої слайди та зробіть їх вигляд гострим."
    }
  }
}