{
  "examples": {
    "comment_1": "Добавьте текстовый водяной знак в файл {{FileFormatUp}}",
    "comment_2": "Выберите файл, который вы хотите заверить водяным знаком",
    "comment_3": "Создайте объект текстового водяного знака",
    "comment_4": "Сохраните обновленный файл {{FileFormatUp}}"
  },
  "steps": {
    "title": "Добавление водяных знаков: {{ProgLang}} Водяное знаку для {{FileformatCap}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}})** это библиотека, которая позволяет быстро добавлять водяные знаки к различным типам бизнес-файлов. Следуйте этим шагам, чтобы быстро добавить водяные знаки к вашим документам на {{ProgLang}}:",
      "step_1": "**Начните с водяных знаков:** Начните с создания экземпляра класса {{TextWatermarkerBold}}. Передайте ваш файл {{FileformatCap}} (в виде пути или потока) в конструктор, чтобы открыть его для добавления водяного знака.",
      "step_2": "**Создайте свой водяной знак:** Создайте объект {{TextWatermarkBold}} с вашим текстом и настройками. Вы можете добавлять водяные знаки на любую страницу или даже к элементам документа, таким как заголовки или вложения.",
      "step_3": "**Настройте водяной знак:** Измените размер, положение, шрифт, цвет и выравнивание водяного знака в соответствии с вашими потребностями. Это поможет вашему водяному знаку выглядеть оптимально в документе.",
      "step_4": "**Примените и сохраните:** Используйте метод {{TextWatermarkerBold}}, чтобы добавить ваш(и) водяной знак(и) в документ. Сохраните результат, лучше в новый файл для безопасности."
    }
  },
  "more_features": {
    "title": "Изучите больше возможностей добавления водяных знаков",
    "description": "Используйте наш API {{ProgLang}} для добавления, просмотра, преобразования и управления водяными знаками в документах, слайдах, диаграммах и многом другом. {{ProdFullName}} помогает защитить ваши файлы и добавить информацию о авторских правах без усилий.",
    "image_description": "Добавить водяной знак",
    "feature_1": {
      "title": "Легкое добавление водяных знаков",
      "content": "{{ProdShortName}} позволяет разработчикам {{ProgLang}} быстро добавлять текстовые, графические или динамические водяные знаки в бизнес-документы. Защищайте свои файлы и сохраняйте брендинг с минимальными усилиями."
    },
    "feature_2": {
      "title": "Полная настраиваемость водяных знаков",
      "content": "Изменяйте размер водяного знака, угол поворота, прозрачность, цвет и шрифт с помощью {{ProdShortName}}. Настройте ваш водяной знак так, чтобы он идеально вписывался в документ и отражал важный контент."
    },
    "feature_3": {
      "title": "Используйте функции документа для добавления водяных знаков",
      "content": "Используйте встроенные функции документа, такие как аннотации PDF, фоны Word или заголовки Excel для добавления водяных знаков. {{ProdShortName}} работает со структурами документа для эффективного и ненавязчивого добавления водяных знаков."
    },
    "code_1": {
      "title": "Добавьте изображение водяного знака в DOCX",
      "content": "Этот пример показывает, как применить эффекты изображения к водяным знаком в форме.",
      "comment_1": "Откройте документ Word",
      "comment_2": "Настройте параметры водяного знака",
      "comment_3": "Создайте водяной знак",
      "comment_4": "Сохраните документ с водяным знаком"
    }
  },
  "excel": {
    "ext": "xlsx",
    "head": {
      "title": "Добавьте водяные знаки в файлы Excel",
      "description": "Автоматически добавляйте изображение водяных знаков в файлы Excel с помощью {{ProgLang}}. Обрабатывайте множество файлов одновременно для обеспечения единообразной защиты."
    },
    "header": {
      "title": "Добавьте водяные знаки в Excel с {{ProgLang}}",
      "description": "Добавляйте текстовые или графические водяные знаки в файлы Excel с помощью {{ProgLang}}. Наши руководства показывают, как сохранить ваши таблицы в профессиональном и безопасном состоянии с минимальными усилиями.",
      "subtitle": "{{ProdFullName}} API",
      "action_title": "Скачайте {{PackageStoreName}} бесплатно"
    },
    "about": {
      "title": "{{ProdFullName}} библиотека",
      "content": "{{ProdFullName}} позволяет добавлять водяные знаки к таблицам Excel на {{ProgLang}}. Вы можете использовать различные типы водяных знаков и настраивать прозрачность, угол поворота и выравнивание. Библиотека также помогает вам находить и управлять существующими водяными знаками, чтобы защитить ваши файлы от подделки."
    },
    "formats": {
      "title": "Добавьте текстовые и изображений водяные знаки в Excel с {{ProgLang}}",
      "description": "Используйте {{ProdShortName}} для быстрого добавления пользовательских водяных знаков в файлы Excel. Улучшите безопасность документа и брендинг с помощью гибких инструментов добавления водяных знаков."
    }
  },
  "word": {
    "ext": "docx",
    "head": {
      "title": "Добавьте водяные знаки в документы Word",
      "description": "Добавьте водяные знаки в файлы Word для защиты вашего бренда и контента."
    },
    "header": {
      "title": "Создайте водяные знаки в Word и OpenOffice с {{ProgLang}}",
      "description": "Добавляйте водяные знаки в ваши документы Word с помощью нашей библиотеки {{ProgLang}}. Настраивайте их в соответствии с вашим брендом или потребностями безопасности.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Скачайте {{PackageStoreName}} бесплатно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} упрощает добавление текстовых и графических водяных знаков в документы Microsoft Word на {{ProgLang}}. Вы можете размещать водяные знаки точно там, где хотите, и они подходят для файлов DOC, DOCX и RTF. Водяные знаки интегрируются в ваш контент, сохраняя читаемость и защищая ваши документы."
    },
    "formats": {
      "title": "Добавьте водяные знаки в файлы Word и OpenOffice с {{ProgLang}}",
      "description": "Добавьте профессиональные водяные знаки в ваши документы Word и OpenOffice с помощью нашего API {{ProgLang}}. Защитите ваши файлы и сохраняйте их привлекательный внешний вид."
    }
  },
  "image": {
    "ext": "jpeg",
    "head": {
      "title": "Добавляйте водяные знаки на изображения с {{ProgLang}}",
      "description": "Узнайте, как добавлять водяные знаки на изображения в {{ProgLang}}. Защитите ваши фотографии без потери качества."
    },
    "header": {
      "title": "Быстрое добавление водяных знаков на изображения с {{ProgLang}}",
      "description": "Наш инструмент {{ProgLang}} позволяет быстро добавлять водяные знаки на изображения. Поддерживаются различные форматы, от фотографий до цифрового искусства.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Скачайте {{PackageStoreName}} бесплатно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} помогает добавлять водяные знаки к изображениям на {{ProgLang}}. Он поддерживает JPEG, PNG, BMP, TIFF и другие форматы. Вы можете изменить прозрачность, размер и положение водяного знака в соответствии с вашими потребностями. Используйте его для защиты ваших изображений или добавления брендинга, сохраняя оригинальное качество."
    },
    "formats": {
      "title": "Добавьте водяные знаки на изображения с {{ProgLang}}",
      "description": "Защитите ваши изображения с помощью нашего набора инструментов {{ProgLang}}. Быстро и просто добавляйте водяные знаки к множеству форматов изображений."
    }
  },
  "photo": {
    "ext": "png",
    "head": {
      "title": "Легко добавляйте водяные знаки к вашим фотографиям",
      "description": "Добавьте водяные знаки к вашим фотографиям в {{ProgLang}}, чтобы защитить свою работу и авторские права."
    },
    "header": {
      "title": "Быстрое добавление водяных знаков к фотографиям с {{ProgLang}}",
      "description": "Используйте нашу библиотеку {{ProgLang}}, чтобы быстро добавить водяные знаки к вашим фотографиям. Защитите свои авторские права и бренд, не теряя качества изображения.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Скачайте {{PackageStoreName}} бесплатно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} идеально подходит для фотографов, которые хотят защитить свою работу. Добавляйте текстовые или графические водяные знаки к фотографиям в форматах JPEG, PNG и RAW. Настраивайте прозрачность, размер и положение так, чтобы ваш водяной знак идеально вписывался, а фото оставалось привлекательным."
    },
    "formats": {
      "title": "Защитите ваши фотографии с водяными знаками в {{ProgLang}}",
      "description": "Добавьте пользовательские водяные знаки к вашим фотографиям с помощью нашего API {{ProgLang}}. Сохраняйте ваши изображения в безопасности и профессиональном виде."
    }
  },
  "powerpoint": {
    "ext": "pptx",
    "head": {
      "title": "Добавьте водяные знаки к презентациям",
      "description": "Легко добавьте водяные знаки к вашим слайдам PowerPoint для дополнительной безопасности."
    },
    "header": {
      "title": "Расширенное добавление водяных знаков к презентациям на {{ProgLang}}",
      "description": "Добавляйте текстовые и графические водяные знаки на слайды PowerPoint с помощью нашего API {{ProgLang}}. Отличный способ обеспечить защиту ваших презентаций и их профессиональный вид.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Скачайте {{PackageStoreName}} бесплатно"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} позволяет добавлять продвинутые водяные знаки к презентациям PowerPoint на {{ProgLang}}. Защитите конфиденциальную информацию или добавьте логотип вашей компании на слайды. Вы можете добавлять водяные знаки на отдельные слайды или всю презентацию, а также настраивать их внешний вид и расположение."
    },
    "formats": {
      "title": "Добавление водяных знаков к презентациям на {{ProgLang}}",
      "description": "Используйте наш набор инструментов {{ProgLang}}, чтобы быстро добавлять водяные знаки к файлам PowerPoint. Защищайте ваши слайды и сохраняйте их четкими."
    }
  }
}