{
  "examples": {
    "comment_1": "Générer un filigrane d'image dans le fichier {{FileFormatUp}}",
    "comment_2": "Fournir le chemin du fichier source au constructeur {{TextWatermarker}}",
    "comment_3": "Générer une instance de filigrane d'image avec un fichier image",
    "comment_4": "Enregistrer le résultat {{FileFormatUp}} filigrané"
  },
  "steps": {
    "title": "Générez sans effort des filigranes pour les documents {{FileformatCap}}",
    "content": {
      "title": "**[{{ProdFullName}}]({{ProductUrl}}) :** Bibliothèque de filigrane avancée pour les applications {{EnvName}}. Renforcez votre solution et sécurisez les documents avec des filigranes juste à temps.",
      "step_1": "**Classe principale : Watermarker.** La classe principale de notre API est {{TextWatermarkerBold}}. Vous devez l'instancier avant le traitement du document. N'oubliez pas de transmettre le fichier {{FileformatCap}} au constructeur en tant que chemin ou objet flux.",
      "step_2": "**Création de votre filigrane.** L'étape suivante consiste à construire un objet Watermark du type souhaité. Il peut être placé non seulement sur une page de document spécifique, mais également dans des parties natives du document telles que des images ou des en-têtes.",
      "step_3": "**Affinage de l'apparence.** Définissez les propriétés du filigrane telles que la hauteur et la largeur, les alignements haut, gauche, central, les polices et les couleurs, etc.",
      "step_4": "**Application et enregistrement.** Utilisez la méthode {{TextWatermarkerBold}} pour ajouter un nouveau filigrane. N'hésitez pas à ajouter autant de filigranes que nécessaire. Vous pouvez enregistrer le document filigrané à n’importe quel emplacement."
    }
  },
  "more_features": {
    "title": "Améliorez votre jeu de filigrane",
    "description": "Débloquez des fonctionnalités avancées de filigrane grâce à notre API GroupDocs.Watermark pour .NET. Cet outil puissant permet de personnaliser et d'appliquer des filigranes avec précision sur différents types de documents afin de garantir une sécurité maximale et le respect des droits d'auteur avec un minimum de perturbations visuelles.",
    "image_description": "Solutions complètes de filigrane",
    "feature_1": {
      "title": "Options de carrelage sophistiquées",
      "content": "Étendez facilement vos filigranes à des documents entiers grâce à nos options de tuilage. Cette fonctionnalité permet aux filigranes de couvrir toute la zone du document, empêchant ainsi leur suppression et garantissant une protection complète du document sans compromettre la conception ou la lisibilité."
    },
    "feature_2": {
      "title": "Personnalisation des couleurs éclatantes",
      "content": "Ajoutez une touche de couleur à vos filigranes ! Notre API permet une personnalisation complète des couleurs, ce qui vous permet d'appliquer des filigranes qui correspondent parfaitement à l'image de marque de votre entreprise ou au style de vos documents. Améliorez l'attrait visuel tout en conservant des fonctionnalités de sécurité robustes."
    },
    "feature_3": {
      "title": "Paramètres de sécurité améliorés",
      "content": "Améliorez la sécurité des documents grâce à des paramètres avancés de filigrane. Configurez des filigranes multicouches, incorporant à la fois des éléments visibles et invisibles, pour vous protéger contre les copies non autorisées et garantir que seuls les destinataires prévus peuvent accéder aux informations critiques."
    },
    "code_1": {
      "title": "Générer un filigrane PowerPoint",
      "content": "Cet exemple montre comment ajouter un filigrane aux images d'arrière-plan PPTX",
      "comment_1": "Charger la présentation PPTX",
      "comment_2": "Configurer les propriétés du filigrane",
      "comment_3": "Fond de diapositives en filigrane",
      "comment_4": "Enregistrer la présentation traitée"
    }
  },
  "doc": {
    "head": {
      "title": "Filigrane {{FileFormatUp}} fichiers avec .NET C#",
      "description": "Implémentez .NET filigranes C# dans les fichiers {{FileFormatUp}} pour protéger et gérer efficacement vos Word documents."
    },
    "header": {
      "title": "Améliorez la sécurité {{FileFormatUp}} avec des filigranes C#",
      "description": "Utilisez .NET C# pour intégrer des filigranes sécurisés dans les fichiers {{FileFormatUp}}, ce qui est idéal pour protéger MS Word documents dans des contextes juridiques et professionnels.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} utilise .NET C# pour fournir une solution sophistiquée de filigrane pour {{FileFormatUp}} fichiers, couramment utilisée dans Microsoft Word. Cette API permet aux développeurs d'insérer des filigranes textuels et graphiques personnalisables en termes d'opacité, de couleur et de position. Améliorez la sécurité des documents grâce à des filigranes pouvant inclure des horodatages, des logos ou des étiquettes confidentielles, afin de dissuader efficacement toute utilisation non autorisée et de garantir l'authenticité des documents. L'API est conçue pour s'intégrer parfaitement aux frameworks .NET, ce qui la rend idéale pour les applications de documentation juridique, de communication d'entreprise et de gestion des informations sensibles. Compatible avec .NET environnements C#, {{ProdShortName}} propose un ensemble d'outils robuste pour une protection complète des documents."
    },
    "formats": {
      "title": "Filigrane C# pour Word documents",
      "description": "Déployez .NET C# pour appliquer des filigranes précis et personnalisables dans {{FileFormatUp}} fichiers, renforçant ainsi la sécurité et l'intégrité de vos MS Word documents."
    }
  },
  "docx": {
    "head": {
      "title": "Filigrane C# pour les fichiers {{FileFormatUp}}",
      "description": "Utilisez .NET C# pour intégrer des filigranes dans les fichiers {{FileFormatUp}}, renforçant ainsi la sécurité de vos Word documents."
    },
    "header": {
      "title": "Sécurisez {{FileFormatUp}} avec .NET filigranes C#",
      "description": "Appliquez des techniques avancées de filigrane à {{FileFormatUp}} fichiers en utilisant .NET C#, ce qui est idéal pour protéger la propriété intellectuelle de Word documents de tous les secteurs.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} exploite la puissance de .NET C# pour ajouter des fonctionnalités sophistiquées de filigrane aux fichiers {{FileFormatUp}}. Cet outil est conçu pour une intégration fluide dans les environnements Microsoft Word, permettant l'application de filigranes dynamiquement évolutifs, transparents et positionnés en fonction de la mise en page du document. Il est idéal pour les documents juridiques, les rapports confidentiels et les politiques d'entreprise qui nécessitent à la fois visibilité et protection. Les fonctionnalités incluent des styles de texte personnalisés, un filigrane d'image et un placement conditionnel en fonction du contenu du document. Grâce à la prise en charge des derniers frameworks .NET, {{ProdShortName}} garantit que les mesures de sécurité de vos documents sont à la pointe de la technologie."
    },
    "formats": {
      "title": "Implémentation de filigranes dans {{FileFormatUp}} avec C#",
      "description": "Maîtrisez l'application de filigranes personnalisés et sécurisés dans {{FileFormatUp}} fichiers en utilisant .NET C#, essentiel pour l'intégrité des documents et la protection des droits d'auteur."
    }
  },
  "jpeg": {
    "head": {
      "title": "Protégez {{FileFormatUp}} avec des filigranes C# .NET",
      "description": "Intégrez des filigranes avancés dans {{FileFormatUp}} images en utilisant .NET C#, afin de garantir la sécurité des droits d'auteur et du contenu."
    },
    "header": {
      "title": "Filigrane C# avancé pour les fichiers {{FileFormatUp}}",
      "description": "Utilisez .NET C# pour appliquer des filigranes sécurisés et personnalisables à {{FileFormatUp}} images, ce qui est idéal pour protéger l'art numérique et les droits d'auteur photographiques.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} propose à .NET développeurs C# des outils robustes pour filigraner {{FileFormatUp}} images de manière efficace. Cette API s'intègre directement aux flux de travail de traitement d'images numériques, ce qui permet d'ajouter des filigranes qui peuvent être basés sur du texte, centrés sur un logo ou modelés. Les options de personnalisation incluent le réglage de l'opacité, la taille d'échelle et la modification de la rotation pour garantir que le filigrane se fond parfaitement sans nuire à l'esthétique d'origine de l'image. Idéal pour les photographes, les graphistes et les créateurs de contenu, {{ProdShortName}} protège contre toute utilisation non autorisée tout en préservant une qualité d'image élevée. Compatible avec toutes les versions majeures de .NET, cette solution est essentielle pour tous ceux qui ont besoin de sécuriser du contenu visuel dans un environnement numérique."
    },
    "formats": {
      "title": "Solutions de filigrane C# pour {{FileFormatUp}} images",
      "description": "Déployez .NET C# pour créer et gérer des filigranes dans {{FileFormatUp}} fichiers, renforçant ainsi la sécurité des images sur toutes les plateformes numériques."
    }
  },
  "jpg": {
    "head": {
      "title": "Filigrane C# pour {{FileFormatUp}} images",
      "description": "Intégrez le filigrane dans {{FileFormatUp}} fichiers en utilisant .NET C# pour protéger efficacement vos images numériques."
    },
    "header": {
      "title": "Sécurisez {{FileFormatUp}} Images avec .NET C#",
      "description": "Appliquez .NET C# pour créer des filigranes robustes pour {{FileFormatUp}} images, ce qui est idéal pour protéger les droits d'auteur et empêcher toute utilisation non autorisée.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit à .NET développeurs C# un cadre avancé pour ajouter des filigranes à JPG images. Cette API permet d'intégrer avec précision du texte, des logos et des filigranes graphiques dont l'opacité, la position et la taille sont personnalisables, ce qui est parfait pour les médias numériques et la photographie professionnelle. Améliorez la sécurité de vos images sans en sacrifier la qualité, grâce à des fonctionnalités conçues pour intégrer des filigranes qui découragent le piratage tout en préservant l'intégrité de l'illustration originale. Adapté à un large éventail d'applications, de la protection des photos personnelles à l'utilisation commerciale dans la publicité et les médias, {{ProdShortName}} garantit que vos actifs visuels sont marqués de manière unique et protégés légalement."
    },
    "formats": {
      "title": "Implémenter des filigranes dans {{FileFormatUp}} avec C#",
      "description": "Tirez parti de .NET C# pour intégrer des filigranes invisibles ou visibles dans les fichiers {{FileFormatUp}}, ce qui est essentiel pour un contenu numérique sécurisé et reconnaissable."
    }
  },
  "pdf": {
    "head": {
      "title": "Filigranes C# pour les documents {{FileFormatUp}} sécurisés",
      "description": "Utilisez .NET C# pour intégrer des filigranes dans {{FileFormatUp}}, afin de sécuriser les documents officiels et les informations sensibles."
    },
    "header": {
      "title": "Améliorez la sécurité {{FileFormatUp}} avec des filigranes C#",
      "description": "Implémentez .NET C# pour appliquer des filigranes dans {{FileFormatUp}} documents, garantissant ainsi la protection des documents juridiques, financiers et officiels.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} propose à .NET développeurs C# une API puissante pour insérer des filigranes dans {{FileFormatUp}} fichiers, un outil essentiel pour la sécurité des documents dans les secteurs des entreprises, du droit et des administrations. Cette API prend en charge des options complètes de personnalisation des filigranes, notamment la mise en forme du texte, l'intégration d'images et le placement dynamique pour s'adapter à différentes mises en page de documents. Qu'il s'agisse de conclure des accords confidentiels, de protéger du matériel protégé par des droits d'auteur ou de marquer des informations confidentielles, {{ProdShortName}} garantit que tous les PDF indiquent la propriété de manière claire et professionnelle. Les fonctionnalités supplémentaires incluent la rotation des filigranes, le contrôle de la transparence et les fonctionnalités de superposition, compatibles avec tous les frameworks .NET modernes."
    },
    "formats": {
      "title": "Sécurisation de {{FileFormatUp}} fichiers avec des filigranes C# .NET",
      "description": "Utilisez .NET C# pour intégrer des filigranes sécurisés et personnalisés dans {{FileFormatUp}} documents, ce qui est idéal pour protéger les informations officielles et sensibles."
    }
  },
  "png": {
    "head": {
      "title": "Sécurisez {{FileFormatUp}} avec .NET filigranes C#",
      "description": "Intégrez des filigranes dans {{FileFormatUp}} fichiers en utilisant .NET C#, ce qui est parfait pour les droits d'auteur et la sécurité des images."
    },
    "header": {
      "title": "Filigrane C# pour les fichiers {{FileFormatUp}}",
      "description": "Utilisez .NET C# pour appliquer des filigranes avancés à {{FileFormatUp}} images, préservant ainsi efficacement le contenu artistique et numérique.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit une boîte à outils C# spécialisée .NET pour intégrer des filigranes dans les fichiers {{FileFormatUp}}, destinée aux artistes, designers et créateurs de contenu qui ont besoin de protéger leurs actifs visuels. Cette API permet d'ajouter facilement des filigranes transparents et opaques qui peuvent être positionnés et redimensionnés de manière complexe afin de préserver l'intégrité de l'image d'origine tout en garantissant une protection juridique. Les fonctionnalités incluent des filigranes personnalisés pour le texte et les images, un contrôle précis de l'opacité des filigranes et la possibilité d'ajouter des filigranes multicouches pour une sécurité accrue. Que ce soit pour un usage personnel ou des portfolios professionnels, {{ProdShortName}} garantit que vos PNG images sont protégées contre toute reproduction et utilisation non autorisées, et ce, dans .NET environnements."
    },
    "formats": {
      "title": "Implémentation de filigranes dans {{FileFormatUp}} avec C#",
      "description": "Déployez .NET C# pour créer des filigranes discrets ou en gras dans {{FileFormatUp}} images, garantissant à la fois une flexibilité esthétique et une protection robuste des droits d'auteur."
    }
  },
  "ppt": {
    "head": {
      "title": "Filigranes C# pour les fichiers PowerPoint",
      "description": "Appliquez des filigranes dynamiques aux fichiers PowerPoint à l'aide de .NET C# pour renforcer la sécurité de la présentation."
    },
    "header": {
      "title": "Protégez {{FileFormatUp}} avec des filigranes C# .NET",
      "description": "Utilisez .NET C# pour insérer des filigranes personnalisables dans PowerPoint présentations, ce qui est idéal pour sécuriser le contenu professionnel et universitaire.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit à .NET développeurs C# les outils nécessaires pour intégrer des filigranes de manière fluide dans les fichiers PowerPoint (PPT). Cette API est idéale pour ajouter des filigranes visibles et invisibles, garantissant ainsi la protection des présentations contre toute utilisation et distribution non autorisées. Grâce à des fonctionnalités avancées telles que la personnalisation des filigranes pour le style, la taille, la couleur et l'opacité du texte, ainsi que des fonctionnalités de filigrane des images, {{ProdShortName}} améliore la sécurité et le professionnalisme de vos diapositives. Il est particulièrement utile pour les environnements d'entreprise, d'enseignement et de formation où l'intégrité des documents est cruciale. Entièrement compatible avec toutes les versions de .NET, y compris .NET Core et .NET Framework."
    },
    "formats": {
      "title": "Sécurisation des fichiers {{FileFormatUp}} avec des filigranes C#",
      "description": "Intégrez des filigranes avancés dans PowerPoint documents en utilisant .NET C#, afin de protéger vos présentations contre les abus et les violations des droits d'auteur."
    }
  },
  "pptx": {
    "head": {
      "title": "Intégrer des filigranes dans {{FileFormatUp}} avec C#",
      "description": "Sécurisez vos {{FileFormatUp}} présentations avec .NET filigranes appliqués en C#, protégeant ainsi la propriété intellectuelle."
    },
    "header": {
      "title": "Filigrane C# avancé pour {{FileFormatUp}}",
      "description": "Implémentez .NET C# pour créer des filigranes robustes dans les fichiers {{FileFormatUp}}, ce qui est idéal pour renforcer la sécurité des présentations professionnelles et pédagogiques.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit une solution complète .NET C# pour le filigrane des fichiers {{FileFormatUp}}, adaptée aux professionnels qui ont besoin de sécuriser des supports de présentation. Cette API prend en charge l'intégration de filigranes personnalisables et pouvant inclure du texte, des logos ou d'autres graphiques. Il offre des fonctionnalités telles que le réglage de la transparence, de la taille et du positionnement, permettant aux filigranes d'être à la fois efficaces et subtils. Idéal pour les entreprises, les enseignants et toute personne présentant des informations sensibles ou confidentielles, {{ProdShortName}} garantit la sécurité de vos présentations, tout en préservant leur qualité esthétique. Compatible avec .NET 5 et versions ultérieures, cet outil étend le support robuste aux environnements Microsoft Office modernes."
    },
    "formats": {
      "title": "Solutions de filigrane C# pour les fichiers {{FileFormatUp}}",
      "description": "Tirez parti de .NET C# pour appliquer des filigranes discrets dans les fichiers {{FileFormatUp}}, protégeant ainsi vos présentations contre toute distribution non autorisée."
    }
  },
  "rtf": {
    "head": {
      "title": "Filigrane C# pour {{FileFormatUp}} documents",
      "description": "Intégrez .NET filigranes C# dans les fichiers {{FileFormatUp}} pour renforcer la sécurité de vos Word documents."
    },
    "header": {
      "title": "Sécurisez {{FileFormatUp}} avec .NET filigranes C#",
      "description": "Utilisez .NET C# pour appliquer des filigranes sécurisés et personnalisables aux fichiers {{FileFormatUp}}, ce qui est idéal pour préserver l'intégrité des documents dans MS Word environnements.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit à .NET développeurs C# des outils sophistiqués pour ajouter des filigranes aux documents {{FileFormatUp}} de manière efficace. Cette API permet l'intégration de filigranes visibles et transparents qui peuvent être personnalisés en termes de police, de couleur, de taille et de position, garantissant ainsi qu'ils se fondent parfaitement dans le document sans gêner la lisibilité. Idéal pour les documents juridiques, les documents de propriété intellectuelle et les communications sensibles, {{ProdShortName}} fournit une protection essentielle contre la copie et la modification non autorisées. L'outil est conçu pour être compatible avec toutes les versions de .NET, offrant ainsi une solution sécurisée et adaptable pour le filigrane des documents."
    },
    "formats": {
      "title": "Implémentation de filigranes dans {{FileFormatUp}} avec C#",
      "description": "Déployez .NET C# pour créer des filigranes robustes et subtils dans {{FileFormatUp}} documents, renforçant ainsi la sécurité et l'authenticité de vos Word fichiers."
    }
  },
  "tif": {
    "head": {
      "title": "Générer des filigranes C# pour {{FileFormatUp}} images",
      "description": "Utilisez .NET C# pour appliquer des filigranes précis à {{FileFormatUp}} images, afin de sécuriser votre contenu photographique."
    },
    "header": {
      "title": "Filigrane avancé pour {{FileFormatUp}} avec C#",
      "description": "Intégrez des filigranes de haute qualité dans {{FileFormatUp}} images en utilisant .NET C#, idéal pour les photographes et les archivistes qui ont besoin d'une protection renforcée des droits d'auteur.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} propose un framework C# robuste .NET pour le filigrane des fichiers {{FileFormatUp}}, adapté aux besoins des professionnels de la photographie et de l'archivage numérique. Cette API permet l'ajout transparent de filigranes personnalisables en termes d'opacité, de taille et de position, s'intégrant parfaitement à la nature haute résolution des images TIF. Les fonctionnalités incluent la possibilité d'appliquer à la fois du texte et des filigranes graphiques, essentiels pour faire valoir les droits d'auteur, empêcher toute utilisation non autorisée et améliorer la traçabilité des images. Grâce à des fonctionnalités avancées telles que le traitement par lots et le placement dynamique de filigranes, {{ProdShortName}} garantit la protection de vos images sans compromettre la qualité. Compatible avec toutes les plateformes .NET contemporaines, cet outil est indispensable pour sécuriser des actifs d'image de valeur."
    },
    "formats": {
      "title": "Sécurisation de {{FileFormatUp}} images avec .NET C#",
      "description": "Appliquez .NET C# pour intégrer des filigranes personnalisés et discrets dans {{FileFormatUp}} images, en évitant toute reproduction non autorisée et en garantissant l'intégrité des droits d'auteur."
    }
  },
  "tiff": {
    "head": {
      "title": "Générez {{FileFormatUp}} filigranes avec C#",
      "description": "Composez et ajoutez des filigranes précis à {{FileFormatUp}} images en utilisant .NET C#, afin de protéger votre contenu numérique."
    },
    "header": {
      "title": "Composez des filigranes pour {{FileFormatUp}} en C#",
      "description": "Générez des filigranes personnalisés et robustes dans {{FileFormatUp}} fichiers à l'aide de .NET C#, ce qui est essentiel pour protéger et gérer les images numériques et d'archives.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit une boîte à outils C# .NET complète pour générer, composer et ajouter des filigranes aux fichiers TIFF. Cette solution répond aux besoins uniques des archives numériques et de la photographie professionnelle, où le maintien de la qualité de l'image et la protection des droits d'auteur sont primordiaux. Les utilisateurs peuvent personnaliser l'opacité, l'échelle et l'emplacement des filigranes pour s'assurer qu'ils sont parfaitement intégrés sans nuire à l'image. La possibilité de générer des filigranes textuels ou graphiques, associée à des fonctionnalités avancées telles que la superposition de filigranes et la mise en forme conditionnelle, font de {{ProdShortName}} un outil indispensable pour tous ceux qui ont besoin de protéger leurs actifs visuels. Entièrement compatible avec les derniers environnements .NET, cette API améliore votre capacité à gérer et à sécuriser efficacement TIFF images."
    },
    "formats": {
      "title": "Améliorer la sécurité {{FileFormatUp}} avec des filigranes C#",
      "description": "Utilisez .NET C# pour générer et intégrer des filigranes personnalisés dans les fichiers {{FileFormatUp}}, ajoutant ainsi une couche de sécurité et de contrôle des droits d'auteur à vos images."
    }
  },
  "webp": {
    "head": {
      "title": "Ajouter des filigranes à {{FileFormatUp}} avec C#",
      "description": "Utilisez .NET C# pour générer et intégrer dynamiquement des filigranes dans {{FileFormatUp}} images, garantissant ainsi une protection complète."
    },
    "header": {
      "title": "Générez des filigranes pour {{FileFormatUp}} avec C#",
      "description": "Créez et appliquez des filigranes personnalisés à {{FileFormatUp}} fichiers à l'aide de .NET C#, ce qui est idéal pour les artistes numériques et les créateurs de contenu qui ont besoin de sécuriser leur travail.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit aux développeurs la possibilité de générer, de composer et d'ajouter des filigranes sophistiqués aux images WEBP via .NET C#. Cette API permet une personnalisation précise des filigranes, notamment du texte, des logos et des signatures numériques. Personnalisez l'opacité, la taille et le positionnement de votre filigrane pour obtenir une intégration parfaite sans compromettre l'esthétique de l'image. Idéal pour les photographes, les graphistes et tous les professionnels impliqués dans la production et la distribution d'images numériques, {{ProdShortName}} garantit que vos droits d'auteur sont intégrés en toute sécurité dans vos fichiers WEBP. Compatible avec tous les frameworks .NET modernes, il améliore la sécurité de l'image avec un impact minimal sur la qualité visuelle."
    },
    "formats": {
      "title": "Sécurisation de {{FileFormatUp}} images avec des filigranes C# .NET",
      "description": "Intégrez des filigranes avancés et personnalisables dans {{FileFormatUp}} images à l'aide de .NET C#, offrant ainsi une protection robuste et une valeur visuelle à vos œuvres créatives."
    }
  },
  "xls": {
    "head": {
      "title": "Créer des filigranes dans {{FileFormatUp}} avec C#",
      "description": "Utilisez .NET C# pour ajouter et gérer des filigranes dans les fichiers {{FileFormatUp}}, renforçant ainsi la sécurité de vos Excel documents."
    },
    "header": {
      "title": "Générer des filigranes C# pour les fichiers {{FileFormatUp}}",
      "description": "Implémentez un filigrane robuste dans {{FileFormatUp}} feuilles de calcul avec .NET C#, conçu pour protéger les données financières et personnelles dans Excel.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit à .NET développeurs C# les outils nécessaires pour créer, composer et intégrer efficacement des filigranes dans les fichiers XLS. Cette API est conçue pour une intégration fluide dans Excel flux de travail, en facilitant l'ajout de filigranes visibles et invisibles, personnalisables en termes d'opacité, de texte et d'images. Idéal pour sécuriser les informations sensibles contenues dans des feuilles de calcul financières, des rapports clients ou tout autre document Excel nécessitant la confidentialité, {{ProdShortName}} propose des fonctionnalités avancées telles que le placement conditionnel de filigranes sur la base d'une analyse de contenu. Compatible avec tous les environnements .NET, cette solution garantit la protection de vos documents contre toute utilisation et distribution non autorisées."
    },
    "formats": {
      "title": "Appliquer des filigranes à {{FileFormatUp}} en C#",
      "description": "Utilisez .NET C# pour générer et intégrer dynamiquement des filigranes personnalisés dans {{FileFormatUp}} fichiers, protégeant ainsi efficacement vos Excel données."
    }
  },
  "xlsx": {
    "head": {
      "title": "Intégrer des filigranes dans {{FileFormatUp}} avec C#",
      "description": "Tirez parti de .NET C# pour générer et appliquer des filigranes dans {{FileFormatUp}} fichiers, afin de sécuriser vos Excel documents."
    },
    "header": {
      "title": "Sécurisez {{FileFormatUp}} feuilles avec .NET C#",
      "description": "Utilisez .NET C# pour créer des filigranes personnalisables pour les fichiers {{FileFormatUp}}, parfaits pour améliorer l'intégrité des documents et protéger les informations sensibles.",
      "subtitle": "{{ProdFullName}}",
      "action_title": "Téléchargez gratuitement sur {{PackageStoreName}}"
    },
    "about": {
      "title": "{{ProdFullName}}",
      "content": "{{ProdFullName}} fournit une solution puissante permettant à .NET développeurs C# de générer, d'ajouter et de gérer des filigranes dans les fichiers XLSX. Cette API est essentielle pour préserver la confidentialité et l'authenticité de Excel documents, en particulier dans les environnements corporatif, financier et juridique. Personnalisez vos filigranes à l'aide de nombreuses options, notamment des superpositions de texte et d'images, conçues pour être à la fois fonctionnelles et subtiles. Des fonctionnalités supplémentaires permettent d'automatiser le filigrane en fonction des propriétés du document et des conditions définies par l'utilisateur, garantissant ainsi que vos filigranes sont appliqués de manière cohérente et uniquement là où cela est nécessaire. {{ProdShortName}} est compatible avec les plateformes .NET contemporaines et prend en charge les fonctionnalités avancées Excel."
    },
    "formats": {
      "title": "Implémentation de filigranes dans {{FileFormatUp}} avec C#",
      "description": "Déployez .NET C# pour ajouter efficacement des filigranes avancés et sécurisés aux fichiers {{FileFormatUp}}, protégeant ainsi vos données professionnelles Excel."
    }
  }
}